{"title": "基于雨课堂的《计算机应用基础》混合式教学研究", "url": "https://www.lunwendata.com/thesis/2019/156573.html", "time": ["2019-02-25"], "info": "　　中图分类号：TP391 文献标识码：A 文章编号：1009-3044（2018）12-0130-02　　Abstract：The rapid development of mobile Internet has prompted a variety of information means to be used in the teaching， and constantly changing the traditional teaching methods. This paper analyzes the characteristics of the \"rain classroom\" and the concept of mixed teaching， and builds a mixed teaching mode based on \"rain classroom\". Then it applies this model to the teaching of computer application foundation， and explores its application effect.　　Key words： Rain classroom； mixed teaching； computer application foundation　　随着信息化的发展，智能手机基本普及到每一个用户，使得人们的生活和学习方式等都发生巨大变化。据中国互联网络信息中心发布的《第41 次中国互联网络发展状况统计报告》报告显示截至2017年12月，我国手机网民规模达7.53亿，网民中使用手机上网人群的占比由2016年的95.1%提升至97.5%[1]；移动互联网的快速发展促使多种信息手段被运用到教学当中，并不断地改变着传统的教学方式，教师利用信息技术为学生提供适当的学习资源和教学活动，采取面对面的传统教学和数字化的在线学习相结合的混合式教学模式，成为一种当前高校教学改革与创新的方向。　　1 雨课堂：智慧教学工具　　雨课堂是在移动互联网与大数据背景下由清华大学推出的智慧教学工具[2]。从软件组成的角度看，它分为三个部分：手机端、电脑端和远程服务器。其中，手机端和电脑端直接用于教师教学和学生学习，远程服务器用于支撑系统的运行和教学大数据的采集、存储、分析及决策。雨课堂的软件界面全部基于PPT 和微信，较好地契合了教师的教学需要，真正实现“课前预习―课中实践―课后反馈”三者的密切联系。　　雨课堂的主要功能如下：（1）幻灯片同步。教师可以将幻灯片同步到学生手机，学生在浏览时如果没有理解可以通过点击幻灯片下方的“不懂”按钮反馈给教师。（2）测试系统。教师可以在PPT 中添加试题对学生进行测试，并设定学生的提交时间，学生则通过手机微信中的界面作答，及时了解学生掌握知识点的程度。（3）课件推送。教师可以利用课前或课后时间向学生推送“手机课件”，通过课件的推送，让学生达到预习知识的效果，这样，在课堂上学生对知识的理解会更轻松，更透彻。（4）数据统计。雨课堂的课堂应答系统、“不懂”按钮、“弹幕式”讨论、 “手机课件”的推送等功能可以自动采集每位学生在学习过程中的数据，并生成图表的形式显示给教师，供教师教学参考。　　2基于“雨课堂”的混合式教学模式设计　　2.1 混合式教学　　关于混合式教学的概念，最早是由国外的培训机构提出来，在国内首次提出混合式教学概念的何克抗教授，他认为：混合学习（Blended Learning）是克服传统学习与网络学习的局限而将两者优势相结合的一种学习形式[3]。混合式教学在形式上是将传统的面对面授课和网络在线学习相结合，在技术上是将多媒体资源与学习平台相整合。在评价上是将形成性评价与总结性评价相结合。因此，采用混合式教学就是混合多种教学方法、手段、资源、环境等，真正实现“以学生为主体，以教师为主导”的理念。　　2.2混合式教学模式设计　　基于“雨课堂”的混合式教学模式主要从前端分析、课程设计、教学组织、教学评价四个主要方面设计，如下图1所示：　　前端分析主要是对学习对象、教学内容和学习环境三个要素进行分析[4]，其中，学习对象主要分析学生的年龄、专业特征；教学内容主要是对教学目标、教学大纲、教学重难点进行分析；学习环境是包括课堂教学环境和课前课后学习环境，是开展“雨课堂”教学的重要因素。　　课程设计主要包括对每个任务所需知识点进行微视频录制，设计教学大纲、PPT 课件、测试题等，同时，还要设计一些拓展内容，供学生提高能力使用。教学组织主要分为课前预习、课中实践、课后反馈三个阶段，是基于“雨课堂”的混合式教学模式设计的重要环节。教学评价由形成性评价和总结性评价构成，形成性评价主要参照课前预习数据、课堂测试质量、自评与互评等。总结性评价主要由学期期末考试、项目成果作品等构成。　　3基于“雨课堂”的混合式教学实践　　基于“雨课堂”开展混合式教学的准备工作比较简单，教师只要在电脑端安装好“雨课堂”插件，然后用微信“扫一扫”关注雨课堂后即可登录成功，创建好课程和班级，学生通过扫二维码进入相应班级学习。下面根据基于“雨课堂”的混合式教学模式，具体阐述雨课堂支持下的《计算机应用基础》混合式教学实施的全过程。　　3.1前端分析　　本研究选取某高职院校大一下学期旅游管理专业1班的48名学生进行教学实践。通过大一上学期教学情况得知，该班学生利用计算机学习的人数不多，对理论知识不感兴趣，动手操作能力不强，对《计算机应用基础》这门公共基础课不够重视。经调查，全班同学使用的手机都是智能机，而且这门课程平时上课都在多媒体机房里进行，机房里配备的有无线网络，教学环境完全符合开展基于“雨课堂”混合式教学的条件。   　　3.2课程设计　　根据全国等级考试大纲及教师对知识的理解，本研究将《计算机应用基础》内容分为六个项目，22个任务进行教学。如下表1所示：　　每个项目按所分解的任务进行授课，教师把每个任务的教学资源准备好后，在每次上课前可以将预习学习资源通过雨课堂发布给学生。这些预习学习资源可以是视频、PPT、自我测试题。　　3.3教学组织　　3.3.1课前预习　　假设本次课要学习的内容是《计算机应用基础》项目五“PowerPoint演示文稿”中的“任务2自定义动画”。教师对所学的内容进行教学设计，准备好学生需要预习的学习资源，利用PowerPoint演示文稿中的雨课堂插件将预习的学习资源推送到学生端。预习的学习资源可以是手机课件，也可以在雨课堂里插入的微视频。同时，在预习的学习内容后添加测试题，以供学生自我检测预习的结果。学生收到教师发布的预习资源后，不受时间和地点的限制，可以随时进行自主学习，完成测试等，在预习时如果存在问?}也可以向教师提问进行实时互动，教师可以查看到预习过的学生数，学生的自我测试情况。最后，教师可以在手机微信端查看学生预习的情况反馈，有针对性的调整教学内容，明确教学的重难点，进一步优化教学设计。　　3.3.2课中实践　　在课堂上，教师首先打开PowerPoint软件开启雨课堂授课，生成进入课堂的二维码，等待学生用微信扫描，学生用微信扫码或输入教师提供的邀请码即可进入课堂，此时教师点击开始上课， 教师的手机就变成遥控器可以控制课件的播放，同时学生微信端也同步接收到教师播放的PPT。教师根据教学目标和课前学生预习时出现错误较多的问题详细讲解、提出问题，引导学生积极展开讨论、学生通过“不懂”按钮和“弹幕”功能将实时学习情况反馈给教师，教师能看到PPT中每张幻灯片点“不懂”的人数和学生的弹幕需求，及时掌握学生学习情况，并调整教学策略，有针对性地开展课堂教学。如讲解时发现学生对“触发器的使用”知识存在较多疑问，教师可多演示几个实例，让学生在实践中理解操作方法。　　教师也可以推送随堂测试题到学生手机微信端，测试题可以设定答题时间，学生完成实时测试后能及时看到分数和答案，教师手机微信端也会看到统计数 据，如学生的得分、每题的正确率等。通过这些统计数据有利于教师对学生进行个性化指导。　　3.3.3课后反馈　　在课后反馈阶段，教师通过雨课堂生成的学生学习情况数据统计分析表，及时调整教学进度，并发布作业，推送拓展学习资源，学生根据自己的兴趣爱好和需要选择性的进行自主学习。 学生也可以随时点击查看之前上课时的PPT，重点复习课堂中点“不懂”和收藏的内容，实现个性化学习。教师在查看雨课堂的数据分析表时，对问题较多的学生可以进行一对一个性化指导。　　3.3.4教学评价　　雨课堂的数据统计功能，实时、动态、直接、详细地记录了学生学习的轨迹，有助于教师对学生的学习情况进行全面了解，根据这些数据和学生的自我评价、同学间的互评，教师给出学生学习这门课程的形成性评价成绩。在学期结束时，进行上机考试和笔试考试，再结合项目成果展示，形成总结性评价成绩，最后教师根据形成性评价和总结性评价的权重比例给学生打分。　　学期结束以后，针对《计算机应用基础》课程，对旅游管理专业1班的48名学生进行了调查，了解本学期使用雨课堂的学习情况。从调查数据来看，96%的学生认为雨课堂的使用调动了他们的学习积极性、主动性，并且雨课堂的使用成功地将他们的手机转变为帮助学习的工具，改变了以往课堂上玩手机的负面影响因素。从最终成绩来看，本学期的成绩远远高于上学期的成绩，并且对他们的实践创新能力也有较高的提升。　　4 结束语　　雨课堂支持下的混合式教学模式，利用“云+端”设备，将教学与移动技术高度融合，在技术上操作简单，实现师生间的实时交互，调动学生积极地参与到学习中，培养学生自主学习、创新能力。又因其对学生学习数据的详细记录，让教师的教学有了全面的数据依据，有利于实施因材施教、提高教学效率。当然， 将这种教学模式在实际教学实施中也会遇到一些问题，针对新问题，需要研究者们根据实际教学去思考、更新和发展，借助雨课堂智能教学工具推动教学方法的创新，促进教学改革的成功开展。"}
