{"title": "基于移动终端的大学计算机应用基础微课课程教学研究", "url": "https://www.lunwendata.com/thesis/2019/156029.html", "time": ["2019-02-19"], "info": "　　中图分类号：G642 文献标识码：A 文章编号：1009-3044（2016）32-0166-02　　Research on the Teaching of the Basic Course of Computer Application in University Based on Mobile Terminal　　ZHANG Qian-qing，FAN Wei　　（School of Mathematics and Information Engineering， Lianyungang Campus， Jiangsu Normal University， Lianyungang 222006， China）　　Abstract： According to the present situation of university computer application foundation teaching， combined with the characteristics and advantages of this new type of micro class teaching resources， mobile learning platform convenience， interactivity and openness of the new learning mode， put forward the teaching design mode of the mobile terminal application of basic computer course in university based on innovative education mode， improve the quality of teaching.　　Key words： wechat； university computer； foundation； mobile learning　　1 背景　　大学计算机基础是高校非计算机类学生开设的一门计算机课程，本课程的主要任务是培养学生的计算机应用能力，掌握计算；机的基本知识，利用计算机为未来工作和学习服务的技能。移动学习是一种新的学习模式，它结合了移动终端的计算能力和无线网络传输的能力[1]。学生通过各种移动终端，利于WIFI等无线网络来进行学习。微课程作为一种新的课程形式，形成了一种新的教学环境，以其短小精悍，针对性强等的优势受到教育界的青睐。学生可以随时随地获取信息，并充分利用零碎时间来实现真正意义上的自主学习。移动学习与微课的结合目前教育模式改革的趋势[2]。　　2 微课在大学计算机基础课程教学改革可行性　　微课多通过短小、精悍的微小视频为载体，记录教师在教学过程中围绕某个知识点而展开的精彩教与学活动全过程[3]，微视频短小精悍，时间一般为10分钟，符合学生的认知特点和学习规律，其次学习内容主题突出，设计合理，简单而完整，微课以微视频为主要实现手段，使讲授内容碎片化、点状化，和传统的课程中错综复杂的教学内容相比更加精简。最后微课基于网络，可以在线播放观看，也可灵活方便地将其保存到移动设备，有助于网络的传播与使用。　　大学计算机应用基础课程采用的理论课和实验课相结合的教学方式，理论部分是由理论课教师的讲授完成，实验部分是通过实验课实践操作完成。由于课时有限，仅靠课堂让学生完全消化吸收，是相当有难度的。而把某些基础的、重要的知识点制作微课，学生通过手机APP终端学习平台，利用课余零散时间来进行学习 由学生课前根据自身水平自主学习，减少学生间差异，课上这些内容将不再重复，教师在使用微课讲授计算机基础知识时，应立足该学科的基础框架，并结合微课教学的基本特点，充分发挥学生在在学习过程中的主体作用，激发学生在线学习的兴趣，让学生们进行互动探讨，从而不断提高微课教学的实际效果。　　3 基于移动终端的“计算机应用基础”微课平台设计的必要性　　3.1 智能手机学生拥有量大，使用频繁　　随着通信技术的飞速发展，，智能手机的功能已从一般的通信工具转变为学生日常学习、群体社交、娱乐游戏及网络购物等活动的重要媒介，移?拥难?习资源的编排对学生吸引力更强，学习内容的及时更新，更能激发学生学习的兴趣。移动学习环境可以让学生随时随地的学习，只要想学，就可以打开移动平台进行自由学习。　　3.2 移动技术的优势　　移动学习平台是一个集计算机技术、多媒体技术、无线网络通讯技术等应用的数字学习平台。Android 操作系统是一种基于Linux 内核、具有丰富的软硬件资源，支持各种网络协议，具有开源、免费等特点，成为目前最流行的智能手机操作系统。随着4G、WiFi等技术的迅猛发展，移动通信技术与云计算技术迅速卷席全球，为基于移动终端的教育发展提供了技术与物质准备。学生利用移动终端可以搜集大量学习资源，根据自身情况安排学习进度。移动终端平台开发功能对学生学习的浏览记录、播放记录、书签、注释等功能及时保存学习的记录，让学习者很清楚地知道自己的学习进度和问题所在，随时随地续学或复习，取得更好的学习效果。　　为此，使用移动终端可以有效地使用碎片时间，对于碎片化的学习，移动学习比传统的网络课程更具优势。微课的短小精悍、针对性的特点，以及使用零散的时间，随时随地的移动学习正好完美结合。把微课从网络课程推广到移动终端是教育模式的创新，将有利于微课的推广普及。   　　4 基于移动平台的计算机应用基础课程的微课系统设计　　“大学计算机应用基础”课程 APP 客户端包括用户登录，通知公告，课程概况（课程简介、课程大纲、参考文献），师资力量，教学内容（ 课程教学、历史沿革、理论课程设计、试验课程设计、理论课程内容） ，教学资源（ 电子课件、教学录像） ，课外阅读，在线考试，教学评价，信息反馈等。　　后台管理采用 B/S结构，管理员和老师通过浏览器访问教学资源平台管理功能，后台管理主要包括用户管理（ 用户查询、添加用户、删除用户、禁用用户、报名审核） ，系统管理（ 操作员管理、角色权限管理） ，教师队伍管理，教学资源管理，消息推送，内容发布，信息查询统计等。　　5 在大学计算机基础课程微课资源建设　　大学计算机基础微课内容采用任务驱动形式设计，每节微课内容都围绕一个具体任务来讲解知识点，因此要提供微课内容中使用的所有素材，使学生能够在观看微课时同步操作。对于每个微课视频，还提供相应练习题及配套素材，使学生能通过练习进一步掌握知识点内容。为了提高学生的综合应用能力，在各个章节布置开放性练习，要求学生将已掌握的计算机知识和专业知识结合，设计、完成一些作品。例如搜集一组实验数据，使用Excel进行分析，制作分析图表，并将分析结果制作成演示文稿。使学生学会将计算?C技术应用到所学专业中，培养学生信息素养，提高学生应用能力。　　微课视频及相关资源要发布给学生使用，需要一个微课教学平台。平台除了起发布作用之外，还需要监控学生的学习过程，以方便对学生的学习情况进行分析统计。目前，大学计算机基础微课视频及相关课程资源在已有的校内计算机自主学习平台中发布，学生登录学习平台后，可以根据需求选择观看要学习的微课视频，下载相应的微课资源包，完成课程配套练习。　　6 结束语　　几年来的教学实践证明，基于移动学习平台的教学模式以其便捷性、交互性以及开放性的特点为“计算机应用基础”的教学改革提供了一种新兴的教学方法，它更为符合移动互联网时代的发展趋势。微课的短小精悍、针对性的特点，以及使用零散的时间，随时随地的移动学习正好完美结合。移动终端与微课教学模式的结合将是教育教学模式发展的新方向。"}
