{"title": "高职院校“计算机文化基础”课程教学设计探讨", "url": "https://www.lunwendata.com/thesis/2019/156767.html", "time": ["2019-02-27"], "info": "　　中图分类号：G434 文献标识码：A 文章编号：1003-9082（2014）10-0076-01　　一、前言　　我国高等院校人才培养模式中，高职教育的地位愈发的重要了。作为我国专业技术人才培养的重要摇篮，在高职院校的人才培养方案中，计算机操作技能作为现代人才所必须具备的技能之一早已被明确地列为教学的重点。怎样依据目前高职院校人才方案中规定的培养目标有针对性地进行计算机教学改革，是摆在全体高职院校计算机教研工作者面前的首要问题。为了进一步提升高职院校计算机教学质量，我国高职院校应加快计算教学改革的进程。　　二、教改设计　　1.教学目标分析　　在计算机文化基础课程教学改革的现阶段，必须先要明确改革的目的进而确定改革的目标。教学改革的目的是：高职计算机文化基础课程的教学要适应社会对高职学生计算机应用能力的要求，要注重对学生信息素养和自主学习能力的培养。因此要使学生能掌握计算机基本知识和技能，使学生具备利用计算机作为现代化工具进行日常办公和数据处理、分析与解决实际问题的能力。　　2.教学内容确定　　伴随社会各界对计算机专业毕业生基本操作技能要求的不断提高，催使我们对教学内容进行了进一步的划分。具体分为计算机相关知识、Windows7操作系统操作、文档编辑处理、电子表格运用、演示文稿搭建以及网络基本概念六部分。在授课过程中受到课时少的制约，理论部分内容不全讲授，实操性较强的部分全部在多媒体教室或校内实训室进行。　　3.学生初始情况分析　　我们对 2010 级非计算机专业高职学生进行了调查，目的是得到大部分高职学生使用计算机操作技能的最初水平。统计结果显示随着初高中对计算机课程投入的加大，有 89.5%的学生在上学期间已经接触过计算机基本知识与简单操作。对于高职计算机基础课程中Windows操作系统、文档编辑、电子表格、演示文稿、网络基础5部分的统计分析，汇总得到学生掌握知识与操作技能的初始情况如表 1 所示。　　表1 学生学习课程之前对各操作技能的熟练度　　由此可见，学生对 Windows操作系统部分最为熟悉，76%学生掌握了基本操作技能（其中熟练掌握的达 15.3%，基本掌握的达 60.7%），所有学生对该部分都有过接触。其次过半的学生掌握了文档编辑的操作技能（其中熟练掌握的达 15.8%，基本掌握的达 47%）。相对而言，电子表格部分是学生的软肋，不太了解和完全不了解该部分知识技能的学生累计占 37.9%。同时演示文稿部分学生掌握的也不够理想。由此，授课教师在引导学生学习以及提供学习资料时就要有针对性、有意识地加强电子表格与演示文稿两部分的相关知识点和操作技能。　　4.教学设计过程　　教学过程的设计是要根据学生已经对所有讲授知识的了解情况和具体的教学内容来确定的。例如从上述调查结果中可知，基本掌握文档处理的学生达 60.7%。如此，我们就可以选择“探索式”的教学模式来进行文档处理部分的内容的讲授。下面是文档处理部分的教学设计，授课时间为100分钟。　　4.1教学场所设计　　该课程较为适合在校内实训机房或是多媒体网络教室中实施教学。我们可以使用多媒体网络教室为学生提供多种多样的学习资料，学生不但可以通过互联网和校园网的网络自主学习平台获得学习资源，而且还能进行自主探索式学习。其次多媒体网络教室或实训机房为学生提供了便利的交流平台，学生可以利用交流平台进行形式多样的讨论与作品展示，共享学习经验。这种教学场所的设计打破了传统的老旧式的“填鸭式”教学模式的场所运用，能极大地提高教师教学的积极性与学生学习的主动性，能更好地完成“探索式”教学。　　4.2教学情境设计　　首先由任课教师提出“学习情境”：假如学生是一名即将毕业的高职学生，现在要对自己的毕业论文按照要求进行编辑和排版，最终形成一份符合答辩规范的文档。毕业论文中可能存在一些格式错误、编辑有问题的部分。作为一名参加答辩的毕业生，请你使用 Microsoft Word2010来完成毕业论文的编辑、修订和排版工作。由于该情境与学生的日常学习密切相关，学生立刻会被此任务吸引住，同时产生浓厚兴趣、跃跃欲试，希望能成功地完成任务。　　4.3辅助资料设计　　随着教学过程的深入，任课教师要向学生发放与学习任务有关的一些学习资料。包括原始文档与编辑排版后的示范效果文档截图。分发给学生的资料数量不能过多，以几篇未编辑的毕业论文初稿为宜。于此同时，任课教师还要向学生说明课程的自主学习平台相关学习资料的使用方法，例如教师教学视频、PPT与教案、学习引导等。学生对照老师提供的素材和效果文档截图，学生的学习积极性与兴趣进一步得到激发，能充分发挥自身的主观能动性，探索式地完成学习任务。　　4.4自主与协作学习设计　　学生在开始完成任务时，任课教师就要提出具体的要求，包括了基本编辑、字符格式排版、段落格式排版、插入对象及图文混排、页面格式排版等几个子任务。对于一些简单的子任务，例如文本的编辑、段落的删除与合并操作等可由学生独立探索完成；但遇到一些难度较大的任务时，如样式的设置、目录的自动生成、奇偶页页眉不同设置等要通过分组协作形式来完成。利用先进的“多媒体网络教室软件”，每个小组可以展开组内学习，如遇到问题也能及时与教师交流、讨论。通过协作学习，所有学生解决问题的方法就可以被整个班级学生所共享，从而实现共同掌握所学知识和技能的目标。　　4.5评价考核设计　　在完成探索式学习任务之后，接下来就要求对自己完成的文档进行相互评价，做到取长补短；同时也可以开展学习小组之间的评价，由各学习小组展示各自的最终编辑文档，共同探讨完成任务的不同方法和策略；最终由教师进行评价，选择好的作品使用“网络教室软件”进行广播教学，归纳和总结。　　4.6迁移知识设计　　教学最终的环节是将课堂中所学到的知识点进行有效地迁移。我们要求学生掌握文档处理基本操作的技能时不能就此结束，而是要继续下去、勇于发现 Word文档编辑更广泛的应用，发掘更多操作技巧。除此之外，还要鼓励学生多参与一些计算机方面的技能大赛，在大赛的不断历练中将所学应用于实践中，从而有效地实现知识的迁移。　　三、结束语　　本文以Word文档处理的讲授过程为例，探究了目前教学改革阶段如何进行合理教学设计的一些想法。文中所采用学习案例的授课在多媒体教室中进行，任课教师采用“任务驱动”与“探索式”相结合的教学策略。在这种模式下，教师作为整个教学活动的组织者，开始要建立情境，提出任务，进一步展示任务的最终效果，让学生明确学习的目标；其次学生通过认真观察教师的演示，思考操作的要点，发现知识点之问的联系，从而对新知识进行意义建构。通过教学过程的改革设计，学生的学习兴趣得到了极大提高，学习效果显著提升。"}
