{"title": "计算机恶意软件的危害及防范方法", "url": "https://www.lunwendata.com/thesis/2019/160174.html", "time": ["2019-07-22"], "info": "　　中图分类号 TP3 文献标识码 A 文章编号 1674-6708（2019）231-0125-02　　计算机内部操作系统受到攻击后，容易面临着数据丢失以及软件被破坏等各类威胁，情况严重的甚至会致使系统瘫痪，给用户带来极大的经济损失。而文章则主要针对计算機应用过程中恶意软件攻击的危害性进行探讨，提出了自身的见解，希望计算机护理加强防范，提高防范意识，并从根源上避免恶意软件的侵袭。　　1 恶意软件类型及特点　　1.1 主要类型　　使用计算机的过程中，容易出现各类的安全威胁，恶意软件攻击可能是其中的典型，软件攻击难以被用户及时发现，选择潜伏在用户的计算机内选择性的删除或篡改用户的重要信息。简而言之，恶意软件的攻击将会给计算机系统造成巨大安全威胁，甚至给用户带来巨额经济损失。虽说部分用户以针对性的安装了防范程序，但却难以有效控制恶意软件的侵袭。值得一提的是，常见的恶意软件有以下几类：广告软件、浏览器劫持以及间谍软件？等等。　　1.2 恶意软件的危害　　第一，恶意软件可以劫持浏览器。用户在应用计算机的过程中很容易受恶意软件的攻击，直接劫持用户浏览器，修改其主页，并改变网络连接设置方式，更为严重的攻击甚至会导致计算机网络连接中断，给用户造成极大不便。　　第二，恶意软件可强制安装。很多时候，开发商受利益驱使就会在软件中绑定强制程序，此时用户为不知情的状态，这部分程序将导致计算机运行速度减缓，无法满足用户的应用需求，最后用户不得不选择二次维修，满足了开发商的一己私欲。这样的强制安装行为无疑损害了用户的自主选择，同时也是极其恶劣的行为[1-3]。　　第三，软件安装后无法卸载。在应用计算机的过程中，软件是极其重要的内容，通过软件可以辅助工作、学习，提高效率。但是，在软件下载的环节很多时候下载的均为携带病毒的软件，导致软件无法卸载，此类流氓是恶意软件如被用户安装，将会给用户造成诸多不便，同时还会带来许多困难，浪费了用户的精力，也消耗了用户的大量时间。　　第四，网页中自动弹出广告。很多开发商为了追求个人利益，会选择性的与广告商合作，将会以软件与广告相衔接。用户在浏览网页的过程中不经意间点击了广告信息，那么恶意软件将会直接被安装至电脑系统中，开启这部分软件后将会发现画面中的大部分均为骗人的广告，影响了用户的使用感，使用户受之侵扰。此外，还有一些恶意软件的表现形式多种多样，处于不断变化的状态，这部分软件可非法搜集用户的私密性以及重要数据等等，直接卸载用户所使用的软件，亦或是盗取、删减以及篡改用户的内部数据，给用户带来了极大的经济？损失[4-5]。　　2 计算机恶意软件的防范方案　　2.1 推进国内共享软件产业的进步　　近几年来，我国信息技术迅猛发展，同时也催生了许多恶意软件，这部分软件的攻击行为给用户带来了极大的经济损失，或给用户造成诸多困扰。经笔者分析后，可知此类软件的传播渠道相对较少，一般情况下会有软件都会通过共享软件这一途径进行快速传播。针对这一情况，许多发达国家都已制定了防范措施，要求用户通过付费的形式避免恶意软件攻击，此方式在某种程度上减少了软件的攻击行为，同时也给用户带来了一定的安全保障。但是，这样的防范对策无疑会增加用户的管理成本，部分用户不愿将资金投入到恶意软件的防范这一环节，无疑为恶意软件的发展提供了有利条件。　　因此，我国应当总结国外抵制恶意软件的经验，而后借鉴其中的可行之处。需要针对国内共享软件产业的发展形势进行控制，保证软件均为正版软件，以防恶意软件的侵袭，这样的发展模式不仅可以降低恶意软件的传播速度，还能提高用户的防范意识。在软件下载过程中选择应用正版软件，并在软件的使用过程中加强防范。不仅如此，还可以从软件开发的源头做起，首先制定完善的开发标准，提出明确要求，使得管理规范更加全面、完整，并将规章机制进行到实处，严格落实、加大管理力度，对于未履行制度规范的则要给予一定的惩罚，保证用户应用信息技术的安全性与可靠性[6-7]。　　2.2 增强网络管理人员的综合素质　　若想规避恶意软件的侵袭以及骚扰，均应当是网络管理人员意识到加强防范的重要性，提高其职责意识，不仅要增强专业素质，同时也要更具安全防范能力。建议从以下两个方面入手，切实提高网络管理员的综合素质。　　一方面，提高网络管理人员的技术水准。常见的计算机恶意软件侵袭可分为黑客软件与病毒软件等，需要结合恶意软件的类型，选择应用最为适宜的防范技术，并保证保温效率。另一方面，则要对网络安全问题提高重视，不仅如此，还应当积极参与到各类培训活动中，切实提高自身的专业素质，满足网络管理的技术要求，发挥其专业优势，将各类网络安全问题扼杀在襁褓中，避免使计算机受恶意软件的干扰，最大程度的降低损失。　　2.3 制定完善的恶意软件防范方案　　随着信息技术应用范围的推广，使得恶意软件的侵权行为越发猖獗，很难保证网络的运行安全。针对这一情况，建议用户结合自身的网络应用需要，首先明确计算机出现安全问题后给自身所造成的经济影响以及个人影响，而后再制定针对性的恶意软件防范方案，加强防御力度，从源头上做起做好防范措施。在制定防范方案的过程中，需要对所运用的计算机软件实施安全检测，若发现问题应及时查杀，避免恶意行为潜藏深处，给用户造成不必要的损失。建议用户可利用入侵防御系统、防火墙技术等，对恶意攻击以及干扰行为加以拦截，使用户不受恶意软件的侵袭。   　　2.4 网民与行业两者间共同监督　　用户在应用计算机的过程中受恶意软件攻击，将会产生极大的危害，那么此时可需要有效的措施加以防范。可从两个方面入手：第一，计算机生产企业应加大技术研发力度，提高防御能力，为用户提供先进的防御技术，用户在应用计算机的过程中做好把关，发挥防御技术的应用价值，将攻击行为予以拦截，避免给用户造成干扰。第二，则要提高网民的防范意识。需要了解如何与软件相关的攻击行为，避免点击不良网页、下载非正版软件以及浏览不良信息等，从自我做起，加强防范，以免受恶意软件的攻击，降低经济损失。　　除此之外，还应当提高用户的法律防范意识。恶意软件会给用户的生产生活带来诸多不便，情况严重的将涉及用户的个人利益。针对以上攻击行为，用户需要增强法律保护意识，拿起法律武器维护自身权益，从而避免受惠于软件的攻擊与侵害，达到防范的目的。　　2.5 运用身份验证机制　　用户以及企业在应用计算机的过程中，可针对性的采用身份验证机制，部分恶意软件会选择性的窃取用户个人信息，私自登录用户账户，而身份验证机制的应用可有效抵御上述行为，大大降低被攻击的几率。　　3 结论　　综上所述，本文主要针对计算机和软件的危害进行总结与探讨，而后提出了相应的防范对策，希望为部分用户带来借鉴与参考，同时也希望计算机管理人员提高防范意识，帮助用户提高防范能力，掌握更多的防御措施，真正从自我做起，抵制恶意软件的攻击，若因遭受恶意软件攻击而造成巨额经济损失，或给生产生活带来不便，有必要运用法律武器维护自身权益，减少恶意软件的危害。"}
