{"title": "计算机辅助大学英语学业测试对教学的反拨效应实证研究", "url": "https://www.lunwendata.com/thesis/2019/156327.html", "time": ["2019-02-22"], "info": "　　0 引言　　计算机和网络技术的飞速发展为英语教学提供了多途径、多维度、多层面的发展空间，也使英语测试手段发生了多样化、多模态、多角度的新变革。计算机辅助英语测试的出现正是在这种形势下因运而生的。它的反拨效应，即考试对教学和学习的影响具有两面性[1]：如果测试设计得科学，它会产生正面反拨效应，促进教学；反之，它会阻碍教学，产生负面反拨效应。测试主要对学生――教师、学习――教学两个层面产生影响[2]。反拨效应首先影响测试的参与者（教师和学生）对教学和学习任务的理解和态度，继而影响他们完成此任务的过程，最终影响学习结果[3]。　　2013年秋季，我校（宁夏大学）按照英语入学考试成绩，把新入校的2013级非英语专业本科生分为A、B、C三个等级，开始了大学英语分级教学，采取的教学模式是“2+2+X”。第一个“2”为小班面授课，每周两学时，教学内容为听、说训练，力图彰显听说教学的力度；第二个“2”也是小班面授课，每周两学时，教学内容为读、写、译教学；“X”为学生在校园网上的自主学习，时间、地点不限，主要是在线训练、测试学生的写作技能、阅读技能、翻译技能以及听力技能。并在期末考试时实施计算机辅助大学英语学业测试，评价学生的英语学习成果。那么，此种考试对大学英语教学的影响究竟如何呢？本研究以调查问卷的方式展开调研，旨在探讨此种考试对大学英语教学的反拨效应。　　1 研究设计　　本研究从2016年秋季开始，对2014、2015年级任课教师进行了计算机辅助大学英语学业测试反拨效应方面的调查。　　1.1 研究问题　　本研究力图发现计算机辅助大学英语学业测试的质量是否过关，考务安排是否合理，是否对教师的教学评价观念产生影响，从而带来教学目标、教学理念、教学方法、教学内容、课程设置、教学安排、教学态度、教学深广度、教学顺序和速度等方面的变化。具体研究问题是：　　1）计算机辅助大学英语学业测试的有效性如何？　　2）计算机辅助大学英语学业测试对教师的教学评价观念产生了怎样的影响？　　3）计算机辅助大学英语学业测试对教学目标、教学理念、教学方法、教学内容、课程设置、教学安排、教学态度、教学深广度、教学顺序和速度等方面产生了怎样的影响？　　4）计算机辅助大学英语学业测试对大学英语教学的反拨效应给我们什么启示？　　1.2 研究对象　　本研究以我校大学英语教师为研究对象，共有39位教师被调研。　　1.3 研究工具　　本研究采用问卷调查的方式，调研计算机辅助大学英语测试的反拨效应。发放问卷39份，回收有效问卷39份。问卷共有40个问题，涉及测试卷的有效性、教师的教学评价观念、教学目标、教学理念、教学方法、教学内容、课程设置、教学安排、教学态度、教学深广度、教学顺序和速度等方面的内容。问卷使用Likert五级评分法设计（5=完全同意，4=基本同意，3=不清楚，2=不太同意，1=完全不同意）。问卷信度经统计达到0.852，可靠有效，可以作为本次调查的有利工具。　　2 研究结果与讨论　　笔者利用SPSS统计软件对有效调查问卷进行了数据统计，分析得出每个问题的平均值和标准方差，结果如下。　　表1调查了计算机辅助大学英语学业测试是否有效。数据显示，第7、第9和第11个问题的均值在3以上，回答趋于同意。对于其他问题绝大多数教师的回答都是肯定的，均值都在4以上。这说明计算机辅助大学英语学业测试内容设计科学，题型安排合理，考试内容符合教学大纲的要求，考试各部分时间安排合理，考试各部分分数分配适中，考试评分标准合理，能反映学生当前的英语水平，不仅能检测学生在大学基础阶段英语学习的成果，而且能预测学生在今后学习工作中综合运用英语的能力，为教师的教学提供了反馈信息，是评估教师教学质量的一种有效手段，能帮助教师改进英语教学。　　表2 调查了计算机辅助大学英语学业测试考务安排是否合理。数据显示，绝大多数教师的回答是肯定的，均值基本在4以上。由此可见，计算机辅助大学英语学业测试考务安排比较合理，便于施考和阅卷，考试施考条件对所有考生一律平等，考务组织严密，保证了考试的严密性和公正性，考试分数报道准确及时。　　表3调查了计算机辅助大学英语学业测试对教师教学评价观念的影响。数据显示，对于第17题和第24题，绝大多数教师的回答是否定的，均值为3以下。对于第18题，绝大多数教师的回答是不清楚，均值为3。其他问题的回答趋于基本同意，均值都在3以上。这就是说，计算机辅助大学英语学业测试没有给教师的教学带来焦虑和压力。学生期末考试得分高并不意味着个人能力就强。学生的期末考试成绩对教师工作考核的影响不明显。计算机辅助大学英语学业测试激发了学生的学习动力，考试成绩对学生表现和奖学金评定有很大影响，对学生今后的就业和继续深造有一定影响。与此同时，教师们一致同意学位证应该与期末考试成绩挂钩。　　表4调查了计算机辅助大学英语学业测试对教师教学内容的影响。数据显示，绝大多数教师对第25个问题的回答是肯定的，均值在4以上。对于问题第26，27，28，绝大多数教师的回答趋于基本同意，均值在3以上。也就是说，他们会根据期末考试的题型改变调整平时的教学内容，会因为期末考试临近而有意识地调整教学内容，期末考试使教师把教学内容的重点不仅放在提高英语综合应用能力上，而且放在提高应试技巧上。   　　表5调查了计算机辅助大学英语学业测试对教师教学方法的影响。数据显示，对于问题29，30，32，绝大多数教师的回答是肯定的，均值达到4以上。对于问题第31，教师们的回答趋于基本同意，均值达到3以上。这说明他们在训练听力时，注重作者态度、事实细节和推测等方面来提高学生听力应试技巧；在训练阅读时，注重主旨大意、文章风格、背景知识等方面来提高学生阅读应试技巧；在训练翻译时，使用词语、句子翻译技能来提高翻译能力；在训练写作时，一定程度上使用写作模板来提高学生写作能力，也可能用别的方法训练学生的写作技能。　　表6调查了计算机辅助大学英语学业测试对大学英语教学各方面的影响。数据显示，对于问题33，34，35，36，40，绝大多数教师的回答是此种考试的影响正面大于负面，均值在4以上。对于问题37，38，39，绝大多数教师的回答是此种考试的影响基本上是正面的，均值都在3以上。换句话说，计算机辅助大学英语学业测试对教学目标、教学理念、课程设置、教学安排和英语教学产生了很高的正面反拨效应，对教学态度、教学深广度、教学顺序和速度产生了一定的正面反拨效应。　　3 启示与建议　　以上研究成果表明，计算机辅助大学英语学业测试对教学的反拨效应是正面大于负面且涉及多个方面，尤其表现在测试的有效性、考务安排的合理性、教师教学评价观念、教学内容、教学方法的调整、教学目标的确立等方面，此种考试确实促进了大学英语教学。　　但是，计算机辅助大学英语学业测试也存在个别负面反拨效应。比如，学生期末考试得分高并不意味着个人能力就强。这说明，此种考试还不能全面反映学生的语言能力，考试的命题范围没有全面覆盖所要考核的技能，考试任务的真实性与现实语言任务的特征不够一致，考生的书面语言能力与语言运用能力还存在脱节现象。这对我们的教学和考试命题有着深刻的启示。　　因此，我们应抓好计算机辅助大学英语期末学业考试的题库修改完善工作，扩大命题覆盖范围，明确列出所要考核的技能，注重考试的真实性，加强考试的构念效度，提高考试的信度，使考试进一步发挥它的正面反拨效应，规避其负面反拨效应。　　同时，我们要加强学生语言运用能力的培养，不仅提高他们的卷面分数，还要提高他们在真实语言使用场景的英语使用能力。只有这样，才能适应社会发展的需要，才能为社会培养出合格适用的人才。"}
