{"title": "浅析CDIO理念在《计算机应用基础》课程教学中的应用", "url": "https://www.lunwendata.com/thesis/2019/156275.html", "time": ["2019-02-21"], "info": "　　中图分类号： G424 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;文献标识码： A &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;文章编号： 1673-1069（2017）01-113-2　　0 &nbsp;引言　　CDIO教育理念强调的是一体化与参与性，让学生既能学到相互支持的学科知识，与此同时还能够培养学生的全面素质与综合能力，是符合教育体制改革要求的新型教育模式。职业院校开设的《计算机应用基础》课程涉及到的内容较多，在教育体制改革的要求下虽然也进行了一系列的转变，但从整体上来看成效并不乐观，需要积极引入CDIO教学理念，实现预期的教学目标。本文首先简要介绍了CDIO教学模式，之后就CDIO教学理念在《计算机应用基础》课程中的具体应用进行了探讨，以供参考和借鉴。　　1 &nbsp;CDIO教育模式的简要介绍　　1.1 CDIO的基本内涵　　CDIO教学理念融合了构思、设计、实现与运作4个关键要素，是以产品研发到产品运行的生命周期为载体，以主动的、实践的、课程之间有机联系的方式来强化学生的学习。CDIO教育理念具有体现关联性、强调实践性、以项目为依托、强调主动性、注重整体性、评价多样化的特点。　　1.2 CDIO教学理念的核心内容　　CDIO主要有一个愿景、一个大纲、十二条标准三个核心内容，其中“一个愿景”指的是为学生提供一种建立在构思-设计-实现-运行过程的背景环境基础上的工程教育;“一个大纲”涵盖四个层级的内容，第一层级直接反映了教学总目标，具体来说包括四个要求：①学生应具备全面的个人与职业能力与素养，实践能力是其核心内容;②学生必须掌握必要的技术知识和创新能力，能够开发具有附加价值的产品或工程系统;③培养学生良好的团队协作能力及人际沟通能力，以便在现代团队环境中更好地开展工作;④模拟真实的社会与企业环境，培养学生实际的工作构思、设计、实现及运作，达到创建并运行产品、过程及系统的目标;“十二条标准”包括背景环境标准、学习效果标准、一体化教学计划标准、工程导论标准、设计实践的经验标准、综合性学习经验标准、教师CDIO技能标准、学习考核标准及专业评估标准等内容[1]。　　2 &nbsp;《计算机应用基础》课程教学中应用CDIO教育理念的具体实施　　2.1 教学活动组织模式　　设计和组织教学活动时应遵循“做中学”的指导理念，学生是基于项目进行学习的，在具体完成项目的过程中实现掌握专业知识、锻炼专业操作与应用能力的目标。因此，要着眼于学生设计，实现经验的获取来设计相应的教学策略和活动，在此过程中必须包括初级与高级两方面的多种设计-实现经验，提高不同水平的学生参与教学过程的主动性与积极性。CDIO教学理念应用于《计算机应用基础》课程教学中是以学生为主体、以项目为导向、以任务为驱动，将学习的具体知识融入到需要完成的项目中，并最终将学到的知识应用于实际问题的解决的教学模式。在此基础上科学合理地设计课程教学活动组织模式，其主要包括以下两部分内容。　　2.1.1 &nbsp;学习活动组织模式的架构　　建议结合《计算机应用基础》课程内容的特点和教学目标，将课程内容模块化并实施分单元教学，其各知识单元的教学流程见图1。另外，课外学习时学生在教师的指导下可以采取个人或小组形式，对单元内容进行课前预习、资料查询等，将自主学习过程中存在的盲点标记出来，再通过咨询老师得到解答，加深对知识的理解和掌握。在实际实施过程中，教师要为下一学习模块制定提纲、布置内容、提供资料，并且提出一些关键问题，提高学生学习的针对性，通过自主查询相关资料与知识解决老师提出的问题，增强自主学习能力及解决问题能力;学生在知识讲解环节要先用自己的方式总结汇报学习成果;之后由教师讲解学生自主学习时存在的盲点及有误解的地方;一级项目环节是基础性实训项目，属于个人作业的完整项目，需要完成教材上的实训内容及相关作业， 知识前后具有较强的关联性，通过体验知识的关联性并独立完成来达到掌握具体的知识目标;二级项目采取小组合作形式，项目的主要内容与学生的生活、学习或专业相关，以此来进一步引导学生运用所学知识解决实际生活中的各种问题，增强学生的实践应用与解决问题的能力;汇报环节主要是学生或小组对学习进展和成果进行总结汇报，通过组织语言和学习内容，达到锻炼学生交流能力的目的。在此过程中，教师要针对学生的汇报总结其中存在的问题，以便及时掌握学生掌握知识的程度和实际的运用情况，反馈教学，为制定下一步教学计划提供依据[2]。　　2.1.2 &nbsp;课时分配的架构　　该部分依据以学生为中心的理念，结合《计算机应用基础》的课程内容安排三个教学周为一个学习任务周期，整个学习过程要以学生为主，注重学生的参与，缩短教师的讲授时间，增加学生的实践教学课时，针对模块化内容的学习，首先要求学生汇报课外学习情况，教师在此基础上进行有选择的内容讲授和答疑，通过此教学模式和课时分配来督促所有学生，提高教学效率。同时以严格的要求来确保学生在学习过程中都有所收获[3]。　　&lt;E：＼123＼中小企业管理与科技?上旬刊201701＼1-197＼43-1.jpg&gt;　　图1 &nbsp;各知识单元具体的实施环节　　2.2 教学评价方式　　CDIO教学理念的核心思想是能力本位，重点培养学生的基本素质和综合能力，为了客观衡量其能力，必须采取科学的评价方法。建议采用不同的评价方式配合相应的学习成果的考核。例如， 采用口试或笔试的形式考核学科知识学习效果;采用问卷和访谈的形式考查学生的学习态度、兴趣、意向等;采用观察记录的方式来考核设计-实现相关的能力。因此，建议考核《计算机应用基础》课程时采取过程性评价和总结性评价相结合、“全过程考核，全方位评价”的方式。这主要包括两方面的内容：一是评价主体多元化，通过教师评价、小组互评、学生自评相结合的方式来评价小组项目。作为教学活动的组织者、指导者，教师的评价有助于提高学生的自信心，对学生的学习情况有一个客观、全面的掌握;小组互评能够促进学生间的交流互动;学生自评能够实现学生的自我反思和总结，以加深对学习知识的理解和掌握。二是评价内容多样化，为了全面考核学生获取知识和能力提高的情况，应从多维度、全方位角度入手，包括知识获得以及实践技能、交流能力及情感态度的变化[4]。　　3 &nbsp;结束语　　综上所述，《计算机应用基础》课程作为培养计算机专业人才的基础性课程，在新的教育体制要求下，必须与时俱进，积极引入CDIO教学理念，注重学生计算机专业实践应用能力、创新能力等多方面的发展，以高效的教学模式促进教学目标的实现，为计算机行业的发展培养更多优质的人才。"}
