{"title": "如何融信息安全教育于计算机基础教学中", "url": "https://www.lunwendata.com/thesis/2019/155827.html", "time": ["2019-02-17"], "info": " 　　摘要：随着信息技术的不断发展与普及，计算机网络的应用也越来越广泛，但网络是一把双刃剑，它在为人们带来极大的生活便利的同时，也存在一定的安全隐患，给人们造成了巨大的损失。信息安全已经成为非常迫切的问题，因此在学习计算机课程中，了解信息安全知识，掌握信息安全技术非常必要。本文就针对计算机基础教学过程中的信息安全教育展开讨论。　　关键词：信息安全；计算机教学　　中图分类号：TP3-4 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-02　　一、计算机教学中信息安全教育的重要性　　随着计算机技术的不断发展，互联网技术明显地改变了人们的生活方式与学习方式。一方面，互联网是一个大的信息库，为人们提供诸多信息便利，但另一方面，互联网络中的信息良莠不齐，也充斥着很多不安全因素，如：个人信息的泄露、黑客的攻击及计算机病毒等。基于这个角度，对于非机算机专业的学生而言，随着计算机网络的发展及普及，网络安全知识普及甚至比word、excel等办公软件的应用更重要，可是很多在校学生甚至还缺乏起码的安全认识。因此在计算机基础教学过程中融入信息安全知识非常必要，通过这些知识的学习与掌握，可以提高学生们自我保护的能力以及计算机技术的应用能力。　　二、信息安全教学的主要内容　　具体而言，计算机信息安全的教学内容包括以下几个方面：第一，信息安全的基础知识与安全技术，而实用技术则是指上述基础知识的实际应用，比如账户安全、系统还原、安全中心、PGP加密、恶意软件的防范、常见网络诈骗的防范等等；对于非计算机专业来说，基本知识部分只需讲清楚基本概念及工作原理即可，不要涉及太深入的专业知识。这一部分是信息安全教育的重要内容，它主要培养学生识别信息安全威胁、规避信息安全风险的能力，以及提高学生基本的信息安全防护能力。第二，法律层面，互联网络同样要遵循相应的法律法规。在教学过程中老师适当的对相关法律、法规进行介绍，可以增强学生的法律意识，加强其网络行为的自律性，并学会利用法律武器维护自身的权益。第三，网络伦理道德教育，强制性的法律条文以及相关的技术手段都带有一定的局限性与滞后性，所以要加强网络伦理道德教育，从道德层面加以约束。当然，现行的中职教材中上述内容介绍的很少，而这些确实是学生在今后的生活及工作中不可缺失的计算机基础知识，因此老师要结合教学实际以及学生的实际需要进行适当的增补。　　三、常用的计算机安全软件　　目前为止，常用的计算机安全软件有以下几种：第一，金山密保，这是一款启动很快的防护软件，安装后可以自动添加，在启动过程中不显示扫描程序，无延迟，支持手动与拖动添加功能；软件中包括安全桌面功能、木马速杀功能等，能够将常见木马及时清除；可以设置查杀时间频率，有隔离区功能。第二，江民密保，这是一款收费软件，提供网游、聊天、网银以及股票证券四个类别的保护；支持手动添加、自动识别；具有密码保存以及密码安全输入功能；自定义规则，指定监控或者扫描的模块；支持黑白名单，不过该软件需要收费。第三，360保险箱，该软件有较好的易用性，支持较多的保护工具，提供向导添加模式以及安装桌面选项，保护对象的修改或者添加比较方便；可以通过正在保护、保护历史功能查看软件的保护效果；提供云查杀引擎，对安全级别进行调整；包括硬盘还原保护器还原软件；如果提交的游戏无法识别，会默认添加360手机支付；第四，巨盾，一款多功能的防盗号软件，其功能包括五大项，即体检、查杀、密保、监控以及安全桌面等；默认密码保护功有几款网页游戏，可以手动添加；对保护对象设定单独保护策略，不支持自动添加；具备密保卡功能，选项中还包括文件粉碎、进程管理、文件修复以及一键清理等功能。第五，超级巡警保险箱，一款绿色软件，自动搜索功能将需要保护的软件添加进去，支持拖动添加，简洁的软件界面，对防护级别、交互模式可以设定，支持黑、白名单。　　四、计算机教学中融入信息安全教育的措施　　（一）制定科学、合理的教学目标　　教学目标是指预先设定好的、在实际教学活动中要求达到的标准，可以说选择教学行为与教学内容均要以教学目标为中心。可以参照布卢姆的教育目标分类法，将教学目标分为认知、实践以及情感三个领域。计算机信息安全教育活动中，老师可以按照实际的课程特点以及非计算机专业中职学生的认知水平、知识结构来设计教学目标，在相关课程中融合信息安全教育。学生通过信息安全课程的学习，可以在认知领域了解、理解、掌握更多的信息安全方面的知识；而在实践方面，则可以熟练的应用一些安全防范措施或者保护工具等；在情感领域则树立起较强的信息安全意识，遵守信息技术的使用道德规范，培养良好的信息安全习惯，对信息技术的应用形成正确的价值观。　　（二）将信息安全教育融入教学内容　　完成教学目标的主要载体即是课堂教学内容，老师正是根据课堂教学内容完成教学活动。对于信息安全来说，其包括两个层面，即技术知识以及道德法规。上文中也提到，信息安全技术涉及到非常广泛的知识面，而要求学生掌握所有的知识也是不现实的，因此老师在实际的教学过程中，可以与所讲授的计算机课程内容相结合，将信息安全知识、信息安全防范以及相关的法律法规等有机的融入其中。比如在讲解操作系统的相关内容时，可以介绍系统漏洞、计算机病毒等基础知识，然后介绍如何下载、安装补丁程序，如何使用防毒软件与杀毒软件；在学习数据库时则将数据的备份与加密等知识点穿插在内；可以在网络课程中插入安全口令的设置方法、如何防止垃圾邮件、防火墙的基础知识与安装应用方法等，利用这些安全防范措施提高自我保护的意识。此外，对于非计算机专业的中职学生来说，还要注意对信息安全知识的优化处理，具体而言包括以下几点：　　第一，要注意与计算机课程的衔接性，保证二者联系紧密，实现信息安全知识与计算机教学的无缝对接，提高教学内容的完整性；第二，教学内容的时效性与实效性，计算机技术的发展日新月益，相应计算机技术的学习也要与时俱进，而教材是几年才换一次，因此老师要选择与现实生活息息相关的、最新类型安全事件，结合实用性强的信息安全知识开展教学活动。比如介绍最新公布的病毒特征，讲解这些病毒的防范措施及查杀方法等，使学生可以感受到信息安全知识的实用性与可操作性；第三，要综合考虑学生的认知水平、知识结构以及接受能力等因素，对学生已掌握的计算机知识、实际的接受能力有全面的了解，再以此为基础选择教学内容，从而激发出学生的学习兴趣、学习热情；第四，计算机信息安全课程有较强的实践性，因此要充分利用学校现有资源，比如教学设备以及机房实验设备等，加强学生的实践操作。   　　（三）选择合理的教学方法　　从某种意义上来讲，教学方法对教学效果会产生直接的影响，选择合理、适用的教学方法才可以更好的完成教学任务，提升教学质量，最终实现教学目标。将信息安全教育内容融入到计算机教学中去，可以利用引导式的教学手段，在课堂上创设信息安全相关知识的问题情境，拓展学生的思路，引导其积极探索，深入研究。例如在讲解文字处理软件时，讲解文件的保存方法，就可以创设如下问题情境：假如所保存的文件带有一定的机密性，那么如何才能保证只有作者本人、相关授权用户才能打开文件呢？学生立刻觉得这是一个非常实用的知识点，所以表现出很大的兴趣，此时再引入利用密码保护的方法，学生很容易就能接受，甚至会举一反三，提出“如何为文件夹加密”的问题。还可以采用任务驱动法，将信息安全的相关知识以任务的形式向学生提出来，让学生在解决任务的过程中掌握知识。需要注意的是，老师在讲解信息安全知识时要与课程计划相结合，主要的目标重心仍是顺利完成教学计划，不可主次不分；在课时安排方面，则要根据教学需要灵活掌握，以原教学内容课时为基础，将信息安全教育的内容穿插其中。也可以分层次教学，或开设选修课程，对于有兴趣或有知识需求的学生进行知识的拓展。　　（四）法律道德教育　　在计算机信息安全教育课程中，相关的信息安全法律法规、网络伦理道德教育等往往都是被忽略的内容，很多人都存在信息安全单纯属于技术层面的错误认识。其实这种认识带有强烈的片面性，信息安全最大的威胁因素就是人的行为，人们缺乏对信息安全法律法规的认识，网络道德行为存在严重缺失。现在我国已经制订了信息安全相关的法律、法规，在要信息安全课程中融入这些知识，引导学生了解信息犯罪需要承担的责任，做到自觉守法。此外，信息安全课程中还要融入法律的道德教育，构建一道有效的法律道德屏障。　　总之，信息安全是一门综合性很强的交叉学科，目前处于迅速发展阶段，但它又是实用性很强的知识，计算机基础教学中的信息安全内容的与时俱进、融会贯通值得广大教育工作者探索、研究。　　参考文献：　　[1]于国华,于佳.计算机类专业信息安全教学研究[J].科技信息,2011,5　　[2]王乐平.融信息安全教育于中职计算机教学中[J].职业教育苗研究,2009,5　　[3]杨建强,李学锋.大学生信息安全教育探讨[J].襄樊学院学报,2012,9　　[4]刘飞.对高校信息安全教育之思考[J].群文天地,2012,3　　[5]王芳,姚飞.我国信息安全管理软件前景探究[J].商场现代化,2009,11 "}
