{"title": "论对计算机网络技术教学的探究", "url": "https://www.lunwendata.com/thesis/2019/155820.html", "time": ["2019-02-17"], "info": " 　　摘要：新世纪的到来，网络技术发展突飞猛进，社会对计算机网络技术人才的需求大大增加，或者说社会各行各业对于现代化人才的要求越来越高，计算机网络技术已经是现代化的新型人才不得不具备的一项技能，迎合社会的发展潮流，计算机专业不仅成为大热专业，更是发展为高校的一门基础课程，无论是什么专业都要求具备计算机网络的基础知识和操作技能，因此如何改善和提高计算机专业的教学水平和质量就成为了非常现实和重要的讨论话题，笔者在下文就自己的经验提出一些浅显的看法和建议，以供大家讨论研究。　　关键词：计算机；网络技术；教学　　中图分类号：TP393-4 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-02　　一、引言　　计算机网络技术是上个世纪最伟大的科技成就之一，现如今几乎所有的人都在谈论计算机网络，都在使用计算机网络，都在依赖计算机网络，不知不觉计算机网络已经成为现代人生活中不可缺少的一个部分，更有人打趣地说千禧年后的孩子都是躺在计算机网络上成长起来的，这句话也并不缺少它的现实意义，不可否认，进入21世纪后，计算机网络已经达到“旧时王谢堂前燕，飞入寻常百姓家”的这种普及程度了。Internet几乎成了信息革命和信息技术发展的代名词，办公生产自动化、家庭自动化、现代化管理、科技研究等等，没有一个可以离得开网络；信息的检索、获取和交流等也因为网络有了日新月异的变化；甚至银行的电子转账、国际贸易等电子商务这样的经济生活也和网络息息相关。由此可知，对于接受高等教育的大学生来说，具备一定的计算机网络知识和技能，尤其是对于计算机网络技术专业的学生来说，扎实的计算机网络技术基础知识和熟练的计算机网络操作技巧和能力都是非常必要而且重要的。　　二、计算机网络技术教学现状　　《计算机网络技术》是高校计算机应用专业的核心课程中的基础课程，该专业旨在培养学生掌握计算机网络基本理论和基本技能，具有计算机网络硬件组网与调试，网络系统安装与维护，以及网络编程能力的高级技术应用型专门人才。但是当今计算机网络技术在高校的教学开展收到了多方面因素的影响和制约，使其无法按预期实现培养合格人才的目标。笔者对该情况进行分析探讨，总结出以下几点因素。　　第一，高校的发展速度过快，因此在发展过程中出现了很多制约教学的问题，最明显的表现就是对于生源的选择和吸纳，三本学生的类型主要有两种，一种是普通的高中毕业生，另一种则是对口入学的中专生。这些学生中并不是所有的学生对计算机网络都有足够的认识和了解，他们中的一部分甚至是连电脑都没有接触过的。这样便导致了以下一些问题，已经拥有这些技能的学生，重复的学习等于浪费时间，并且会出现厌烦的心理；没有学过的学生甚至是完全不了解的学生对它的学习本来就望而生怯，加上课程设置不合理，课时安排不充分等原因导致所学知识不牢固。三本院校的学生入学门槛相对比较低，这就决定了他们的综合能力比较低，基础薄弱，知识面不广，容易产生畏学情绪，对于理论性的知识缺乏兴趣，对于抽象复杂的知识难以理解等。对于环环相扣的教学安排，只要基础课程学不好学不会学不扎实，后继的课程就没有办法继续下去；加上社会对三本院校的误解、偏见和不重视，也使得了学生对于学习的积极性不高。如此种种，就使得本课程的教学在开始的时候就举步维艰。　　第二，传统的教学模式中，老师历来都是担任知识传授者的角色，尽可能地把知识点完整全面地传输给学生，对于书本上繁杂的理论，学生不知道学为何用，即便是因为教学改革的影响而引进了声音、影像、图表等多种教学媒介，但是以老师作为教学中心的教学仍旧没有改变，即便教学的内容稍微丰富了，但是依然表现为老师借助这些教学工具增强了理论知识的表现能力，却依然是一个人独唱整台戏，学生被动的接受知识，没有实际地参与到课堂，最后教学的收效仍是不佳，这不免也让许多老师觉得迷惑。也正是由于老师在课堂上大篇幅地述说理论，而忽视了这门课程也具有实践性这一特点，扎实的基础知识也是服务于实践技能的学习和操作，大部分学校由于资金分配不合理，缺乏一定数量的计算机教室，或者是计算机教室的器材老旧损坏等原因，不能够被充分利用，这些原因导致计算机上机操作课程的排课非常紧张，课时安排的不合理致使学生失去了实践操作的机会，也自然谈不上实践能力的培养和提高。　　三、计算机网络技术教学改革　　（一）转变教学观念，让学生参与教学　　转变教学观念是提高教学质量的第一步，作为教师，必须要改变传统“以教师为中心”的观念，明确学生的教学主体地位，把课堂适度地交给学生。作为教师要知道三本院校旨在培养实践能力强、就业技能高、社会适应能力好的学生，因此不要再沉溺于一味地传授理论知识而忽视对学生实践操作能力的培养，对于教材的理论知识应该是少讲精讲，注重感性认识和理性认识的过渡。教师要对自己所教的学生有一个全面充分的认识，不应该想当然地认为他们有足够的理解能力，要注意学生新旧知识的衔接，对于那些没有基础或者基础薄弱的学生要加强知识结构的修补和学习兴趣的培养，讲课的方式方法也应该根据学生的不同而有所改变，尽量针对这一类学生的特点，采用趣味丰富、直观性强的方式，可以让学生更好的理解和学习枯燥抽象的知识。　　（二）完善实训室的建设，加强实践教学　　计算机网络技术作为一门理论与实践能力要求都很高的课程，如果学校缺乏网络技术实训室，无疑对这一课程的教学是很受影响的。所以，要提高高校计算机网络技术教学的水平和保证其质量，完善该校实训室的建设，积极推进实践教学是非常关键的。　　首先，学校应该合理安排教育资金的分配，修建足以满足使用需求的计算机教室，对于老旧损坏的不能为之利用的计算机要及时的维护和维修，应该设有专人负责计算机日常的、定期的管理和维护工作，还要设立专门的实验实训室，准备好必要的工具、设备和零件，为学生进行组合、安装、连接和测试提供真实的操作环境，通过具体的实践操作和应用，能让学生加深对于计算机网络技术的一些基本概念的认识，掌握其工作原理，并提高他们的实际动手能力，为以后的工作需要奠定基础。此外，还要加强对于硬件设备的软件的更新换代，网络技术的发展可谓日新月异，要想让学生掌握最新的技术适应职业发展的需要，就要加强仿真操作软件的建设，定期对其进行更新升级，通过仿真实验，可以让学生更直观地掌握计算机网络的具体结构和工作原理，在实践中检验理论知识的正确性和可操作性。同时虚拟实验室的建设也是不可或缺的，它的高效率、低成本、安全操作等优点有助于该课程实践实训教学的开展。   　　（三）改革教学方法，提高学生学习兴趣　　教学方法的改革要先关注教材的使用，以往教学过程中，教学方法单调死板，总是通过黑板和教材两点之间传球，这使得计算机网络技术的教学枯燥无味，学生也就自然丧失了学习的兴趣。在新的教学中，老师的课堂教学应该是立足于课本，又不局限与课本的，由于时间和篇幅的限制，教材的编写本来就具有一定的局限性和滞后性，过分依赖于课本，只能导致学生的知识面越来越狭隘，对于学科的学习和认识越来越片面，所以，在教学互动实践中，教师应该以教材作为基本点，作为跳板，引导学生了解和思考计算机网络技术的发展和动态，并且培养学生利用理论指导实践的能力，也就是教材理论以应用为主，理论教学又以够用为主，因而注重课堂应用理论的教学。以实际的工程作为例子，工程师如何考虑并选用拓扑结构来组建计算机网络？又应该如何去设置各种协议？工程师是怎样计算网络的通信流量的？引导学生以工程师的视角去看待和思考问题，便能有效地架构起学习与实践之间的桥梁，使得学生能够学会转换两者之间的角色，并运用所学知识来分析和处理问题。　　课堂的教学不是一成不变的，俗话常说：“教必有法，教无定法”，所以老师应该根据不同的教学内容，找到不同的切入口，使用不同的教学方法，达到理想的教学目标。如常见的案例教学法，案例教学能把抽象系统的理论知识结合工作实际进行分解和细化，便于学生通过案例对所学知识做出一个反应，基本上遵循“描述问题―罗列知识―解决问题―实践验证”这样的一个顺序，如引用“校园网的组建”这个学生们比较熟悉的案例来讲解VLAN（虚拟局域网)这个知识点，如此一来能让学生完成理论知识和实际应用的有效转移。再有就是参与式教学法，新的改革要求学生要学会自主学习，只有学生发自内心的要学爱学，才能真正学到知识，在教学的过程中，鼓励学生接触新的网络产品、软件等，发起自主的研究，这样可以提高学生的自主学习能力和解决实际问题的能力。另外，教学中还要培养学生的合作意识，例如开展小组讨论或者是任务教学，小组讨论可以让每个学生都能在课堂上发表自己的意见，并且在交流中增长自己的见识，看到自己的不足，任务教学可以把具体的任务落实到每个小组，再由每个小组落实到具体组员当中去，这样的方法能够最大程度地使学生参与到课堂的教学中来，激发学生学习的兴趣，提高教学实效性。　　四、结束语　　计算机网络技术的发展迅雷不及掩耳，这就说明了如果学校想培养出适应时代发展、社会需要的现代化人才，就必须对高校的计算机网络技术的教学进行改革、创新。高校的老师必须立足于本校本班学生的实际情况，认真思考制约该课程教学的因素，积极探索解决的方法和途径，从转变教学观念、改革教学方法、重视实践教学的作用等方面获得领悟，不断发展不断进步，方能提高计算机网络技术的教学，帮助学生掌握将来就业的一门重要技术。　　参考文献：　　[1]黄跃东.计算机网络使用技术教学方法的研究,计算机光盘软件与应用,2011,20　　[2]张庆.浅析高职院校计算机网络技术教学的改,计算机光盘软件与应用,2011,11　　[3]饶云波，张应辉，周明天，曾庆华.高职院校计算机网络技术教学探讨,福建电脑,2006,2 "}
