{"title": "浅谈计算机教学中如何教会学生防范计算机病毒", "url": "https://www.lunwendata.com/thesis/2019/155792.html", "time": ["2019-02-16"], "info": "　　[中图分类号]G623.58 [文献标识码]A [文章编号]1005-3115（2016）24-0071-02　　当今时代， 社会信息化程度越来越高，各行各业的信息化进程不断加速，计算机网络信息技术对人类经济、社会及生活等各方面产生了巨大的影响。计算机网络已经与人们日常的工作、学习和生活息息相关，成为人们日常生活的一部分。所以对计算机使用者来说，熟悉并掌握一些计算机病毒的防范知识显得尤为必要。在计算机课堂教学中，要加强学生对计算机病毒的认识了解，让学生掌握?算机病毒的产生、特征、危害、防范以及清除等常识，教会学生安全使用计算机。作为教师，要在计算机课程教学中加强学生对计算机病毒常识的了解，提高学生对计算机病毒的防范意识。　　一、为了让学生学会防范计算机病毒，首先要让学生了解病毒相关知识　　（一）让学生明确计算机病毒的概念　　计算机病毒是指由计算机网络蓄意破坏者独立编制的，或者在计算机程序中有意插入的，破坏计算机功能或者毁坏计算机存储的数据，影响计算机正常使用，并能自我复制的一组计算机指令或者程序代码。它对计算机软硬件造成不可估量的危害和损失。在实际教学过程中，教师首先要让学生掌握计算机病毒的概念。　　（二）教会学生识别计算机“中毒”的迹象　　在使用计算机过程中，如果出现无缘无故突然死机没有任何响应，系统无法正常启动，计算机中的文件怎么也打不开，计算机中存储的数据无故丢失，计算机突然黑屏，键盘和鼠标无故锁死不起作用，系统自己突然自动执行操作，自动打开多个网站链接，自动反复弹出不需要浏览的不雅广告网页，无故出现异常的错误信息，计算机系统运行速度突然大幅度减慢，程序载入时间没完没了、拖得很长，硬盘的指示灯无缘无故地闪亮，计算机经常反复报告内存不足、磁盘可利用空间突然一下子减少很多，可执行程序的大小突然自动改变，自动出现来路不明的文件，计算机原来已保存好的文件内容不知不觉被修改得面目全非，如原文件名称、扩展名、日期、属性等被更改等一系列不正常的情形，就意味着计算机可能被病毒侵害，出现安全问题了，必须立即着手杀毒，清除毒害，以免造成更大的不可挽回的损失。　　（三）教会学生正确判断非计算机病毒　　计算机病毒的危害性是很大，但我们不能“谈毒色变”，当计算机使用感觉有问题时，不假思索就认为是病毒导致的，大张旗鼓地给计算机杀毒，这样就未免有些矫枉过正。要教会学生，当计算机使用出现异常时，不能慌张，要先冷静地对异常情况进行分析判断，寻找出现异常的原因，进而采取相应的措施。有些时候出现异常情况并不都是病毒所致，而是磁盘碎片堆积太多的原因。如果计算机磁盘长期不进行维护清理，不及时对磁盘碎片进行整理，聚集过多不必要的垃圾文件，也会导致系统运行速度缓慢，系统的各种性能下降，操作不灵活，这时候就要查看C盘的属性，检查磁盘有没有问题，对C盘进行清理，删除没用的临时文件，使硬盘空间得到释放，同时清空回收站，计算机异常情况就会消失。　　二、让学生明白为了防患于未然，使用计算机要先下载安装电脑安全软件　　（一）让学生了解计算机病毒的危害性　　计算机病毒是那些不怀好意的黑客们人为制造的、可以自我复制、能对计算机的信息资源和正常运行造成毁灭性危害的一种恶意程序。如果使用计算机时麻痹大意，没有安全防范意识和措施，用户在使用计算机过程中很容易通过可移动的磁盘，比如光盘、U盘、软盘等，或通过网络媒介的传播作用，致使计算机信息被病毒侵害，病毒肆意破坏计算机中的程序和数据，造成计算机用户的工作成果、重要数据资料等毁于一旦，有可能会使计算机系统崩溃。甚至当前木马病毒的流行，使得很多计算机用户的网上银行账号、QQ账号、股票帐号、网络游戏账号以及个人需要保密的信息等不知不觉中被盗，造成无法挽回的经济损失，甚至危及人身安全。所以，在使用计算机时，很有必要安装杀毒软件来防微杜渐，防患于未然。　　（二） 教会学生下载安装使用电脑安全软件　　在日常教学中，教师要教会学生掌握计算机安全软件的相关知识。以现在常用的计算机安全软件360安全卫士为例。首先要提醒学生，在官方网址下载360安全卫士安装包。下载下来按照软件安装的智能提示，完成软件的安装。计算机安全软件会对计算机系统进行一次彻底的扫描，并报告计算机目前的安全状况，让计算机使用者对计算机的安全状况心中有数。　　三、教会学生安装使用正规有效的杀毒软件并及时更新　　（一）让学生学会计算机杀毒软件的正确选择　　计算机杀毒软件种类繁多，层出不穷，杀毒软件的更新换代更是日新月异，比如目前大家都在使用的金山毒霸（悟空）、腾讯电脑管家、卡巴斯基、360杀毒软件、瑞星杀毒软件等。这就要求每一个计算机用户必须根据自己的需要慎重辨别和选择，切记一定要选择正规的官方正式版本去下载安装，要考虑所选杀毒软件在查杀病毒种类、查杀病毒速度、未知病毒防范等方面的功能。同时，所使用的软件要具有病毒防火墙实时监控、压缩文件病毒查杀、查杀电子邮件病毒等各种全方位功效，拥有云查杀木马病毒、系统运行加速、漏洞补丁修复、实时防护、网速保护、电脑诊所体检、强力卸载等功能。　　（二）教会学生使用杀毒软件进行杀毒并及时更新　　计算机安装了杀毒软件以后，不能当作摆设闲置不用，要及时开启杀毒软件提供的实时监控功能，并且要根据当前软件的更新发展情况，定期升级更新杀毒软件，起到真正查杀病毒、防范病毒侵害的作用。同时，要不断地定期更新软件，这样有助于杜绝软件漏洞，因为软件一旦出现漏洞，就会让病毒有机可乘，所以从一点一滴细微处做好病毒预防工作是最重要的。如果一旦计算机被病毒感染，会造成不可估量的损失。   　　（三）教会学生正确应对已经出现的计算机病毒毒害　　使用计算机教学中，要让学生明白，如果发现了已经被计算机病毒侵害感染的文件，必须立即通过安装使用杀毒软件，及时清除病毒，力挽文件恢复正常。但也可能有部分被严重破坏感染的文件或许无法彻底清除病毒，这时不能有不会中毒的侥幸心理，如果抱着等等再看情况的想法，使得病毒在计算机所有程序中迅速蔓延扩散传染，会造成极其严重的后果。所以一旦?l现计算机中毒，切记不得拖延时间，因为计算机病毒有传染性，此时需要果断删除该文件，重新安装应用程序，以免造成更大的损失。　　四、教会学生有效规避各种有害计算机病毒的入侵　　第一，警示学生在上网时，好奇心不要太强烈，不去猎奇浏览不安全的陌生网站，防止不良网页中潜伏的恶意脚本伺机通过所浏览的危险网站去危害和破坏计算机系统功能，如自主修改IE首页，强行自动弹出不雅广告的窗口无法关闭，甚至出现一系列陌生链接，造成计算机使用不方便，甚至使得计算机被病毒干扰无法继续使用。　　第二，让学生谨慎对待自动出现的软件、陌生电子邮件以及具有诱惑性的广告等。不随意下载和运行来历不明的程序，对于邮箱地址不认识的陌生电子邮件附件，也不要随意打开阅读，防止其携带的木马病毒通过电子邮件或捆绑在其他软件中进行破坏，有意对计算机文件删除、拷贝、修改密码等非法操作。　　第三，教会学生及时给计算机安装系统漏洞补丁程序，以便防止病毒进行自我复制，通过系统漏洞或网络进行破坏，恶意占用大量网络宽带资源，造成网络阻塞和网络服务器不可用，甚至造成网络处于瘫痪状态。　　第四， 教会学生定期做好重要数据和文件的备份工作，以防丢失，减少损失。因为计算机病毒具有传染性、破坏性、隐蔽性、潜伏性和不可预见性，而且随着互联网在日常工作、学习和生活中的普及，计算机病毒对人们的日常生活的各个方面的影响越来越大。为了避免计算机系统文件和文件夹丢失或被破坏，必须小心谨慎，随时对重要数据资料进行备份，避免丢失。　　第五，让学生对各种可移动的存储设备，如光盘、U盘、软盘等，插入计算机使用前，最好先用杀毒软件进行检查杀毒，切断传染源，消除隐患。　　第六，提醒学生计算机系统要有防火墙，保证定期杀毒，一旦发现计算机有中毒迹象，应该立即启动杀毒功能清除病灶，将损失降到最低程度。　　总之，在计算机课程教学中，要教会学生通过掌握一定的计算机病毒防范措施，如定期给计算机系统打补丁，给电脑安装正规有效的杀毒软件，不随意浏览不良的陌生网页，对插入电脑的光盘、U盘、软盘等进行杀毒等，就能查杀木马病毒、清理插件、修复漏洞、给电脑体检，可以比较全面地清除、拦截各类计算机病毒，保护计算机信息数据不受病毒侵害。"}
