{"title": "高职计算机应用类人才的专业技能培养探讨", "url": "https://www.lunwendata.com/thesis/2019/156078.html", "time": ["2019-02-19"], "info": "　　中图分类号：G642 文献标识码：A 文章编号：1009-3044（2016）30-0129-02　　Discussion on Cultivating Professional Skills of Computer Application Talents in Higher Vocational Education　　PAN Mei-lian， XIONG Ya-meng　　（Department of Information Engineering， Guangzhou Institute of Technology， Guangdong 510000， China）　　Abstract： Taking the professional group of computer application in our college as an example， we can deepen the cooperation between school and enterprise， build a computer education platform， build a \"dual teacher team\" and other methods to achieve professional computer application talents Skills training purposes.　　Key words： School-enterprise cooperation； professional skill； platform of cloud education　　目前，信息技术计算机应用类行业人才供给呈现出三个缺乏的现状：缺乏高级IT人才；缺乏技能型、应用型信息技术人才；缺乏能从事基础性工作的技术人员。未来国内IT企业将需要大量的通用计算机应用人才。缺乏工作经验和专业技能不对口是应届毕业生找工作时遇到的主要障碍。因此怎样培养计算机应用类人才的专业技能成为了学校的核心目标。　　现结合本校的计算机应用专业群的改革情况与感悟，现对怎样培养计算机应用类人才的专业技能培养做一个初步的探讨。　　1 专业群加强与行业企业联动、大力推进产学研合作教育，要将重心落到计算机应用型人才的专业技能培养方向　　1.1 本专业群的人才培养重心就是专业技能的培养　　本专业群的人才培养方案必须在广泛充分的调研的基础上，分析了我国信息产业发展状况及专业技能型人才需求情况；调研了职业院校信息技术类计算机应用应用人才培养情况，实现职业教育与社会需求紧密对接，实现专业群与职业岗位对接，专业群课程内容与职业标准对接，教学过程与生产过程对接，学历证书与职业资格证书对接，职业教育与终身学习对接，从而确保计算机应用型人才的专业技能为核心培养内容。　　1.2 校企合作、课程设置都是以培养专业技能展开　　大力加强专业群与行业企业联动、大力推进产学研合作教育，深化计算机应用型人才培养模式改革是指加强学生实践能力、创新能力和创业能力的培养，引导课程设置、教学内容和教学方法改革，提高教学质量。把行业的先进技术和企业的先进理念引入到课程当中，让课程教学对接社会发展需求。目前我们计算机应用专业群与苹果公司共建《IOS应用开发》课程，由苹果公司设计课程，完成课程教学，并鼓励学生们积极参与IOS APP应用开发设计，准备创建“创客工作室”；与新开普公司共同开发《android应用开发》课程，与东软公司共建《java Web开发》课程，并由双方合作组建课程教学团队，引入企业的项目实施教学，通过对课程进行有针对性地选择、新编、整合或优化，使行业企业“渗透”到课程建设之中。同时，专业群内实施企业、学校“双主体”共同培养人才，探索多种人才培养模式，坚持岗位能力与职业素质并重，实施工学交替培养，企业参与专业能力人才培养的全过程，提供真实项目资源、教学案例、兼职师资，并且参与专业教学、学生评价和学生就业并承担相应的责任，尽最大努力实现市场效益驱动下的紧密型深层次校企合作。双方共同申报科研课题、共同解决技术难题，共建共用课程资源、教材和实训实习基地等教学资源，全面贯彻重点培养专业能力为导向的人才改革培养模式。　　1.3 本专业群的以本院自创特有的CRP（校园资源计划平台）为依托来培养学生的专业技能　　“CRP”（Campus Resource Planning）即“校园资源计划”，是一个以教学为核心的新型数字化系统，通过识别和规划校园资源，更有成效地实现和完成学校教育教学、招生就业、校企合作、行政后勤保障管理等任务的信息平台。我们学院研发成功的此CRP系统，已内含50多个功能模块。我们计算机应用专业群在教学中以CRP（校园资源计划平台）为依托，教师带领学生组团体参与到本校的信息中心的研发团队中，进行了学院CRP（校园资源计划平台）模块的设计。这些模块的一个个实现，学生们的信心与日俱增，关键是他们的专业能力在一个个模块中得到了质的飞跃。　　2 以赛促学，快速提升了学生的专业能力　　在本专业群内，全面开展竞赛活动，培养学生兴趣，从竞赛作品中选出优秀作品，在教师的帮助下改良作品。同时，让学生来展示他们的作品，并演示关键制作步骤，以及发表优秀作品制作心得。从第四学期开始，选拔校内比赛的优胜者进行集中培训，全力挖掘优秀设计作品去参加广东省选拔赛和国赛，让他们与别的学校进行PK，知道自己的专业能力水平，从而大大提高了同学们专业能力学习的主动性与积极性。   　　3 创建了“计算机应用群云教育平台”，开放、共享立体教学资源库，是提升本专业群学生专业能力的强有力后盾　　云教育平台就是一个教育信息化服务平台，通过“云”理念和“一站式”应用，试图打破教育的信息化边界，让为所有学校、教师和学生拥有一个可用的、平等的多样化平台。我们专业群建的这个平台可以让教育部门、学校、老师、学生、家长及其他，扮演不同的角色进入后，在这个平台上可以融入教学、管理、学习、娱乐、交流等各类应用工具，让“教育真正的实现信息化”。计算机应用专业群以优质教学资源建设为核心，遵循“调研论证-框架设计-资源建设-推广应用-评价反馈-持续更新”的工作方式，以校企联合、团队共建为基本途径，构建“专业群建设+课程建设+行业典型案例+技能训练+社会服务”于一体的共享型教学资源库共享于云教育平台。有了这个“计算机应用群云教育平台”的开放、共享立体教学资源库，是提升专业能力的强有力后盾。　　4 建设“双元师资团队”，从而确保学生专业能力的培养有保障　　专业群教师直接参与企业项目运作和项目开发等活动，及时掌握企业最新技术，既增强项目开发和科研能力，又能把项目开发的思路和理念嵌入到教学过程中，提高教学水平；企业负责选派学生顶岗??习的指导教师，学校聘请企业专业技术骨干、能工巧匠作为兼职教师到校授课。通过“校企互聘、人才共用”机制，企业成为双师素质教师培养的主要场所和专业兼职教师的聘任源地。经过两年的建设，已经打造了一支以中青年教师为骨干、 高层次“双师型”人才为龙头、专业群教师与企业工程师组成的高素质的“双元师资团队”教师队伍。有了这支高素质、高专业能力的师资队伍，提高学生专业能力的培养就有了强有力的保障。　　5 深化校企合作，本专业群正在积极努力地进行探索构建“校企合作、产教融合”平台。　　构建中的校企合作、产教融合平台，是以信息技术为手段，为学校、企业、学生、政府的校企合作平台。学校、企业、政府都要有专人负责跟进平台的即时信息，并即时处理信息，从而可以实现学校、企业、政府三方面达成共识、共同培养企业所需的高职能人才。学校方面可以及时了解企业的人才需求情况，企业的职业岗位技能；企业方面可以通过平台参与学校系院的专业群人才培养方案的制订、参与课程论证与课程建设、参与教学资源库的建设等。平台的建立拓宽学校、企业、学生之间的交流渠道，减少了合作上的交流成本，能使信息得到及时传播。这样的平台应该是信息化技术高速发展的必然产物，有了这样的平台，重组了产教融合作流程，能以信息技术为手段提高了企业、学校和学生三方参与度，可以很好地解决因空间和时间而制约产教融合作发展的瓶颈问题。　　6 结束语　　目前，本校的计算机应用专业群在教学改革的大潮下，深化校企合作、产教融合，以赛促学，搭建“计算机应用群云教育平台”， 建设“双元师资团队”，并以本院自创特有的CRP（校园资源计划平台）为依托，全方位努力，力争使我校培养的计算机应用专业群人才的专业技能达到一个新高度。"}
