{"title": "简议计算机应用技术图像处理课程的教学", "url": "https://www.lunwendata.com/thesis/2019/154525.html", "time": ["2019-02-03"], "info": "　　计算机应用技术图像处理Photoshop课程教学的关键是丰富课堂教学和实践教学，把专业知识和操作实践结合起来，改善学生的厌学情绪，重点培养实际操作能力和设计能力、创新能力、构思能力、综合应用能力，提高学生专业水平。　　1.计算机应用技术图像处理的Photoshop课程教学要求　　计算机Photoshop课程教学主要讲授photoshop各种工具、面板、菜单的使用方法、图层、文本、路径、通道、滤镜的使用技巧，该实验课程以学生掌握photoshop平面设计的基本知识和操作技能为目的，通过学习，使学生全面掌握软件的基本操作原理和操作方法，熟练掌握操作技巧，注重实例教学，使学生把软件的基础知识很好的运用到专业领域的设计中，灵活?\\用于完成各类平面设计的工作。　　2.计算机应用技术图像处理课程教学的现状分析　　2.1 理论与实践相脱节的问题。图像处理具有很强的操作性，是培养学生综合技能和动手能力的核心课程之一。以往的图像处理课程在讲授过程中大多存在理论与实践相分离现象，教师一般强调基础的理论性知识，实践内容较少，从而忽略了学生操作能力的培养。这样的教学方式使得学生无法将理论与实际结合起来，因此也无法完成教学目标。　　2.2 图像处理相关教材比较乏味。大部分的教材内容都很枯燥，只简单罗列了菜单作用、指令功能及具体操作方法，而实际的操作案例不是很多。同时学生的实践较少，操作项目涉及的理论知识点有限，导致学生的动手能力不高，知识点掌握不牢固。这会降低学生的学习兴趣，破坏学生的可塑性，同时限制学生未来的发展空间。　　2.3 学生的学习兴趣问题。大部分教师在授课时都是照本宣科，学生只是机械地接受教师传递的信息。这样的教学方式不但对提高学生学习效率没有效果，反而会降低学生的学习兴趣。仅仅通过这样的方法，学生的思维能力得不到提高，无法培养学生的主动学习意识和创新意识，无法满足市场对综合素质型人才的需求，影响学生就业。　　3.计算机应用技术Photoshop图像处理课程教学的分析　　3.1 加强课程教学的实践性和操作性。Photosho课程无论是对教学还是应用都具有极强的实践性和操作性，换句话说教师的教学也要极其重视实践性和操作性，只有做到对这两项的并行才是教好学生掌握和运用的最基本要求。我国现有的教学模式往往使许多教师更加注重课本上的理论知识而忽略了实践教学，尤其是职业技术教育更应该注重学生实践性和操作性。教师不应该一味地追求理论知识的传授，传授给学生理论不可或缺与此同时不要忽略实践操作，Photosho课程的教学同样如此。　　3.2 不断激发学生的兴趣。兴趣是最好的老师，在Photoshop的第一堂课上，就可以让学生欣赏一些图像及其效果图，使学生对Photoshop这门课有一个整体的了解，同时也能激发学生学习这门课的兴趣；还可以向他们展示历届学生的优秀作品，从图片的整体构思、创意、色彩、整体效果等审美角度给学生进行讲解，在拓宽学生视野的同时也增强了学生的信心，使他们相信自己完成Photoshop的学习后也能处理一些复杂的图像，制作一些迷人的效果。　　3.3 强化Photoshop课程教学方法的合理应用。（1）photoshop案例教学。通过案例激发学生学习本节课的兴趣。教学最好能找到一个既完整又能指示出分课时完成的案例。通过案例的完成来掌握photoshop工具的使用。这样，让学生对本学期、本堂课的学习任务都有明确的方向和目标。当然了，这样的案例就要求教师用心去寻找。我认为教师可以从企业中寻找这样的案例，让学生转变观念，我们在学校学习的技能和企业是相关联的，做到校企结合。（2）任务驱动教学方法。该方法能充分调动学生学习的积极性，有利于培养学生自主学习和相对独立的分析问题、解决问题的能力。但是学生也可能过于重视了结果，忽略过程。因此有时会出现在上节课任务完成非常好的学生，却不记得自己是如何完成的现象。所以一般用于PS中一些基础性操作技能的练习，如PS工具箱中常用工具的使用，对图片、文字进行滤镜效果的处理等等。　　3.4 充分利用教育资源以外的社会教育资源。对于Photosho课程的教学，除了要充分运用教育资源，更要充分利用教育资源以外的社会教育资源。社会教育资源是丰富的，尤其教学一定要广泛利用社会教育资源，如教师向校方提出加强与其它同等院校的信息与技术交流、实施开放性主体活动课程、教师鼓励借阅图书馆的相关该课程的资料等等。多渠道、多元化的发掘社会教育资源。从而达到Photosho课程的高质量教学。　　3.5 科学开展学习性相关活动。学习完一个阶段Photosho的课程知识，就在每一个班级开办一个与该知识有关的活动。例如，开办关于 Photosho知识的竞争大赛，大家可以拿出自己的作品，风格可以分为搞笑型、高雅型、下里巴人型等不同派别，由学生投票选出不同风格、受欢迎的、技术含量高的作品。鼓励学生积极参与，这样做的目的一方面是让学生有更好的互动性，另一方面教师可以通过活动更加容易了解这一阶段每个同学对该课程知识掌握的程度，如接触新知识的快慢、性格特点等，从而因材施教，使每一个学生达到接受知识的最佳状态。　　4. 结束语　　综上所述，计算机Photoshop课程教学需要培养学生独立设计、制作并完成效果图的能力。并且计算机Photoshop课程教学过程中，需要设计合适的教学内容，采用不同的教学方法，并在教学过程中始终关注提高学生学习兴趣，从而提高教学质量。"}
