{"title": "多元智能理论与多媒体计算机辅助教学软件开发", "url": "https://www.lunwendata.com/thesis/2019/156615.html", "time": ["2019-02-25"], "info": "　　中图分类号：TP18 文献标识码：A 文章编号：1009-3044（2013）11-2689-03　　由美国著名心理学家霍华德?加德纳（Howard Gardner）教授提出的多元智能理论，不仅对传统的单元智能理论提出了挑战，而且也正日益广泛地影响着当代的教育理念，不断地渗透到现代教育技术之中。作为计算机技术和教育理论相结合的产物，多媒体计算机辅助教学软件也正受到多元智能理论的冲击和洗礼。如何在多媒体计算机辅助教学软件中运用多元智能理论，使其在实际应用中能有效地培养学生的各种智能，促进学生装的全面发展，已是多媒体计算机辅助教学软件开发过程中不可避免而且必须重视的课题。　　1 多元智能理论的内涵及特征　　1.1 多元智能的内涵　　美国哈佛大学心理学教授霍华德?加德纳针对传统的一元化智能理论不足，在1983年提出了多元智能理论。他认为人类至少有8种智能： 语言符号智能、数理逻辑智能、身体运动智能、音乐节奏智能、人际关系智能、自我认识智能、自然观察智能。加德纳教授对这八种智能作了具体的界定。　　语言符号智能是指人们利用语言思维、表达和欣赏语言深层内涵的能力。如作家、诗人、语言学家、演说家、著名节目主持人等就具有较发达的语言智能。　　数学逻辑智能是指人们进行计算、量化、思考命题和假设，并进行复杂数学运算的能力。如科学家、数学家、物理学家、工程师、电脑设计师等就具有较发达的数学逻辑智能。　　视觉空间智能是指人们利用三维空间的方式进行思维和操作的能力。如飞行员、建筑师、外科医生、雕塑家、摄影家、画家等就具有较发达的视觉空间智能。　　身体运动智能是指人们巧妙地操纵物体和调整身体的技能。如舞蹈家、运动员、外科医生、手工艺术家等就具有较发达的身体运动智能。　　音乐节奏智能是指人们敏锐地感知音调、旋律和音色的能力。如作曲家、演奏家、指挥家、乐师、乐评、乐器制造者等就具有较发达的音乐节奏智能。　　人际关系智能是指人们能够有效地理解别人和与人交往的能力。如政治家、外交家、卓有成效的教师、心理医生、宗教领袖、成功的销售商等就具有较发达的人际关系智能。　　自我认识智能是指人们建构正确自我知觉并善于用这种知识计划和导引自己的人生的能力。如神学家、心理学家、哲学家等就具有较发达的自我认识智能。　　自然观察智能是指人们观察自然界中的各种形态，对物体进行辨认和分类，能够洞察自然或人造系统的能力。如植物学家、生态学家、文物鉴赏家、景观或园林设计师等就具有较发达的自然观察智能。　　1.2 多元智能理论的特征　　1）整体性。多元智能理论认为每个人都具有上述八种智能，而且各种智能之间并非彼此绝对孤立、毫不相干，而是相互作用、以组合的形式发挥作用。只是某些智能的发达程度和智能组合的情况不同而已，且智能经过组合或整合可以在某个方面表现得很突出。这八种智能有机的组合在一起构成了人的智能体系，因而这八种智能是一个有机的整体，对人的智能的发挥都有重要的作用。　　2）差异性。多元智能理论在强调八种智能的整体性的同时，也承认这八种智能的差异性。加德纳认为，尽管每个人都同时拥有相对独立的八种智能，但由于受各种不同环境和教育的影响和制约，它们在每个人身上以不同方式、不同程度的组合使每个人的智能各具特点，存在明显的差异性。　　3）发展性。加德纳认为，每个人的这八种智能不是一成不变的，而是具有极大的可发展性的，每个人都具有将这八种智能发展到极高水平的可能性，都可以通过后天的教育和学习得到开发和逐步加强。而人的多元智能发展水平的高低关键在于开发，而当代的教育的宗旨正是开发学生的多种智能，并帮助学生发现其智能的特点和业余爱好，促进其全面发展。　　4）实践性。加德纳教授修认为智能是在单元或多元文化环境中解决问题并创造一定价值的能力；智能是一整套使人们能够在生活中解决各种问题的能力；智能是人们在发现难题或寻求解决难题的方法时不断积累新知识的能力。从而不难看出，多元智能理论强调了智能是解决实际问题的能力，突出了其实践性。　　5）人文性。多元智能理论认为，智能实质上是在一定的社会文化背景中学习机会和生理特征相互作用的产物。因而，一个人的智能的形成、发展和实现总和其所处的社会文化环境有着密切的联系，一个人的智能也必然会体现出各自的人文特征，具有明显的人文性。　　2 多媒体计算机辅助教学软件的涵义及特点　　2.1 多媒体计算机辅助教学软件的涵义　　多媒体计算机辅助教学软件（multimedia computer assisted instruction software），是指利用多媒体计算机把文字、图形、图像、声音、动画、影像等多种媒体综合起来的教学软件。它突破了传统媒体的“线性限制”，以随机性、灵活性、立体化的方式，把信息知识形象、生动地呈现给学习者。它的知识密度大、表现力强，能很好地激发广学生的学习兴趣。多媒体计算机辅助教学软件作为一种新型的综合教学软件，既是计算机应用领域的一个新的分支，又是教育领域的一个新的发展方向。其特有的优势和特殊的教学效果无疑会对教学思想、教学内容、课程体系、教学方法、教学手段的改革产生积极而深远的影响。　　2.2多媒体计算机辅助教学软件的特点   　　1）集成性。在多媒体计算机辅助教学软件中，可以以结点为基本信息单元，通过链和网格的形式把文本、图像、声音、影视、动画等多种信息媒体集成为一个统一的整体以供学生和教师使用。这样不但可以使软件图文并茂、声形辉映，教学内容生动逼真，具有极丰富的表现力和吸引力，而且也可以利用集成的多种媒体信息来培养学生的多元智能，促进学生的全面发展，从而在多媒体计算机辅助教学软件中较好地体现了多元智能理论的整体特征。　　2）灵活性。多媒体计算机辅助教学软件具有极大的灵活性，它可以根据每个学生的需要做出反应，适应个性差异，照顾个体已有知识水平，从学生实际出发进行教学；它可以自定步调，允许学生自己控制学习进度；它可以根据学生个体当前的知识水平为其提供难易适度的学习内容；它可以根据学生个体学习风格的不同提供不同的学习方式。因而它也可以根据学生各自不同的智能强势和弱势选择最适合自己进行学习的学习模式进行学习，体现了多元智能理论的差异性特征。　　3）动态性。多媒体计算机辅助教学软件具有极大的动态性，它不是一成不变的，而是根据学生的学习情况而动态发展的，它不仅在内容上能动态维护更新以满足学生发展的需要，而且还能动态的展现事物的发展过程，从而使学生不但系统的掌握事物发展规律，而且在学习过程中不断地培养和发展了学生的各种智能，从而较好的体现了多元智能理论的发展特征。　　4）交互性。多媒体计算机辅助教学软件极大地实现了师生和计算机之间的交互作用。它能根据教学过程的各个具体环节的实际变化的需要，把各个知识点及其场景及时地展现在学生面前；而且能够根据情节变化、学生的适应能力和知识掌握情况，反复调用、反复播放、反复操作；同时还可以让学生自己操作，选择自己喜欢的场景和片断进行模拟实践，培养学生的实践能力，因而体现了多元智能理论的实践特征。　　5）时代性。多媒体计算机辅助教学软件是当今时代的计算机信息技术和先进教育理论相结合的产物，就必然会有强烈的时代气息。而且当代教育应该面向现代化、面向世界、面向未来、面向现实社会性，多媒体计算机辅助教学软件也就应该体现时代特征，以社会和时代发展的要求和学生身心发展的基本规律为依据，展现一个社会的时代特色和人文背景，以利于培养学生与社会人文环境相适应的多元智能，从而体现了多元智能理论的人文特征。　　3 多元智能理论对多媒体计算机辅助教学软件开发的启示　　3.1 软件目标多元化　　以多元智能理论为指导的教育活动是以培养学生的多元智能全面、协调发展为宗旨的，与此相适应，多媒体计算机辅助教学软件的目标也应是多元的。应改革传统软件以提高教学质量获取高分为唯一目标的思想，在设计软件时，既要注重语言知识和数学逻辑知识的传授，更应注重视觉空间、人际交往、自我认识、自然观察、身体运动、音乐节奏等智能的培养。既强调软件的学习助手地位、更应认识到软件作为学生成长伙伴的作用。　　3.2软件内容丰富化　　为了能实现多媒体计算机辅助教学软件培养学生多元智能全面发展的目标，就必须改变传统软件内容单一化的不足，丰富软件内容。在传统的软件中，往往以单个知识点为主要内容，从而导致软件内容单调，很难满足学生的求知欲，更别说培养学生的多元智能。软件内容丰富化，不仅要求软件的知识点应丰富多样，而且要求展现知识点的媒体信息必须多样，即有文本描述，又有声音讲解，即有静态画面展示，又有动态影像播放。软件内容多样化还要求软件知识的呈现模式应该多样化，即要线性展示，又能随机点播，即有自主探索，又有协作学习。从而在内容上为培养学生的多元智能提供足够的素材和手段。　　3.3软件开发多员化　　传统的软件开发一般由专业人员进行，然后供给教师和学生使用，即使教师业余自制一些临时软件，往往也仅仅是教材的电子版本。在这种传统的开发模式下，很少考虑到学生自身的因素。而多元智能理论则强调教育以学生为本，注重调动学生积极性使其参与到智能发展的各个环节中，通过学生的亲自参与来培养他们的多元智能。这就提示我们在开发软件的时候，应集中专业人员、教师、学生等各方面的智慧，充分听取各方面的意见，让他们都参与到软件的开发活动中来，做到软件开发的多员化。　　3.4软件应用情景化　　加德纳认为智能在本质上是解决实际问题的能力。而传统的软件在应用时往往被教师生硬地搬到课堂上，仅仅作为电子黑板来使用，缺少一定的铺垫和相应的情景，很难吸引学生的注意力，不能发挥软件应有的作用。多元智能理论提示我们，学生的各种智能是在一定的环境中得以培养和强化的，因而要达到利用多媒体计算机辅助教学软件培养学生多元智能的目的，就必须在应用多媒体计算机辅助教学软件时创造相应的情景，在合适的氛围中应用多媒体计算机辅助教学软件进行教学和学习，并尽量在软件中为学生创造相应的情景。　　3.5软件评价过程化　　传统评价观点只注重对结果的评价而忽视了对过程的评价，以最终结果论英雄。然而，学生的成长却是一个漫长的过程，而对其成长过程中的评价不但能使其反省过去，更重要的是能激励其面对未来。因而，多元智能理论强调评价的过程化，在学生利用软件学习的过程中对其每一步、每一阶段、每一过程都应有相应的评价体系，从而保证对学生的一点一滴的进步进行及时的评价。　　4 结束语　　先进的教育理论必然不断促进教学软件的革新，教学软件的开发也必须以科学的教育理论为指导。为了能使多媒体计算机辅助教学软件适应当代的研究性学习、合作学习、自主学习，能体现以学生为中心，促进学生全面发展的教育理念，就必须在多媒体计算机辅助教学软件中认真贯彻多元智能的教育思想，从而使多媒体计算机辅助教学软件适应当代教育的需要，进而在实践中促进多媒体计算机辅助教学软件不断发展和提高。"}
