{"title": "探讨计算机在计划生育档案管理中的应用", "url": "https://www.lunwendata.com/thesis/2019/155904.html", "time": ["2019-02-18"], "info": "　　《中华人民共和国人口与计划生育法》已于2002年9月1日正式施行，贯彻落实该法是计划生育职能部门头等重要的工作任务。该法的颁布，使计划生育工作真正纳入了法制化管理，对建立新的、更完善的管理机制具有十分重要的现实指导意义。在我们这个人口众多的国度里，计划生育历来是我国的一项基本国策，从中央到地方，各级政府都非常重视计划生育工作。与十年前相比，计划生育工作已从规范化、制度化步入到法制化的轨道，渗透到各项工作的方方面面。如评选先进单位、先进个人、调动工作、外出打工、各项福利，单位用工等等都与计划生育工作有关。本文结合多年的工作实践，针对计生统计工作存在的问题，提出计算机在计划生育档案管理中的应用的一些思考与实践。　　1 问题的提出　　计划生育档案管理工作十分重要，要管理的内容丰富，工作量大。随着改革开放的不断深入，市场更加繁荣，人才流动现象更加普遍、频繁，尤其是在广大农村，由于外出打工者规模的扩大，致使流动人口急剧增加且档案数据变化频繁，这些都大大地增加了农村计划生育工作的管理难度和工作量。在数万人以上的乡镇里，仅靠建立相关登记簿（结婚登记簿、子女出生登记簿、育龄妇女异动登记簿、流动人员登记簿、药具发放登记簿等）和老一套的常规管理方法，要保证管理完全到位几乎是不可能的，所以，改革管理方式和手段，显得十分重要。　　2 计划生育档案管理工作的现状　　目前计划生育档案管理大多是室藏内容庞杂，案卷数量繁多，时间跨度长且由于多年来一直处于封闭式管理之中，计划生育档案管理仅以保管为目的，以案卷不丢失为原则，再加之每个历史时期档案的整理质量要求不同，整理的规格不统一等情况形成了档案基础普遍较差的局面。　　主要问题集中反映在以下几个方面：一是档号不规范，没有目录号，一卷多册现象较多；二是案卷标题不规范，有标题但不能反映主题内容或标题缺少基本要素，甚至没有案卷标题等现象较为普遍；三是部分特殊案卷缺少卷内目录，以至于部分未被案卷标题涵盖的内容永远无法检索而难以利用；四是组卷混乱现象比较多，如有按时间组的，也有按职能部门管辖权限组的，还有按文种组卷的；五是案卷厚薄不一，有的一、二页纸一文一卷，有的五六百页纸一类一卷。六是保管不统一，分散在各部门科室现象较严重。　　3 利用计算机等现代化的手段，改人工管理为计算机管理　　目前在全国范围内，计算机技术在计划生育信息管理方面的应用还不够广泛，现在大多仍在延用传统的纸张作数据传递的媒介，与当今的信息时代显得极不协调。工作人员在抄录数据、统计计算的过程中，难免出错，故很难提高速度和质量。另外传统报送报表过程中的辅助开支（路费或邮寄费、人工费）也较多。基于以上原因，我们可以根据实际情况，编制统一的计划生育档案管理软件，下发到各单位。下级单位（或基层单位），根据统一的格式，填写数据，然后通过网络，将数据传递到上级单位。这样做至少有以下优点：统计速度快。数据上报只需要几秒钟时间；数据准确。排除了在抄录数据过程中由于人为因素而出现的差错；节约成本，不用纸张，不用乘车送报表，不用花费很多的时间去填表、送表，只需点击鼠标，利用现代化计算机网络，十分方便地进行数据传递；不用手工统计计算，大大地减轻了计划生育工作人员的劳动强度。　　要提高档案管理的水平就必须实行标准化、规范化的工作程序与方法， 即要求档案管理的收集、整理、 鉴定、著录、保管等各个环节都要按照统一的程序和科学的方法进行工作。　　一要全面普查案卷，去粗取精。这是实现档案管理标准化、规范化的第一步工作。因为一般的计划生育档案由于多年来未做全面的清查，加之划分保管期限不准，不可避免地存在许多重份或无查考价值的文件，所以首先要剔除这些无用的文件才能避免今后实行计算机管理时出现重复与低效率的情况。二要重新组合案卷，实现案卷规范化。将那些组卷过厚，内容混杂的案卷进行重新组卷。重新组卷的原则是尽可能将那些相互存在某种联系的文件组合在一起。三要统一分类号，保证检索查全率。为了确保检索的完整性，在分类过程中，首先根据《中国档案分类法》进行分类，再因事制宜制定出一些具体细则。四要规范题名，保证检索查准率，因此在著录时要统一规范题名。　　4 加快数据准备，推进计划生育档案现代化管理进程　　一是分清轻重缓急，循序渐进。计划生育档案管理的一个重要目的就是要使档案为计划生育工作所用，而实现计算机管理档案的目的是为了提高计划生育档案的利用率。在推进计算机管理的过程中应先根据各案卷重要程度、价值大小、利用率高低和是否开放的情况对所有档案进行排队，将那些可以开放的核心档案和利用率较高的档案进行优先加工整理。这样就可以加快档案管理计算机化的进程和提高社会利用的效率。二是分级次著录，省时省力。在著录过程中可以将案卷分为三个层次进行著录，即将那些反映问题单一或查考价值不高的档案进行案卷级著录；对那些一卷内几个文件涉及同一个内容且又排在一起的档案进行文件组合级著录；而对那些重要文件或反映问题庞杂的文件则进行文件级著录。 这样处理不仅能揭示档案的主题内容和特征，而且也可以减少著录条目和录入条目，既节约了时间、人力与财力，又提高了效率。三是分门别类，充分利用档案原基础。对于那些案卷基础较好又具备全引目录的案卷在著录时可以直接在全引目录上面分类标引，而对那些特殊形式的档案则可用计算机程序将人名、地址、时间用案卷目录直接录入，然后用计算机统一给出分类号。这样分门别类地充分利用档案目录的原有基础可以减少著录环节，大大地提高著录速度。"}
