{"title": "计算机辅助教学的优势与应注意的问题", "url": "https://www.lunwendata.com/thesis/2019/158158.html", "time": ["2019-03-14"], "info": "　　中图分类号：G642 文献标识码：A 文章编号：1003-9082（2014）07-0239-01　　在教学的过程中应用计算机，可以有效的提高教学效率，减少教学过程中出现的失误，能更好的体现出现代社会中科学技术的的重要意义。运用计算机辅助教学有很多的优势，然而如果过度的使用或者使用不当也会为教学带来诸多不利的影响。　　一、计算机辅助教学优势分析　　1.有助于激发学生兴趣，促进学生个性发展　　在课堂上使用计算机技术，本身就能够更好的吸引学生的注意力，计算机辅助教学可以使用图像、文字、声音、色彩、动画等多种形式的信息，增大课堂信息量，提供更加丰富的内涵，对学生的感官产生多层次、对角度的的刺激。让学生能够进入到一个色彩斑斓、声像逼真的学习空间中，促使学生产生强烈的好奇心，而这种好奇心则会转化为学生进行学习的内在动力。在教学的过程中，恰到好处的运用多媒体，能够创设出生动有趣的情境，通过多种多样的信息来吸引学生的注意力，让学生的学习兴趣与学习情绪都得以提高。引导学生去主动的进行思考、探究，发展出自己的个性。　　2.有助于情境的创设，激活学生学习积极性　　在传统教学模式中，虽然所有学生都坐在教室里，但是却并不代表每一个学生都可以进入到主动学习的状态中。因为即使讲师再优秀，讲解的再生动，也只能够是让少数感性知识较为丰富的学生才能够在头脑中产生相应的画面，主动构建知识体系。运用多媒体进行辅助教学，使得学生必须去进行积极的思考，回答教师所提出的问题，仔细的观察演示，否则就很难进入到下一个环节中。利用计算机辅助教学可以为学生营造出一个不受时空限制、和谐自然的宽松学习情境，让学生产生出良好的学习动机。通过计算机可以为学生提供全方位、立体式接受信息的方便，使得学生获得多重感官上的刺激，最大程度上去进行积极的思考。　　3.可以更好的针对不同的学生进行教学，真正的做到因材施教　　因为多方面的原因，学生的学习差异较大。运用计算机进行辅助教学，可以实现个别化教学，根据不同学生的具体的起点来灵活的处理教学的深度、广度以及进度，让处于不同层次的学生都可以进行积极的思考，都能够有所收获，产生成功的良好体验，促进学生学习自信心的树立。这样不仅仅是能够对学生的非智力因素进行良好的培养，还可以促进学生智力因素的发展，对传统教学中的弊端进行改善，实现因材施教。　　二、计算机辅助教学中应该注意的问题　　虽然运用计算机辅助教学可以有效的提高教学效果，但是也有一些需要进行注意的问题。　　1.注意对教育观念的改变　　在运用计算机进行辅助教学之后，原来的教学模式需要得到改变，而最为主要的就是转变教育观念。在运用计算机之后，教师已经不再是单纯的知识传授者，而是成为了学生“信息内化”过程中的指导者与促进者。运用计算机进行辅助教学不能离开教育理论的指导，同时也能够促进教育理论的进一步发展。只有掌握了各种先进的教育理论，才可以对教育的实践过程进行正确的决策与评价，才可以真正的保证教育改革的真气方向。在教学的过程中，教师只有对自身的教育观念进行改变才不会是将计算机辅助教学转变为另一种形式的“填鸭式”教学。　　2.不能够过于注重形式忽视了内容，不能过于注重信息量　　在使用计算机进行辅助教学时不能够过于对形式进行注重，对画面的绚丽多彩进行刻意的追求。虽然在使用计算机辅助教学时是为了吸引学生的注意力，营造出一个良好的学习氛围，但是却不代表需要刻意的使用绚丽的色彩，例如将文字设置为为各种各样的艺术字，为各种图片加上多种多样的边框等等，以此来获得各种新奇的放映效果。这些只会让学生感觉到眼花缭乱，让学生过分的注意画面，而对于画面的内容以及要表达出的信息视而不见，进而出现喧宾夺主的情况，不能够凸显教学主题，对学生产生了误导。在运用计算机辅助教学的过程中必须要明白形式只是为内容服务的，最为主要的是课件的内容，同时还需要考虑到学生的接受能力，不能够包含过多的信息，否则学生也很难接受。　　3.计算机不能代替教师的作用，否则会失去教学的灵活性　　在教学的过程中，教师不能够过于依赖于计算机，不可以让计算机代替了教师，让学生去被动的跟着计算机进行学习。这样只是将原来的听课变为了看课。虽然在现在的课堂教学中计算机辅助教学有着非常重要的地位，但是却不代表计算机的使用可以完全代替教师的作用。计算机复杂教学是对教师表达能力的延伸，让教师的的作用得到充分的发挥。教学本身就是一门艺术，教师不仅仅是导演，还是演员。在教学的过程中，用教师自身的人格魅力与富有情趣的讲解，通过师生之间的情感相互感染，配合计算机的辅助作用，充分的调动学生参与到学习中才是正确的途径。　　三、结语　　总之，我们需要对在教学中运用计算机手段进行接受，并对其进行正确的认识。积极的进行相关的理论研究，让计算机在教学中发挥出更多的作用。需要注意的是在现代化的教学并不是简单的对计算机手段进行运用，同时还要有相应的教学观念才能够促进教学质量的改进。"}
