{"title": "计算机技术对审计信息化的影响探析", "url": "https://www.lunwendata.com/thesis/2019/154099.html", "time": ["2019-01-29"], "info": "　　一、计算机技术对审计信息化的积极影响　　（一）拓宽了审计视野　　借助计算机技术，审计人员不再受到传统电子账单及相关?务信息的限制，扩大了审计的范围和内容，并且能够深入计算机信息系统的底层数据库中获得并分析处理相关数据，丰富了审计人员的可用信息，这些未被加工的底层数据更能真实、客观地反映被审计单位的财务情况和经营成果，成功避免了假账查真。　　（二）提升了审计效率　　将计算机技术应用在审计中，需要应用多维方式、分析模型算法等技术，而审计人员可以根据自身的审计经验构建审计分析模型，从而多角度、立体地分析审计数据，一旦发现问题，立即落实，实现核查问题和筛选线索的目的，有助于审计人员迅速获得审计证据，提升了审计效率。　　（三）提升了审计的质量和水平　　将计算机技术应用在审计中，不单单是审计方法和审计技术的改变，还要求转变审计思维，计算机审计的核心为系统论，而系统论强调事物之间的关联，即规律。因此将计算机应用在审计中，有助于审计人员在审计过程中把握整体、重点锁定、构建模型、精确延伸，如此便可以在总揽全局的基础上找出被审计单位的薄弱环节，然后顺利延伸和取证，全面提升审计的质量和水平。　　二、计算机技术对审计信息化的消极影响　　（一）对审计人员要求更高　　随着计算机技术在审计中的应用，审计信息化已经不单单是记账、审计、出报告，要求审计人员不仅要具有基本审计能力，还应当具备扎实的计算机基础和操作技术，能够灵活地应用计算机技术开展审计活动。但当前很多审计人员还无法达到上述要求，从而影响了审计质量。　　（二）对审计标准和准则提出了挑战　　纵观当前国外的很多国家针对现场审计标准、审计人员标准、审计报告标准以及职业道德规范等均建立了一套相对完善的标准和准则，因为我国的审计信息化起步较晚，关于审计信息化的制度和法规还有待完善。特别是随着计算机技术的发展，审计内容更加复杂多样，现有的法律法规远远不能满足审计工作的要求。　　（三）审计内容发生改变　　在计算机技术的推动下，审计内容发生了巨大改变，在信息化的会计系统中，几乎涉及会计的所有事项均由计算机根据程序自动处理，而信息系统的特征和存在的风险决定了审计信息化内容包含对信息化系统的处理和对相关控制功能的审查。　　（四）计算机审计系统缺乏操作性　　各级部门使用的财务办公软件还没有全部统一，依然有少数部门应用的是自行开发的软件。近年来，随着计算机的快速发展，各种软件功能也逐渐从核算型朝管理型方向转变，且结构越来越复杂，但是依然有部分系统无标准的数据接口，导致数据结构不开放。因为审计软件缺乏统一，各个部门办公软件无法协调，在一定程度上阻碍了审计信息化工作的开展。再加上很多单位审计信息资料不能较好地连接局域网络，审计信息和数据之间难以互通，增加了远程审计的难度，降低了审计的实际操作性。　　三、审计信息化应对计算机技术消极影响的对策　　（一）提高审计人员的综合素养　　审计信息化发展的核心是高素质的审计人才，其综合素养的高低直接决定了审计的成败和审计质量的高低。就审计人员队伍现状来看，年长者虽然审计经验丰富，但是缺乏必备的计算机知识和操作技能，相反年轻审计人员计算机知识扎实，但是缺乏审计经验。对此，必须注重培养综合型的审计人才，以便其充分将计算机技术和审计工作结合起来。对此，要定期组织审计人员参加培训，而且要结合所在地区的审计现状有针对性地培训，加强对骨干人员的培养，争取以点带面。除此之外，还应该保证培训的系统性和连贯性，增强培训实效。　　（二）建立健全计算机审计相关的法律法规　　一方面，应该建立计算机审计的准则体系，内容应该包含计算机辅助审计和计算机信息系统审计，从而形成计算机审计规范体系；另一方面，明确规定电子数据的法律地位，对计算机审计而言，其对象是电子数据，因此要明确指出电子数据在现行证据体系中占据的地位、是否具有证明力和合法性。　　（三）进一步丰富审计的内容　　在将计算机技术成功地应用于审计中后，审计的内容已经不再局限于控制法规制度和组织机构等，还应该将被审计单位的计算机管理系统的开发、使用、控制等全部纳入审计重点，审计计算机系统的可行性和合法性，做好计算机系统利弊的审计工作。[1]　　（四）加强各类审计软件的开发　　审计软件在保证审计工作顺利开展方面发挥至关重要的作用，但由于软件的不同导致数据库、使用方式也不尽相同，这些均在一定程度增加了计算机审计的难度。所以，审计部门应该在所在地区推广通用的审计软件，并实现财务软件和审计软件接口的统一，不断提升软件的实用性，以充分满足当地审计工作的需求。除此之外，审计部门还应该结合所在地区的审计情况，按照财政预算基金和重点专项基金，开发出具有地方和行业特色的审计软件，全面提高审计的效率和质量。　　四、结语　　随着计算机技术的飞速发展和广泛应用，在信息化时代下，利用计算机技术实现审计工作的信息化已经成为时代的必然要求。对此，审计部门及工作人员必须深入分析计算机技术对审计信息化的影响，结合会计信息化发展的要求，不断转变审计理念和审计手段，提高审计的效率和质量。　　（作者单位为沧源佤族自治县审计局）"}
