{"title": "信息化背景下的中职计算机教育改革研究", "url": "https://www.lunwendata.com/thesis/2019/157715.html", "time": ["2019-03-09"], "info": "　　中图分类号：G712 文献标识码：A 文章编号：1003-9082（2015）04-0235-01　　在当今社会里，计算机已经成为一种必须掌握的工具，所以对中职学生普及计算机教育是一件必须而且重要的事情。中等职业计算机学校培养的学生应该是具有综合职业能力的应用型，技能型高级人才。怎样实现这一目标，是个值得我们长期思考且意义深远的问题。　　一、计算机教学障碍的成因分析　　1.学生整体素质下降　　由于近年来普校招生规模的扩大和人们就业观念的转变，使得职业学校生源的素质参差不齐，学生普遍学习目标定位不高，学习态度不端正，主动性不够；加上网络的兴起，使得学生系统学习计算机基础知识的毅力和兴趣不足。　　2.学习模式的变化负面影响了学生的学习注意力　　中职学校与普通高中不同，学生进入中专学校，就意味着从中学的语数外常见基础课的学习模式转变成相对生疏的专业基础课学习模式，学习方式发生了很大转变。同时，学习的时间安排也从“单节”转变成了“双节”，这些因素都一定程度的影响了学生注意力的集中度。　　3.硬件环境受到限制　　计算机课程的教学不同于其他课程，不仅要上好理论课，而且要及时地进行理论知识的巩固和延伸，也就是上机操作，传统的“粉笔加黑板”的授课模式已不能适应计算机教学，这就要求学校能够更多的创造学生上机练习的机会，在业余的时间更多的开放机房，才能使投入的设备能够更充分的发挥作用。而这些要求由于校舍、资金等多方面的因素限制，使得许多中职学校还难以达到。　　4.教学内容相对抽象　　在计算机基础知识的教学中，学生要面对许多抽象的新名词，都是一些学生从未接触过也看不见摸不着的东西，因此导致学习这些知识的适应过程就较其他课程显得漫长了很多。　　5.缺乏有力的考核机制　　学生在毕业前，参加劳动和社会保障局组织的技能鉴定，也就是关于上机操作的最高级别的考试。无论从题量，还是从体型来看，大部分学生都能顺利通过，而学生便以此作为自己学习的目标。因此，技能鉴定在目前的中等职业教育中形同虚设，并不能提高学生对实践能力的重视。　　二、教学对策的思考与探索　　1.改变教师观念，提高教师业务水平　　计算机应用的日新月异，对中职计算机基础教育提出了新的要求和挑战，计算机已成为一门公共必修课，但我国目前中职计算机基础教育教师还相对紧缺，教学任务的繁重使得他们很少有时间去从事教学研究工作，更少有机会接受必要的培训和与外界接触，这些都使计算机教师的专业知识和教学技能无法及时的得到更新和提高，知识和观念落后于形势的发展，一定程度的影响了计算机教学的进步和教学质量的提高。　　在面临“知识爆炸”的时代，旧的教育思想、观念、教学模式是难以培养智能充分发展的创造型人才。学校也要适时的组织对教师，尤其是青年教师的培训，加强对教师的实验指导能力的培养和考核，条件允许的情况下，计算机教师应在计算机上备课、出试卷、制作多媒体教学辅助软件，在多媒体教师进行授课。学校每年也可组织人力财力鼓励知道计算机教师进行计算机应用课程的开发和研究，通过各种奖励和鼓励的方式提高教师积极性，提高学校学术氛围和教师的教学储备。　　2.合理设置专业　　不同的中职学校，学习的侧重点也不同。在中职计算机专业设置上，应有长远的战略性的眼光，改变过去单一的结构，朝专业化和行业化方向发展，按社会行业需求和计算机应用软件发展情况设置相关合理实用的专业。　　3.培养全面的学生　　培养全面而又有一技之长的学生，我认为应从以下几个方面入手：①注重操作技能培养，做到理论实践相结合。保证充足的上机时间。②激发兴趣，使学生主动学习。③选择一本好教材，拓宽讲授内容。教材选择应注意实效性和实践性；拓宽讲授内容则要求教师经常上网收集与所教课程有关的资料，吸收最新、实用、有价值的技巧传授给学生。④培养自学能力、动手能力和创造能力，激励学生的创新精神。唤起创造意识，激发创造精神；尊重学生的主体精神，培养主动性；注重因材施教，开发创造才能；重视个性发展，培养创造意志。⑤此外还有，保护学生的好奇心与求知欲，激发学生学好计算机的学习动机；培养学生独立与自信的品质；培养学生专注与坚持的精神等等。　　4.合理、科学教学方法的运用　　教师作为学生学习的引导者，制定科学合理的学法是成功的一半。通过自己的教学实践和对他人的借鉴和学习，我认为以下四种方法非常适合计算机知识的教学，很值得研究和尝试。　　4.1项目教学法： 职业教育中的项目是指以生产一件具体的、具有实际应用价值的产品为目的的学习任务。项目化教学就是“以学生为本、以项目为中心”组织学生真实地参加特定项目的设计、实施及管理，让学生从亲自经历中获得经验和技能，从而达到教学目标。　　4.2任务驱动法： “任务驱动”是一种建立在建构主义教学理论基础上的教学方法，它更适合以动手操作为主体的课程教学。在计算机实践操作课中应用“任务”驱动教学，不仅能让学生更易、更透、更活地掌握教学内容，而且也拓宽了学生的专业知识面、提高了学生的综合应用知识能力；同时，也有利于挖掘不同层次学生的潜力，培养了学生积极、主动地解决问题的能力和创新意识。　　4.3问题解决法： 问题解决法即教师根据教材中的知识点精心创设活动情境，引导学生发现问题、提出问题、分析问题、解决问题，让学生在一系列的知识探究过程中掌握知识，提高操作技能，增强学生的实际动手操作能力。问题教学法更有利于激发学生的思维活动，培养学生自主学习能力和创造性，更有利于提高学生学习的积极性与主动性。　　5.构建适应中职生的计算机教学学业评价体系　　面对这些中职生基础薄弱，学习热情不高，自觉性和自信心都有待提高的特殊情况，盲目套用普通中学的教育教学评价方式，势必达不到预期的理想效果，如何创设新型合理的现代化评价模式，如何将传统学业评价更好的运用于职业中学计算机教学中，达到最优化的教学效果，这也是我们所亟待思考的问题。"}
