{"title": "面向工程的计算机专业实践教学体系研究", "url": "https://www.lunwendata.com/thesis/2019/152691.html", "time": ["2019-01-14"], "info": "　　中图分类号：G434　　文献标识码：A　　文章编号：16727800（2017）004021902　　0引言　　我国高校计算机及相关专业分布最为广泛，在校生规模远超其它专业，毕业生人数也位居各专业前列，但在就业率排名中，该专业却屈居下游，甚至出现在十大就业困难专业名单中。究其原因，主要是高校在创办该类专业时，师资、教学设施、实践环节等难以适应迅速变化的专业发展要求。高校应主动适应“互联网+”的时代要求，变革计算机及相关专业培养模式，提升办学质量与效果。本文结合面向工程的实践教学思想[1]，探讨了地方院校计算机及其相关专业实践教学体系构建，并在实际教学中进行了尝试。　　1计算机专业实践教学体系现状分析　　上世纪90年代后期新升格了一批地方本科院校，大多数学校计算机及相关专业的实践教学体系采用传统教学模式，具体体现在以下几个方面： （1）没有形成以工程要求为目的的实践教学体系。由于师资、教学资源受限于学校整体环境，适应时代发展需求的实践教学体系还在不断探索中，计算机专业虽然需要紧跟时代，但在旧的体制下难以快速发展。 （2）大部分新升格地方本科院校偏处一隅，引进优秀师资有一定难度；受限于办学经费的缺乏，教师培训投入明显不足，计算机及相关专业的学科发展及教学体系完善任重道远。 （3）高校扩招，学生规模急剧膨胀，但与之相匹配的教学资源投入明显不足，大班教学成为常态，教师常处于疲惫应对中。计算机专业作为一个变化迅速的专业，这种教学疲态致使教学效果大打折扣。　　2面向工程的实践教学体系构建　　计算机诞生于解决工程问题的实际需要，天生就与工程密切相关。对于计算机专业教学来说，以面向工程的思维方式开展教学，更能使学生了解计算机理论知识的精髓，培养其实践能力。　　2.1实践教学模式构建　　近年高校的实验环境得到了极大改善，师资也大量引进，为提升人才培养质量，各高校计算机类专业纷纷进行了教学模式的探索与改革[24]，笔者所在院校也对计算机类专业的实践教学模式进行了面向工程模式的探索，以提升学生的实践能力。 计算机类专业人才培养以“工程实践能力强、综合素养好、具有创新和竞争能力的实用型人才”为目标。为达此目标，笔者所在教学团队通过实验、实训、实习3种不同类型的实践教学方式促进学生工程实践能力大力提升。计算机专业课程有较强的基础性和理论性，通过实验可以使学生掌握和验证相关理论的基本原理，这一实践教学活动侧重于培养学生的专业技能。实训是模拟计算机专业各种工程应用环境，注重工程实践能力的训练，具有较强的技术实现性和工程复杂性，该教学活动侧重于培养学生的工程能力和创新能力。实习是对计算机专业工程领域的生产现场进行认识、理解和掌握的过程，具有一定的宏观性、较强的工程实现性和综合性特点，它能进一步加强学生的工程能力、社会适应能力以及产业融入能力。　　2.2实践教学质量控制　　笔者所在教学团队开展的实践教学活动，对以上3种类型的实践教学提供可控的质量保证，在每种类型的教学活动中实施 “导入、示范、训练、评价、强化、反馈、应用、监管”等质量监控环节。为了让教学成效落到实处，教学模式中改进了教学效果评价机制，学生必须通过实验、实训、实习环节的考核，才能顺利获得学分。为使这一机制得以顺利实施，成立了由教学指导委员会、教学督导、专业指导教师组成的实践质量保障机构，构建了一个完备的工程实践教学平台。依托该平台，完善 “实验、实训和实习”的实践教学质量标准和管理制度，建立以“知识―能力―素质”进行综合评价的实践教学考核办法，并在实训、实习过程中聘请具有双师型教师，建立专兼职相结合的开放式师资队伍，保障实践教学全过程动态管理，实现实践教学过程的全生命周期量化可控管理。　　2.3教学模式实施　　为更大限度地提升实践教学效果，教学团队在学校及所在学院的支持下，以更接近于实际的工程项目锻炼学生，在整个“实验、实训、实习”环节，创造条件让学生进入教师工作室，参与纵向或横向项目研究，或到有关企业开展管理运作模式实践。将学生分成若干团队，在指导教师的带领下，参与企业的模拟工程项目。在实训的第二阶段，学生直接参与企业的裁剪项目，在真实环境中完成实践训练。在大三第二学期或大四时，组织学生到企业实习，严格遵循企业管理制度工作，加强学生的工程体验。为了强化实践教学效果，在开展实践教学过程中，利用各种资源加强与相关企业合作，学生进入百度、浪潮等著名企业，并在校内成立嵌入式与移动开发实训中心、物联网创新中心、软件工程实训中心等，用于学生训练。　　3面向工程的实践教学体系实施成效　　面向工程的计算机专业实践教学体系，通过与业界企业合作，弥补了学校教师实践经验不足的缺点，教师参与该体系教学过程，参与实际工程项目的整个流程。在这个过程中，教师的教学理念和教学方法不断得到启发和更新。学生不仅掌握理论知识的实际运用，了解实际工程项目的规范化流程，而且锻炼了团队沟通协调等综合能力。工程实践中技术人员的想法与经验常常激发出学生的创意，这些是在课堂上无法获得的。 通过实际工程项目训练，学生的工程思维能力得到了提高，实践能力得到了提升。学校组织部分学生参加国际ACM区域赛，多次取得区域赛银奖或铜奖；在国内相关程序设计大赛或数学建模竞赛中，也多次获得一、二、三等奖。通过实践教学体系培养的学生，就业的选择面与起薪明显优于以前，部分学生进入百度、搜狐等业界著名企业，部分学生在相关企业做到项目主管或项目经理位置。　　4结语　　本文通过对地方院校计算机类专业实践教学模式的梳理，归纳了其中存在的问题，对构建面向工程的实践教学体系进行了一些有益尝试，实践证明本文的研究很有成效。"}
