{"title": "基于全国计算机等级考试的C语言教学改革探讨", "url": "https://www.lunwendata.com/thesis/2019/156431.html", "time": ["2019-02-23"], "info": "　　中图分类号：TP393 文献标识码：A 文章编号：1009-3044（2018）14-0111-02　　1 引言　　全国计算机等级考试 （National Computer Rank Examination，NCRE）经教育部批准，由教育部考试中心主办， 面向社会，用于考察应试人员计算机应用知识与能力[1]。教育部考试中心从2018年开始使用新的考试大纲，全国计算机等级考试二级C语言采用无?化考试，时间为120分钟，满分100分。近年来，全国计算机等级考试证书越来越受到在校大学生的青睐，我校每年春季和秋季各举办一次全国计算机等级考试，每次有2000余人参加C语言科目的考试，如何提高考试通过率，对我们的教学改革提出了挑战。　　2 试卷题型分析　　全国计算机等级考试二级C语言采用无纸化考试，考试题型有单项选择题和操作题。　　2018年春开始使用新的考试环境，操作系统使用中文版Windows 7，C语言开发环境使用 Micrsoft Visual C++ 2010学习版。　　2.1选择题（40分）　　选择题都是单选题，共40题，每道题的分值为1分，占40分，前10题是公共基础内容，后面30题全部属于C语言程序设计这门课程的内容。选择题主要考察学生对基本概念的全面掌握，要求准确理解、思路清晰。　　公共基础题主要涉及算法及特性、数据结构中的栈、二叉树、数据库中的表、实体联系图、模式、关系表以及软件工程中的测试等内容。　　有关C语言方面的选择题涉及到考试大纲要求的各个方面，主要涵盖数据类型、变量定义、三种程序结构、一维和二维数组、函数、指针、文件、结构体与共同体以及简单的链表操作等内容。　　2.2 操作题（60分）　　操作题包括程序填空、程序改错和程序设计题三种题型。　　程序填空题共18分，主要考察学生对C语言基本知识的掌握。程序改错共18分，通常包括2-3个错误需要修改，错误主要涉及到语法和逻辑错误，做该题要特别注意，不能添加多余的语句行，只能修改出错的行，或者调整程序行的顺序。　　程序设计题共24分，要求学生完成一个独立函数的编写，本题主要侧重于基本算法的考察。学生在学习过程中要理解和掌握一些基本的算法，通过实际的上机积累，提高自己编写程序、调试程序的能力。　　总之，操作题考察学生综合运用基础的操作能力和程序编写能力，这类试题综合性强、难度较大，学生考试时失分较多。在做这类题目时，不要盲目做题，要先读懂题目的要求，分析程序的结构，然后运用一些调试手段完成题目。　　3 教学存在的问题　　3.1 学生对该课程认识不足　　除计算机、通信等有关专业外，学校还在自动化、电力、汽车工程等多个专业设置了C语言课程，大部分学生是非计算机专业的， 他们普遍认为这门课程与自己所学专业无关。上课时听讲兴趣不高，实验课上，很多同学自己编写，直接从网络上搜索的实验结果交给老师，应付检查。这种学习态度，导致真正学好这门课程的学生不多，更不可能通过C语言等级考试。　　3.2教学针对性不强　　教学目标就是教学的一个标准，教学目标规定了教学要达到的程度，它是教师教学和学生学习的依据，教学目标的制定可以克服教学的盲目性，在教学过程中占有重要的地位[2]。教学改革前，没有制定针对全国计算机等级考试的教学大纲，导致教学针对性不强。　　3.3实践教学重视不足　　在教学过程中，教师侧重课堂的理论教学，忽略了编程实践能的培养，在实验环节，对学生要求不严格，导致学生的编程实践能力得不到提高。　　4 教学改革措施　　4.1组建C语言教学团队，注重课程体系改革　　学校教务处牵头组织成立计算机基础和C语言教学团队，建立独立的教学职能部门。研究建立针对等级考试的教学体系。　　由于全国二级C语言课程考试中涵盖含计算机公共基础知识部分10分，所以在大一新生的计算机基础教学中，需要针对这部分内容进行讲解。同时，对进制、ASCII表等有关C语言学习基础的内容详细讲解，为学生将来学习C语言打好基础。　　4.2加强师资队伍建设及时更新教材及教学大纲[3]　　优秀的教师队伍是推进教学改革的保证，因此，加强任课教师队伍建设非常重要。 其一，要从质量和数量上确保教师队伍的稳定。 建立健全机制，强化教师主人翁责任感，全面提高教师队伍素质，从而有效提高该课程的教学水平。 其次，紧扣全国计算机等级考试大纲，及时更新使用的教材，做到与等级考试相一致。　　4.3 加强实践教学，提高学生的编程能力　　在这门课程的全国计算机等级考试中，操作题占60分，而这部分操作题目不仅要求学生能熟练使用开发环境，同时需要具有基本的纠错和调试程序的能力。　　C语言程序设计是一门实践性很强的学科，在 C 语言实验课的教学中，要充分尊重学生学习活动的主体性地位，充分调动他们的学习兴趣和主动参与意识，通过一个个编程实践培养提高他们独立分析问题、解决问题的能力。　　4.4课程考察与全国等级考试相结合　　自主开发一套C语言无纸化考试系统，参阅考试大纲和历年考试试题组织自己的题库，期中、期末考试使用该系统，提高学生对无纸化考试系统的认知度。　　4.5 开设多种形式的考前辅导，提高通过率　　考前开设多种形式的辅导，如课堂辅导、QQ群辅导、在线学习网站辅导等。学生可根据自己的情况选择不同的辅导形式。　　辅导教师以最新发布的考试大纲为指导，对考点进行归纳总结，认真备课，详细系统地讲解课程的知识体系，对历年的考试真题进行分析解答。学生经过辅导培训，不仅掌握计算机等级考试的知识点，而且能够全面了解计算机等级考试的题型和内容，以及做题的方法、答题原则和技巧等，事半功倍，从而快速通过计算机等级考试。　　4.6 组织学生进行考前模拟　　在全国计算机等考试开考前几天，组织报名参加考试的同学进行考前模拟，该模拟系统除使用考试院提供的模拟题库外，与全国计算机等级考试的正式系统一样。通过模拟学生熟悉操作界面，充分了解各个功能模块的功能，正式考试时能够从容应对，少犯错误，从而提高通过率。　　5 结束语　　全国计算机二级C语言等级考试要求考生全面掌握各章知识点，具备一定的程序阅读能力和程序编写、纠错、调试能力，同时，掌握一定考试技巧和应试策略。　　近几年，我校通过实施本文提到的一些教学改革措施，充分调动学生的学习积极性，培养和提高了学生分析问题和解决问题的能力，在全国计算机等级考试，极大地提高了二级C语言考试科目的通过率。"}
