{"title": "新时期文书档案计算机管理利弊分析", "url": "https://www.lunwendata.com/thesis/2019/153532.html", "time": ["2019-01-23"], "info": "　　文书档案作为档案管理中的重要部分，它记载着社会发展的所有细节，能够较为全面地体现出问题的处理情况以及管理层的决策。现代计算机技术已经延伸至各领域的发展中，利用计算机进行文??档案管理，有利于推动档案事业的发展。本文首先阐述新时期文书档案计算机管理自身的优势，其次说明其自身存在的不足，最后提出相应的应对措施。　　一、文书档案计算机管理的优势分析　　（一）文书档案计算机管理具有方便快捷的优势。在文书档案计算机管理的诸多优势中较为明显的是其自身的方便快捷。在具体的档案管理工作中，可以完善以往文书档案管理中的不足之处，利用先进的计算机软件可以对文书档案相关的资料进行收集、分类以及存储等工作，这一管理方式方便快捷。特别是利用计算机进行关键词的检索，方便档案人员查找文书档案。从事档案的工作人员在具体的工作中，可以在计算机系统中输入相关关键词，可以迅速得到想查找的文书内容，高效提高档案管理的工作效率。利用计算机管理文书档案，可以减少漏写或是漏抄的管理方面发生失误的几率。　　（二）实现文件与文字信息的交流与共享。传统的文书档案管理中，各个企事业单位不能进行信息资源的共享，使文件柜中大量的信息被闲置，不仅不方便查找文件信息，还在一定程度上浪费了文书资源与资金。利用先进的计算机技术实现文书档案的科学化管理，实现文件级的管理文书档案，并实现文书档案的体系管理，同时实现了内外部特征档案合并管理。计算机与网络技术仍在不断发展，能够使档案信息及载体实现分离利用，同时能够与企业的信息系统建立相应的关联，有利于提高文书档案的工作效率及质量。文书档案的计算机管理可以不受空间限制查阅文书档案。利用网络服务平台可以及时了解文书档案最新的管理信息动态。　　（三）文书档案计算机管理保存工作的便利性。利用先进的计算机设备做好文书档案的管理工作，不论是员工还是使用者不需要进入文书档案库区，即可直接查阅文书档案的具体信息，不再受文书档案科室地点的限制，有利于延长文书档案的使用年限，防止文书档案在被查阅时发生损坏。　　二、文书档案计算机管理中存在的主要问题　　（一）文书档案计算机管理存在网络安全问题。现代社会发展已经呈现出网络化的发展态势，因此需要重视文书档案信息的网上管理安全可靠的问题。网络的发展的不安全性制约着文书档案的发展。网络不安全性的规律可以总结为网络用户数量按照算术级数增加，网络的危险性以几何级数增加。在发达国家中已经开始重视网络安全问题。对于计算机网络系统造成威胁的原因有许多，利用病毒侵入、网络信息泄露以及黑客入侵等。现代文书档案计算机管理发展已经受到网络安全问题的影响。　　（二）文书档案计算机管理存在保密性不佳的问题。利用计算机进行文书档案的管理，使文书档案的内容易于变化，没有了固定的形式，同时自身的保密性变差。计算机管理文书档案，使其内容比较容易被修改，并且在改动后不会留下任何痕迹，相比于纸质文件而言，计算机管理模式更容易使文书档案的内容发生变化，而且人们无法对文书档案进行原件的辨别。　　三、文书档案计算机管理问题的应对措施　　（一）增强文书档案工作的标准化程度。文书档案管理应用的计算机涉及许多问题，例如设备兼容，文书档案数据著录以及应用软件的推广，这些均需要一系列的标准才能够得以解决。由此需要制定相关的行业标准或是国家标准。电子文件与纸质文件之间有较大的区别，大部分文书档案工作者对电子文件的特殊性不熟悉，这对于文书档案的管理工作是一个隐患。因此需要加强文书档案工作者对于电子文件特性的研究，剖析文书档案从生成机制到归档保存的每一个环节，保证档案的真实性与安全性。而且需要对电子文件归档后形成的电子档案管理提出要求，对于逻辑归档中的不安全性采取一定的措施予以解决，并保障文书的电子档案能够被长久保存。　　（二）加强文书档案计算机管理的网络信息安全的管理。在文书档案科室内部的计算机网络与外部网络之间，设置一定的物理隔离，有利于增强办公自动化网络安全，该方法是最为有效的措施。第一步防护隔离措施是路由器，利用路由器对IP地址进行屏蔽。第二步防护隔离措施是防火墙。防火墙自身具备认证机制，防火墙自身具备对进出的网络数据进行过滤；对于进出网络的访问行为进行管理；对禁止服务进行封堵工作；对于文书档案的网络攻击进行检测与告警工作；同时记录好通过防火墙的信息数据。　　四、结束语　　对于文书档案进行计算机管理是实现文书档案现代化发展的重要举措，有利于适应现代的发展需要，尽管在文书档案的计算机管理中存在一定的不足，但是相信在不断完善计算机管理工作中，能够解决这些问题，促进文书档案事业的发展，同时文书档案企业能够为人们提供更便捷的服务。"}
