{"title": "软件工程专业“计算机网络”课程实验教学研究", "url": "https://www.lunwendata.com/thesis/2019/160668.html", "time": ["2019-09-12"], "info": "　　Abstract： Firstly， this paper expounds the problems existing in the experiment teaching of computer network course of software engineering specialty， and deeply analyses the causes of the problems. Then according to the training objectives of software engineering specialty， specific solutions are given， including improving the experimental content， adjusting the proportion of network programming， and formulating new experimental schemes. At the same time， different experimental methods and assessment methods are adopted for different types of experiments in order to enhance the experimental effect.　　Key Words： Software engineering; Computer network; Course; Experimental teaching　　《计算机网络》课程是关于计算机网络知识和主流技术的一门课程，是计算机技术和通信技术紧密结合形成的新的技术领域，是当今计算机界公认的主流技术之一，也是迅速发展并在信息社会中得到广泛应用的一门综合性课程。该课程的主要任务是讲授计算机网络的基础知识和主流技术，包括计算机网络的组成、体系结构及协议、局域网标准及主流局域网技术、广域网、网络互连技术、网络应用等。通过该课程的理论学习和实践训练，可以使学生理解计算机网络的体系结构和网络协议，掌握组建局域网和接入Internet的关键技术，培养学生初步具备局域网组网及网络应用能力，从而为后续实际应用打下良好的基础。基于此，《计算机网络》课程是各高校里网络工程专业的专业基础课，同时也是软件工程专业和计算机科学与技术专业的必修课。在作者所在的软件学院，《计算机网络》就是软件工程专业学生必修的一门专业基础课程。因为该课程内容涵盖面广，概念多，既有通信的基本理论与技术，也有计算机硬件知识，更有大量的协议算法，所以导致该课程的理论性和实践性要求都很强，要求除了理论讲解，必须安排实验环节，才能真正达到好的教学效果。目前各高校在这门课的培养计划中，基本上也都安排了相应的实验学时。关于实验内容的制定、实验方式的选择，也一直是各高校教授该课程的教师所热衷的话题[1-4]。该文仅围绕作者在为软件工程专业讲授该课程的教学过程中，在实验环节发现的一些问题进行分析，并给出相应的解决方案。　　1 &nbsp;目前实验教学中存在的问题　　1.1 问题　　软件工程专业的学生，培养目标是掌握软件工程专业的基本理论、基本知识及基本方法，适应行业技术的快速发展，并具有软件开发能力以及软件开发实践经验，具有良好的项目组织的基本能力和沟通交流能力，能在软件工程、计算机应用等行业和领域，从事与软件工程专业工程相关的技术研究、设计、开发、管理、服务等工作的专门人才[5]。而目前的时代背景下，计算机网络的发展越来越受到国家与社会的重视，计算机网络给人们的生活带来的便利有目共睹，各个企业、各个部门的运作基本都离不开计算机網络了，因而基于计算机网络的程序也越来越普遍。作为软件工程专业学生，自然要适应社会发展的需要，充分认识到网络知识的重要性，掌握基于计算机网络的软件开发技术。但是实际上学生对这门课程却不是十分重视，甚至有学生认为这门课就应该是网络专业学生才应该学的，跟软件开发并没有多大关系，学生的学习兴趣不高，对实验也不怎么重视，实验只是被动地完成，实验效果并不理想。　　1.2 原因分析　　出现上述问题的原因，笔者分析主要有以下几点。　　（1）课程之间脱节。软件工程专业的学生在之前学习的所有专业基础课以及专业课，只有JAVA程序设计里面涉及一点网络编程，而且只是基于互联网的HTTP协议，由于当时学生还没有学习网络知识，所以并不能深入理解并掌握相关知识，只是简单了解而已。而计算机网络这门课程又是以介绍网络实现原理为主，也没有涉网络各层协议的具体应用，所以网络编程对于软件工程专业的学生来说就是一个盲区，等其将来进入公司参加实际工作时问题就会暴露出来。　　（2）实验内容单一，没有与专业培养目标结合。纵观各高校的计算机网络课程实验内容，基本都是搭建网络硬件环境、网络结构设计、网络服务器配置、网络软件环境配置、网络管理工具学习及网络协议分析、网络应用编程等内容。而软件工程专业的学生主要培养的是软件设计与开发，其实验内容设置不应该和网络专业的学生一样侧重网络建设与维护，而应该更加注重网络编程。而大部分软件工程专业的实验内容却与网络工程专业的实验内容并没有大的区别，仍然以网络建设、网络维护内容为主，最应该练习的基于网络的编程却占了最少的学时，实验内容的设置没有体现专业培养目标的区别。   　　（3）实验教学方法落后。现行的实验教学体系中，实验内容及步骤等大部分都由教师指定，学生实验前准备不充分，只是被动地做实验，这样很难提高学生分析解决问题的能力。另外，在实验过程中也没有区分学生的层次，实验方法的设计不能充分调动学生的积极性。　　2 &nbsp;计算机网络实验课程改革　　针对上面提出的问题，通过认真研究理论课与实验课的具体情况，笔者认为由于课时及授课内容的限制，理论课除了引入协议算法实现外，其他可操作的空间并不大。所以重点是结合课程实际进展，并参考其他院校的改革措施[3-5]，提出了如下实验教学改革方案。　　2.1 以专业培养目标为导向，改进实验内容　　由于培养目标以及实验环境的限制，实验内容侧重网络编程这一部分，在实验内容设置时，组网与网络环境建设与维护可以作为验证型实验，目的是让学生掌握基本的网络知识，并学习配置网络环境，为后续基于网络环境的软件开发做好准备。网络管理工具及协议分析设为综合型实验，通过工具进行数据包获取，并对各层各类协议的数据包进行分析，能促进学生更好地理解网络中数据通信的实现原理与过程。最后安排近一半的实验学时进行针对各种网络协议的算法实现与应用程序设计。整个内容由浅入深，由基础到应用。在程序设计实验内容设计上，为了和其他课程更好地衔接，可以和前一学期为其讲授JAVA和JSP课程的教师共同确定，选取这两门课程使用过的适合该门课程的程序案例，并把涉及到的编程知识点以课后作业的形式布置下去，让学生课下自学，这样既弥补了实验学时不足的问题，又能使学生更深入地理解知识的应用形式。　　2.2 针对不同类型的实验，采用不同的实验方式　　验证性及综合性实验不分组，而设计性实验学生可以组队完成，每组2～3人，可以分别完成服务器端和客户端程序，也可以小组一起协作，完成一个相对完整的网络通信程序。分组的目的一是方便角色划分，二是考虑不同层次的学生的编程水平，有的学生对编程语言掌握得并不太好，独立完成一个完整的大程序有一定困难，在分组的模式下，这样的学生就可以和编程能力比较强的组队，大家一起探讨研究，共同完成实验任务，这样使得落后的学生也能参与进来，学到一定的知识。　　2.3 改变单一的实验考核方式，不同类型实验考核方式不同　　验证型和综合型实验，主要考核学生实验课堂表现及实验内容完成情况，学生必须当堂提交实验报告。设计型实验考核则采取课堂表现和程序答辩结合的方式，主要以答辩成绩为主，学生在答辩结束后以小组的形式提交程序代码。答辩时由任课教师随机抽取每组中一名同学进行答辩，该同学的答辩成绩就代表整组的成绩，以此督促所有学生都能积极参与到实验中。　　3 &nbsp;结语　　不同专业的学生，培养目标不同，那么课程内容的选择及实验内容的设置也应该有所区别。要以培养目标为导向，紧跟时代发展，根据學科发展的新动向，及时调整教学内容及教学方法，以适应教育教学的发展需要。笔者深入研究了软件工程专业的计算机网络课程的一些问题，给出了针对问题的具体的解决方法，经过一轮实践检验，确实提高了学生的学习兴趣，学习效果也得到了很大改善。"}
