{"title": "基于MOOC的大学计算机基础翻转课堂实践与探索", "url": "https://www.lunwendata.com/thesis/2019/160345.html", "time": ["2019-07-24"], "info": "　　0 引言　　大规模在线开放课程（Massive Open Online Course，MOOC）与翻转课堂相结合的混合教学模式对高校传统课堂教学形成冲击，为高等教育改革带来新的机遇与挑战[1-3]。翻转课堂于2007年起源于美国，是一种重新调整课堂内外教学活动的新型教学模式。学生在课前通过观看视频、在线测试、论坛讨论等形式自主学习课程内容;课堂上，老师和学生一起讨论、互动、解惑，以深入理解课程内容[4]。翻转课堂是对传统课堂教学模式与教学流程的彻底颠覆，由此引发了教师角色、授课模式和管理模式等一系列变革。　　目前，各高校纷纷推出了与大学计算机基础相关的MOOC课程，这些课程各有侧重点和特色[5]。例如：哈尔滨工业大学战德臣等[6]的《大学计算机—计算思维导论》，北京理工大学李凤霞等[7]的《大学计算机》等。笔者基于自主建设的大学计算机基础MOOC课程，开展线上线下相结合的翻转课堂教学[8]。近年来，围绕翻转课堂教学问题，国内外学者开展了多方面的研究工作，包括翻转课堂教学方法、学生对翻转课堂的体验、学习成效等[9-11]。各学科专业课程也纷纷开展了MOOC和翻转课堂相结合的教学实践，对资源建设、课堂活动、评估及反馈机制等进行教学设计[12-13]。在MOOC背景下的大学计算机课程翻转课堂教学方面，有学者提出翻转课堂教学优势、教学方法和策略等[14-16]，但并未给出较具体的实践方案。本文结合自建的MOOC课程设计具体的翻转课堂实施方案，并对翻转课堂组织方式及授课内容进行详细的教学设计，通过开展混合式教学实践，对实践结果进行分析。　　1 翻转课堂实施方案　　在MOOC与翻转课堂相结合的混合教学模式中，对原课程教学安排和考核方式进行相应调整。在新教学模式下，课程总学时为24学时，其中翻转课堂12学时，实验教学12学时，翻转课堂具体包括：大班讲授2学时，小班研讨10学时。　　课程考核由期末考试、MOOC学习、实验3部分组成，各部分占比如表1所示。　　翻转课堂针对课程重难点内容，选取5个主题，开展10学时的小班研讨，研讨主题及学时分配如表2所示。　　研讨课要求学生课前完成老师布置的学习任务，包括MOOC视频学习及在线测验，在学习过程中，学会自行解决低级问题，并提出高级问题。在课堂上，老师先对教学内容进行概要回顾，然后针对关键知识点提问，随后学生分组开展讨论，老师引导学生理论联系实际，应用所学知识解决实际问题，培养计算思维能力。　　翻转课堂大班讲授2学时，包括课程总体介绍1学时和课程总结1学时。课程总体介绍包括：①MOOC的定义、MOOC发展现状、如何使用MOOC资源;②什么是翻转课堂、课前需进行的准备工作、课堂及课后需完成的任务;③课程计划与总体安排。　　2 翻转课堂组织方式　　翻转课堂小班研讨以分组形式进行，学生按6～8人进行分组，针对每个研讨主题开展4个环节的教学，分别是：①内容回顾与提问;②实际应用;③游戏;④讨论。　　以两学时（90分钟）的研讨课为例，各环节参与及组织方式、时间分配、评价方式如下：　　（1）内容回顾与提问。参与和组织方式包括：老师首先概要回顾该主题主要知識内容，然后学生在小组内提出自己的问题，并回答其他同学的问题，老师汇总每组不能解决的问题，统一解答。如果没有学生提问，老师将根据教学重点向学生提问。时间分配为20分钟。该项评价占30%，要求能提出有意义的问题。　　（2）实际应用。参与和组织方式包括老师首先示范性地给出几个知识点的应用实例，启发学生，随后学生在组内讨论，给出应用实例，并对其中运用的知识进行说明和展示。时间分配为25分钟。该项评价占比40%，要求举例说明所学知识在实际中的应用，根据小组展示情况给分。　　（3）游戏。参与和组织方式包括：老师首先讲解游戏规则，随后学生在组内开展游戏互动，解释游戏中运用的知识。时间分配为15分钟。该项作为额外附加分，要求学生解释游戏的意义，发现其中蕴含的知识。　　（4）讨论。参与和组织方式包括：老师首先根据该主题知识内容提出实际问题，随后学生通过小组讨论给出解决方案。时间分配为30分钟。该项评价占30%，要求设计方案应用目标知识，解决老师提出的问题。不同小组之间交叉展示，互评给分。　　在翻转课堂的小班研讨中，主讲老师负责对各环节进行总体把握，助教负责辅助小组开展讨论。具体安排包括4个环节：内容回顾与提问、实际应用、游戏及讨论。　　在内容回顾与提问环节，主讲老师回顾该主题主要知识内容，汇总每组不能解决的问题，统一解答，当没有学生提问时，根据教学重点向学生提问;助教查看每个小组的讨论情况，帮助回答小组学生的提问。　　在实际应用环节，主讲老师示范性地给出知识点应用实例，启发学生，为小组展示打分;助教查看小组讨论情况，帮忙解答小组疑问，为小组展示打分。　　在游戏环节，主讲老师讲解游戏规则，解释游戏蕴含的知识;助教协助小组开展游戏互动。　　在讨论环节，主讲老师根据该主题知识内容提出实际问题，小组讨论结束后给出问题的示范性解答;助教查看小组讨论情况，帮忙解答小组疑问，监督小组进行交叉互评给分。   　　在翻转课堂教学活动中，使用了清华大学开发的雨课堂工具，利用雨课堂开展课前预习、课堂签到、课堂投票、随机点名提问、实时答题等教学活动。　　3 翻转课堂教学设计　　翻转课堂教学针对每个研讨主题，进行相应教学设计，其中借鉴了《不插电的计算机科学项目》的游戏及案例，思科IT基础课程中的虚拟计算机组装环境，美国三一学院的MOOC——App Inventor移动计算中提供的4比特计算机模拟器，以及思科Packet Tracer网络模拟环境等[17-20]。　　本文以研讨“数据的表示与运算”为例制定教学设计，该部分是课程重难点，知识内容比较抽象，学生不易理解和掌握。学生课前需完成的学习内容包括：进位计数表示方法、计算机中数值数据的表示、数据之间的运算、非数值型数据在计算机中的编码、数据校验码。翻转课堂上开展理论联系实际的教学，目的是让学生不仅掌握知识本身，还能探究知识在实际中的应用。　　本次研讨包括3个主要内容：　　（1）进位计数制表示方法。共有4个环节：①内容回顾与提问，计算机中常用的4种计数制及它们之间的相互转换。为检测学生课前学习效果，首先提出简单直观问题，如：二进制数00110对应的十进制数是多少？5位二进制数能表示的最大数字是多少？二进制数（110.01）2的真值是多少？十进制数13.625转换为二进制数是多少？利用雨课堂开展实时答题，并实时查看答题情况。然后，提出较深入问题，如：计算机中的数据为什么以二进制的形式表示？②实际应用。在学生理解二进制工作机制以及计算机如何处理信息之后，即可联系实际，如：32位计算机、64位操作系统、128位SSL加密、24位色彩、20M宽带网络等，探讨日常经常接触的名词和蕴含的技术;③游戏。开展游戏，进一步熟悉计算机的计数制，借鉴不插电的计算机科学中的读心术纸牌游戏;④讨论。利用所学知识解决问题，如：既然计算机中所有信息均以0和1的形式表示，那么只要能表示两种数值的硬件设备均可以存储信息，计算机中二进制数是以怎样不同形式存储的？通过以上环节，使学生不仅掌握计算机常用的4种计数制及其相互转换方法，还能理解计算机是如何处理和存储信息的。　　（2）非数值型数据在计算机中的编码。共有4个环节：①回顾教学内容，字符、图像等非数值型数据在计算机中的编码方法;②实际应用。由于实用的编码系统，如ASCII、Unicode、汉字编码较复杂，令学生望而生畏，所以首先引入一个自定义的小编码系统，如拼音编码系统，给出编码规则，让学生对特定序列进行编解码，以理解编码系统原理。随后引出ASCII、Unicode及汉字编码，通过提问检测学生课前学习效果;③讨论。学生在理解编解码原理后，可以尝试设计编码系统，并展开讨论，如：计算机通过调制解调器上网时，信息是如何编码并通过电话线传送的？④引申。计算机如何用二进制表示图像。首先，通过实例引入像素概念，用1和0表示简单的黑白图像，并结合喷墨打印机原理扩展到彩色图像的表示。该环节预期达到的效果是使学生掌握字符、图像等非数值型数据在计算机中的编码方法，理解ASCII、Unicode和漢字编码系统的基本原理，能设计编码系统，解释一些应用原理，如调制解调器上网传输信息的原理及喷墨打印机原理。　　（3）数据校验编码。共有3个环节：①回顾教学内容，如常用的数据校验技术，特别是奇偶校验技术。首先提出简单直观的问题，检测学生课前学习效果，如：对给定的实例给出奇校验或偶校验结果。随后提出较深入问题，如为什么需要数据校验编码，包括CD数据校验、硬盘数据校验，以及网络传输数据校验;②实际应用，列举日常生活中的校验技术，如商品条形码、图书的ISBN（国际标准书号）;③游戏。通过游戏，更好地理解校验编码，如开展不插电的计算机科学中设计的翻卡魔术。该环节预期达到的效果是使学生不仅掌握常用数据校验技术，还能体会数据校验技术在实际生活中的广泛应用，提高学习兴趣。　　4 实践结果　　本文利用雨课堂工具的投票功能，对学生开展了关于翻转课堂的问卷调查。通过投票结果统计可知，73%的学生喜欢翻转课堂教学方式，认为能调动学习积极性;85%的学生希望课堂知识讲授可与实际相联系，而不是讲解知识本身;76%的学生认为翻转课堂与传统课程相比，学习效果更好，对知识的理解和记忆更深刻，说明学生对翻转课堂的认可度较高。　　但是仅62%的学生在参加课堂教学前，完成了对应章节MOOC视频的学习， 说明学生还需要进一步转变学习观念和学习习惯，学会合理安排时间，课前按时完成自学。只有30%的学生喜欢小组展示的方式，23%的学生喜欢学生分组讨论的方式，说明学生从多年被动学习模式向以以学生为中心、学生积极参与讨论互动与自我展示的转变，需要假以时日，得到逐步培养和锻炼。　　5 结语　　本文基于自主建设的大学计算机基础MOOC课程，开展线上线下相结合的混合式教学，设计了翻转课堂实施方案和组织形式，围绕课程重难点内容，设计了翻转课堂教学内容，开展包括内容回顾与提问、实际应用、游戏和讨论4个环节的教学活动，通过翻转课堂教学实践，取得了较好的教学效果，也发现教学环节中的一些不足，下一步研究内容是如何提高学生参与积极性。"}
