{"title": "开放式任务驱动的计算机基础教学模式探索", "url": "https://www.lunwendata.com/thesis/2019/156565.html", "time": ["2019-02-25"], "info": "　　中图分类号：G642.0 文献标识码：A 文章编号：1009-3044（2018）12-0152-02　　在目前信息化高速发展的时代，计算机文化已全面渗透于我们的日常生活，计算机基础技术已成为大学生必备的技能之一。在我国，传统的计算机基础教学中教师讲授、灌输式的教育模式已饱受争议和批评。最近，不少学者提出“以学生为主体、教师为主导”的教育理念，让学生“学会学习”，已成为大学教育方法的主导趋势[1-2]。在培养创新性应用型人才的需求下，学习是实现“自我价值”的需要，特别在大学教育中，更加注重学生对知识自主探索、自主学习和应用能力的培养[3]。其中，“任务驱动”是一种以富有趣味性，能激发学生学习动机与好奇心的情景为基础、与教学内容紧密结合任务为载体，让学生通过完成某项任务获取知识与技能的一种开放式、探究式教学模式[4-5]。该教学方法完全体现了以任务为明线、以提高学生知识掌握与技能应用为暗线的基本特征。本文在我校“新产业”大学创新性应用型人才的培养需求下，以非计算机专业的计算机基础课程教学为例，以学生为主体驱动，教师辅助协同，提出开放式任务驱动的教学模式探索。　　1 计算机基础课程教学现状　　计算机基础课程旨在培养学生使用计算机搜索数据、处理数据的能力，为以后使用计算机解决本专业的问题打下坚实的基础，对毕业后能迅速适应岗位需要、在工作岗位上具有可持续发展的再学习能力，具有重要作用。在计算机技术高速发展时代，计算机基础课程教学也遇到不少挑战。其中不少基础课老师反映“不知道如何教”，而学生在课堂上差强人意，认真听课并能与教师互动的比率不到70%。随着智能信息时代的推进，这种现象表现越来越明显。通过调查分析，主要原因体现在以下?赘龇矫妫?　　1） 学生普遍对课程重视不够　　计算机基础课程作为大学非计算机专业的通识课程，针对大学一年级学生开设。这类学生刚从高考紧张学习环境中解脱出来，心里或多或少呈现出的膨胀状态。计算机基础作为公共基础课，其课程内容一般独立于某个专业应用领域的知识，因此学生普遍表出现学习的兴趣度不高，课堂上表现懒散。　　2） 学生分析和解决问题的能力薄弱　　大学一年级学生刚从高中应考式教育中脱离出来，习惯被老师“牵”着走。在教学过程中，老师布置书本外练习，学生习惯性以“书本上找不到”为理由而懒于思考。目前，国内网络环境已逐步全面完善，利用手机等上网工具能时时刻刻从网上获取相关答案，但学生还普遍未充分利用信息手段去自主搜索知识，并加以分析而给出最佳答案。　　3） 教学内容难以跟上信息时代的发展　　目前的信息化时代正处于高速发展的阶段，计算机领域的知识也随着发生着日新月异的变化。现有计算机基础课程教材内容的版本更新，由于撰写和出版等各种因素，学生的教材内容往往滞后于最新的信息技术知识，从而影响教学效果和学生的学习兴趣。　　4） 教学考核形式单一化　　为适应信息化时代的发展，计算机基础课程的改革步伐也一直在进行中。传统的考核形式以期末考试成绩为主，平时表现为辅，难以真正体现出学生的学习成效。部分基础较好的学生，平时上课应付任务，考试前临时抱佛脚就能通过考试，而部分学习认真的学生却需要在考前花大把精力准备，从而严重影响学生的学习积极性。　　2 开放式任务驱动的教学模式设计　　传统的计算机基础课程教学主要是教师在课堂上PPT讲授、课后练习题辅助为主，学生按部就班地完成教师的操作，无法培养自主学习的能力。另外，计算机基础课程主要针对大学一年级学生，如果让学生完成独立自主完成教师布置的任务，从设计到制作、讲授PPT等步骤，可能会由于无法完成任务而导致失去学习兴趣。因此本文提出对计算机基础课程的课堂外大作业入手进行探讨，提出以学生为主体驱动、教师辅助协同的开放式任务驱动教学模式，具体表现在以下几点：　　1） 以开放式作业取代传统的客观题和主观题　　传统的作业形式以客观题和主观题（简答题）为主，由于这类作业存在答案的绝对性、形式的单一性等问题，导致任课教师给出的评价形式单一，无法真正体现出学生的学习成效。因此，在信息化社会的大环境下，计算机基础练习的作业可以结合日常生活中计算机的应用进行作业布置。例如，在讲授计算机硬件系统知识阶段，可以根据应用需求让学生提出购买电脑的相关配置等。　　2） 以学生为主体，寻找问题，布置任务　　在信息时代高速发展的时代，计算机知识也在日新月异地翻新，任课教师无法完全掌握最新信息知识。因此，开放式任务驱动教学目的将传统的以教师希望学生掌握什么，转换为学生希望学到什么。根据任课教师设定的目标和范围，让学生主动去提出问题，激发学生的学习兴趣。　　3） 以学生为主体，分组讨论，查找分析问题答案　　开放式作业没有标准答案，只有最佳选择。通过开放任务的布置，让学生通过分组形式自主和协作学习，开拓思维，充分挖掘学生在不同层次方向的学习潜力。将传统局限于书本上翻寻答案，转换到利用多种信息化手段去寻找最佳选择方案，提高学生自主分析和解决问题的能力。　　4） 以学生为主体，结合任课教师建议对答案进行评价　　以分组的形式对答案进行讲解，让全班同学以自己的理解程度对答案进行评价。同时结合任课教师的意见，以学生对作业的完成程度、作业分析详细度、分析深度、对问题思考的角度、对问题思考的扩展程度等进行多元化的评价，真正地客观、公正体现出每位学生的课堂学习成效。   　　为了使开放式任务驱动的教学模式能够更有效地实施，从总体上应注意以下几个方面问题：　　1） 开放式作业布置需系统、科学　　教师在明确开放式驱动教学的目标和基础要求基础上，需系统、科学布置开放式任务，制定开放性、可操作性和适应性的任务，既不能难度太高，导致失去学习积极性；也不能过分降低难度标准，让学生难以发挥其水平。　　2） 任务分组需合理　　在布置开放式作业后，学生以自主分组的形式完成任务。在分组过程中，教师需要考虑每位学生的能力特点进行分组结合，使其能够保?C学习的有序进行，充分调动小组成员的积极性，发挥其个人能力。　　3） 任课教师要不断提高自身专业素质　　在开放式任务为导向的教学模式中，任课教师的角色相对于传统的教学发生了不少变化，并且提出了更高的要求。任务教师需通过不断的学习，提高自身素质和专业水平，保证任务的设计因材施教，难易程度适中，真正地做到激发学生的学习兴趣，培养学生的自主学习能力。　　3 开放式任务驱动的教学模式实施效果　　本次选取我校2017级力学班学生（45人）作为开放式任务驱动教学模式的实施对象，并将其与未开展任务驱动教学的2016级力学班（45人）进行对比分析，具体从出勤率、课堂表现、作业练习和期末成绩的平均值进行比较，结果如图1所示。从图中可看出，2017级力学班的学生表现都优于2016班力学班学生，尤其是在课堂表现方面，认真听课率达到85%以上。从各项数据的对比说明，学生为主体驱动、教师辅助协同开放式任务驱动教学模式能充分发挥了学生的主体地位，激发学生的学习兴趣，培养学生的自主学习能力。　　4 结论　　传统计算机基础教学以教师讲授为主、学生被动接受的方式已影响到学生的课程学习成效，因此本文在计算机公共基础课程改革中提出学生为主体驱动、教师辅助协同的开放式任务驱动教学模式。以布置开放式任务为出发点，让学生主动“我要学”，分组协作，自主完成学习任务。从教学模式的实施效果来看，开放式任务驱动的教学模式不仅有效地激发学生的学习兴趣，培养其自主学习能力，还提高学生的计算机水平能力。在后续的教学过程中，我们将对该模式继续探讨，结合学生的专业特点制定更符合学生能力培养的教学模式，不断补充和完善。"}
