{"title": "浅析计算机技术在高校教务管理的应用与设计", "url": "https://www.lunwendata.com/thesis/2019/154595.html", "time": ["2019-02-04"], "info": "　　0 前言　　现如今，我国高等教育取得了较大的发展，招生人数不断增加，办学规模也日渐扩大，这就导致教务管理的数据与日俱增。基于此，传统的办公软件已经难以适应高强度数据处理的需求。为此，需要在高校教育管理中融入计算机技术，这样能够提高管理人员的工作效率 ，从而使高校的教务管理工作变得更加的规范、有序。下文主要围绕高校教务管理，就计算机技术在其中的应用进行探究。　　1 在高校教育管理中，应用计算机技术的主要意义　　作为一个教育单位，学校有着以下几方面的特点，（1）行政工作较为繁重、（2）情报资料较为集中、（3）人员庞杂等。由于高校教务管理工作包含着各方面的信息数据资料，而以往的管理方式很难帮助高校教务管理部门去处理庞大的信息数据。但是，如果将计算机技术应用到其中，就能够极大便利了高校教务管理工作的开展。　　1.1 能够减轻工作人员的工作量　　高校教务管理包括以下几方面的工作，（1）教学资源、（2）教学计划、（3）课表安排、（4）学生信息资料、（5）考试考评等等，这些管理工作涉及到学校日常管理工作中的方方面面，所以就导致教务管理工作者的任务较为繁重。此外，我国许多高校没有单独设立管理人员，这就导致一些教务管理工作者一方面要完成教务管理工作，另一方面还需要完成其他的行政工作。这样一来，就加大了他们的工作压力，导致他们很难去调配自己的精力与时间。但是，将计算机技术运用其中，能够节约大量的人力与物力，能够减轻他们的工作压力，并且计算机的准确率极高，所以能够提高他们的工作效率。　　1.2 能够使资料管理变得更加的规范　　计算机具有以下几方面的优点，（1）存储量较大、（2）运算速度较快、（3）信息的分类以及检索能力较强。这些优点就极大的方便了教务管理中的各项资料的存储，不但便利了管理人员的信息查询，还能够节省人力与时间[1]。此外，在高校教务管理中，计算机信息管理系统能够使其管理变得更加的科学、规范，例如，在学生信息管理系统中，就会按照相应的模板或者格式来进行信息录入，这样就有助于教务人员后期工作的开展。　　1.3 能够使高校与其他学区的联系得到进一步的增强　　在高校教务管理中，应用计算机技术能够将学校各教学单位与教职工有机的联系起来，进而构建成一个近距离的管理通道系统。如此，就可以向每一个学生转达各教学单位的情况，从而实现对教学计划的有效监督。此外，这样也有助于高校本部与其他学区能够对以下几方面数据进行共享，（1）学生信息、（2）成绩管理、（3）教学安排等，从而提高了工作人员的办事效率[2]。　　2 在高校教务管理中，计算机技术的应用措施　　2.1 要加强对教育管理网络系统的研发　　要想促使教务管理工作的更好开展，需要运用先进的教务管理软件。在高校的官网网站上，还需要建立单独的子网站，并且要将这个子网站与学校的二级学院链接在一起，以构成一个完整的系统。在管理系统中的用户登录方面，不但要实现在本校官网内部的浏览与查询，还需要实现在其他地方的互联网上能够查询相关的信息。如此，就能够促使教务管理的工作效力得到较大的提升。　　2.2 要提高教务管理人员的计算机水平　　要想更好的发挥教务管理信息系统的作用，就需要管理人员具备专业的计算机水平，要能够对管理系统的操作非常的熟练。这样一来，就能够更好的开展教务管理工作。为此，在今后的发展过程中，高校需要建立一支专业能力较强的教务管理队伍，要定期对管理人员进行培训，使他们能够更好的适应教务管理工作的开展。　　2.3 创造一个较好的计算机硬件环境　　在高校教务管理现代化建设的过程中，良好的计算机硬件环境是其中的关键，因此需要教务管理部门加大资金投入。首先，学校需要淘汰一些陈旧、落后的电脑，要为工作人员配置相应的电脑，这样才能够让工作人员去进行数据处理。与此同时，还需要配备一些附属产品，如扫描仪以及打印机等办公软件[3]。其次，高校需要加强信息网络的建设，要实现教务管理网络系统与相关数据库的网络一体化，如此一来，便能够使网络中的资源数据实现共享。　　3 计算机技术在教务管理中的设计　　3.1 设计要求　　3.1.1 架构要科学合理　　在对教务管理系统进行设计时，需要根据高校的教务管理工作的事情情况去进行设计，不仅要满足教务管理的需求，还需要将教育理念融入其中，以保证教务管理软件的实用性。　　3.1.2 功能要完整　　在设计过程中，要确保教务管理系统软件能够涵盖教务管理工作的所有环节，不仅能够对教务管理工作中的各单项工作进行分开处理，还能够将各部分整合成一个整体。此外，不仅能够满足教务管理工作中的常规性事务管理，还能够对一些特殊的情况作出应对处理。　　3.1.3 确保数据的安全　　在教务管理系统软件开发时，要确保数据的安全，要保证系统的数据处于保护范围之内，各子系统根据自己的权限去读取数据或者是改动数据。与此同时，要防止受到外界黑客的攻击。　　3.1.4 定期更新版本　　在设计上，教务管理系统软件需要与时俱进，要根据教务管理的需求变化进行变化，要采用更新包技术，定期对版本进行更新，以便推动教务管理工作的开展。　　3.2 业务逻辑结构　　在高校教务管理系统软件的开发中，可以采用多层软件结构，如下文所示：　　3.2.1 数据表现层　　它是系统与用户的接口，主要是通过I/O控制，提供报表、页面以及文件表现，并能够提供以下几方面的服务功能，（1）报表服务、（2）窗体服务、（3）文件服务等。数据表现层使数据的采集以及呈现成?榱丝赡埽?用户可以通过它向系统提供自己的需求，然后系统将最终的结果呈现给用户。　　3.2.2 业务逻辑层　　它属于运算中枢，提供以下几方面的服务，（1）身份认证、（2）访问控制、（3）权限管理、（4）数据查询等。业务逻辑层主要提供运算和控制的功能，数据表现层先将用户的需求提供给业务逻辑层，然后业务逻辑层就会以相关的算法为依据，向数据存储提出要求，最后将结果返还给数据表现层，那么用户就能够获得自己所需要知道的信息[4]。　　3.2.3 数据存储层　　数据存储层采用大型数据库技术，在对系统的各类数据进行存储时，数据存储层采用了最优化的方式，与此同时，还设计了备份的数据库，以促使系统数据的安全得到保证。　　4 结语　　综上，随着计算机技术在高校教务管理工作中的应用，势必会提高教务管理人员的工作效率，能够推动高校教务管理工作的开展。为此，在今后的发展过程中，高校需要提高管理人员的计算机水平，要为管理人员提供一个良好的计算机软硬件环境。此外，高校教务管理部门需要与时俱进，要定期更新教务管理系统，以提升高校的教务管理水平。"}
