{"title": "高校计算机管理系统的安全问题与防控对策", "url": "https://www.lunwendata.com/thesis/2019/157965.html", "time": ["2019-03-11"], "info": "　　信息化、网络化作为21世纪的时代特征，实已深刻改变了人们生活、学习、工作的模式，引发了社会深刻的变革，其对于高等教育的影响同样难以言喻，成为高校教学、科研、行政办公、学生学习的重要工具和载体。对此，在《国务院关于加快发展现代职业教育的决定》中指出：“提高信息化水平。构建利用信息化手段扩大优质教育资源覆盖面的有效机制，推进职业教育资源跨区域、跨行业共建共享，逐步实现所有专业的优质数字教育资源全覆盖。”由此可见，推进高校信息化建设，是高校进行教学改革的形势所需、发展所求。然不能忽略的是，计算机管理系统具备开放性、共享性、互联性的特点，使其在运行的过程中难免受到攻击和安全威胁。因此，找出威胁高校计算机管理系统的安全问题，并提出卓有成效的防控对策，显得极为重要。　　一、高校计算机管理系统存在的安全问题　　（一）用户多、规模大、网速快，为病毒传播提供便捷通道　　高校的扩招使越来越多的学子进入大学校园学习，进入大学深造，计算机实已成为必备品，对此，为改善高校网络运行的速度，在主干网络一般采用千兆甚至万兆互联，甚至包括无线、4G网络等等，大大加大了网络运行的速度。但是，由于高校一般采用宿舍管理制度，宿舍一般是4-8人的规格，形成一个规模庞大的局域网，一旦发生病毒安全问题，会以迅雷不及掩耳之势蔓延和传播，增加了计算机管理系统的难度。　　（二）网络的开放性给外部攻击可乘之机　　开放性是大学的基本特征，计算机系统也不例外，不能有过多的限制，否则将导致出现“信息孤岛”的情形。在开展高校教学和科研活动的过程中，计算机管理网络必须以开放性为原则，才能推进高校的改革发展。然正是由于高校网络的开放性，高校师生又是网络世界中最为活跃的用户群体，在其不断浏览外部网站和信息时，给外部网络攻击的可能性徒增，近年来发生在高校的网络攻击事件可见一斑。　　（三）高校网民的网络安全意识薄弱　　正所谓：“网络安全，预防为主。”是否具备网络安全意识，并在日常的上网过程中进行防范，是保证计算机管理系统安全性的重要保证。然对于高校师生而言，网络安全意识极为薄弱，在其看来，假使计算机受到攻击乃至系统瘫痪，重装计算机系统就行了。对此，浏览一些不健康、非法、黄色的网站成为部分大学生的“日常动作”，这些行为的存在，加剧了高校计算机管理网络的风险，使高校计算机管理系统处于高风险的状态之下。　　（四）高校网络安全资金投入的“缺位”　　高校计算机管理系统作为高校开展教学、科研、行政工作的重要载体，其对于高校改革发展的效能是显而易见的。随着计算机网络的升级换代，高校计算机管理网络必须加大投入，在软件和硬件上实现更新，方能保证系统运行的安全。但实际上，高校在这方面的资金投入是有限的，尤其在管理和维护人员方面的投入不足，弱化了计算机管理系统的作用，更加大了计算机系统被入侵的几率。　　二、实现高校计算机管理系统安全的防控对策　　（一）规避开放性短板，实施访问控制　　实施访问控制是高校计算机管理系统免受攻击性、病毒侵染的核心环节，其主要落脚点在于保证网络资源不被非法使用。对高校计算机管理系统实施访问控制之后，高校内部的一些资源的访问将被限制，与外部网络的信息对接也将被限制，其优势在于，过滤了非法网站内容，保证大学生网络的“绿色”。从技术层面而言，访问控制分为入网访问控制、网络权限控制、网络服务器安全控制、网络端口安全控制和网络接口安全控制等几个方面，通过有选择性的在入网访问、网络权限等方面的控制，可以有序地规避高校计算机管理系统的开放性、共享性、互联性的短板，给大学生创造一片绿色的网络天空，并最大限度地保证高校计算机管理系统的安全性。　　（二）强化安全意识，加强制度建设　　针对高校内部人员网络安全意识薄弱的问题，必须强化教育，让其知晓网络安全问题对高校计算机管理系统的危害性，制定相应的制度，明确网络用户使用的规章制度。此外，提高高校网络管理人员的技术水准，高校网络由于具有庞大的分支机构和学生信息系统，使得管理和维护更加复杂和困难，这就要求网络技术人员必须具有专业的技术水平和系统的网络规划知识，在网络构建中减少不必要的线路体系和加强分层管理。　　（三）加大资金投入，打造全方位安全系统　　计算机系统更新日新月异，病毒入侵和病毒防范如同矛和盾一样，必须在病毒不断变种的情形下加强。对此，必须加大资金投入，建立一个集入侵检测系统、安全漏洞扫描、防火墙系统和防病毒系统于一体的多层次、全方位的网络安全防护体系才能有效的防护网络安全。在建立了这种多层防护的安全体系以后，即使网络中的入侵检测系统失效，防火墙、安全漏洞扫描和防病毒软件还会起作用。　　三、结语　　总之，高校计算机管理系统的安全运行是保证高校各项工作顺利开展的重要基础，必须认清影响高校计算机管理系统安全运行的安全问题，并在技术上、安全意识培养上、资金投入上加大力度，最终建设一个安全、可信的教育和科研网络环境，为保证高校又好又快发展保驾护航。"}
