{"title": "关于中职计算机专业教学改革的几点思考", "url": "https://www.lunwendata.com/thesis/2019/156027.html", "time": ["2019-02-19"], "info": "　　中图分类号：TP393 文献标识码：A 文章编号：1009-3044（2016）32-0102-02　　1 引言　　现代信息技术和网络高速发展的今天，各行各业都已离不开计算机。这也给中职计算机专业的发展带来机遇，但中职计算机教学的发展既要适应科技的发展和社会的需要，又要顾及中职学生的自身素质，还要与其他科做好整合，因此计算机的改革势在必行。　　2中职校计算机专业教学的现状　　目前中职学校的教育依然延续普通高中的教学模式。因为大多数中职学生文化课基础较差，所以，学习基础课占用了他们大量的时间，而学习专业课程时就显得力不从心。部分中职学生通过几年的学习，文化课没有获得多少提高，技能课也荒废掉了，既没有捡到芝麻，也没有捞到西瓜。因此专业课和文化课难以统筹，这也是目前中职计算机专业教学中遇到困惑的原因之一。　　许多在中职校的计算机老师没有仔细研究和比较过本专业与其它专业的异同之处，没有分析过当前中职学生的学情特点，上课时老师口若悬河，而学生却在下面睡倒一片。许多老师也花费很大的力气去备课，而教学效果却不近人意。时间一长，老师们就开始埋怨学生的素质低、底子差，学生也开始抱怨老师的教学水平不行。影响了学生的学习热情，造成师生关系的紧张。　　目前信息技术的更新日新月异，新概念、新技术也不断涌现，而大多数的计算机老师是靠吃老本（在大学里学到的知识），他们对本专业的培训重视不足，缺乏和外界同行之间的交流，不了解当前计算机行业的行情，因此缺乏新的知识和技能，很难培养出企业所需的人才。　　目前计算机专业学生的实训，也存在众多的问题。例如，有些中职学校没有配备专门的实训指导教师师、没有和实训教学配套的教材、没有对应的教学计划和实训考核机制等。因为计算机专业课实践性强，如果没有通过动手操作、实际训练，学生是不可能真正理解和掌握的。　　3 关于中职计算机专业教学改革的几点思考　　3.1 中职教育的方向改革　　中职教育有两个方向，即：可以参加对口高考也可以面向就业，目前对口单招是对中职开辟的一条学历教育提高的途径学生可以上大专、上本科，理论和技能学习成绩好的同学可以参加单招，因为普通高中有许多可借鉴的部分，所以就不再累述。根据中职学生的学情分析，大部分同学还是在理论方面较弱，而动手方面较强，所以有大部分同学还是要面向就业的，并且有许多要改革的空间。因此我们就来讨论就业这一块。　　3.2 中职校计算机专业教学内容改革　　3.2.1 教学目标改革　　根据计算机的发展趋势来看，计算机正朝着“网络化、多媒体化、智能化方向发展”，因此就目前计算机行业来看网络建设与维护、计算机组装与维修、图片的制作处理、网页制作等中级计算机人才比较看好。因此，中职计算机专业应适应社会的需求，更应该注重学生个性的培养，教学目标可以确定以下几个方向：　　（1）计算机网络：以熟练掌握计算机网络操作系统为主，掌握网络构建与维护，培养网络管理员。　　（2）图形图像处理：以熟练掌握图形图像处理软件为主，培养从事平面设计、图形图像技术员。　　（3）计算机组装与维修：熟练掌握计算机硬件为主，培养组装与维修技术员。　　（4）网页制作：设置Dreamweaver、JavaScript、access为主的课程，培养网站设计的网站制作员。　　3.2.2 课程设置的改革　　中职计算机专业的课程主要由文化课和专业课构成，我们的学生是面向就业的，最主要的是掌握一技之长，在他们毕业之时，要学到一定的技术，为他们的就业打下基础。　　文化课包括语文数学和外语，这个不多说，在专业课的设置上每个专业设置相应可操作的课程，比如以图片处理为例，本专业就学习图片制作处理相关的软件，比如开设PS、coledrew 3dmax立体图像设计软件等，大胆舍弃《组成原理》、《数据结构》、《汇编语言》等重理论，难理解的纯理论课程。这样学生就学的少而精，精而专。因为减少了其它专业课的学习，就有了时间上的保证。学生也会对专业课感兴趣，从而认真去学，三年下来，对图片的处理应该不成问题。这样的学生毕业后可立即适应市场的需求。　　3.2.3 教学方式的改革　　中职生的上述特点表明当前传统的教育教学方式并不适合他们。虽然当前也是理论和实践相结合，但是效果并不理想，仍需要进一步的改进。　　我们的课堂理论还是比较充足的，但是在实践方面做得并不尽善尽美，虽然实践的课程并不少。但是并没有达到目的。我们所缺少的是和社会上真实应用的相结合。在每一门课程的学习过程中，当基础的知识学完之后，最好再和企业相结合，给他们布置实际的任务。通过反复的实践和练习，达到掌握知识的目的。　　教材是学生学习的主要工具，也是获取知识的重要来源，选择合适的教材，能够增加学生学习的兴趣性和提高学习效率。因为地区的差异较大，个体对知识的掌握程度也有一定差异，因此，要根据实际选择教材。中等专业学校计算机专业课程的教材，要重实践和技能，同时注重理论与实践相结合。要根据学生的实际情况和市场对计算机专业人才需求来选择合适的教材。　　教师要为学生定制有效的任务帮助学生树立教学目标，根据实际的教学课程，对用何中方法达到确立的教学目标与学生交流沟通，这不仅使学生获得知识，还能增强动手实践能力。目前比较科学有效的方法是“任务驱动法”。学生是教学工作的主体，高效的教学组织形式，在整个教学过程中发挥着较大的作用。　　3.2.4 考核方法的改革　　以往的考核，单纯仅以考试的结果作为评价的依据，这虽然能反映出一些问题，但是不能全面真实的反映出学生的学习水平和实力，也不利于学生正确地认识自己。这就要求改变这种考核方式，综合学生全面的表现，结合整个期间的表现和考试结果，按相应的比例进行评价，才能体现出学生的综合素质，让老师才能够准确地对学生做出评价。　　网络教学在被广泛应用的同时，许多中等专业学校依旧将网络教学作为辅助教学。随着信息技术的不断发展，知识共享已经实现。教师应该在网络教学中运用多种教学策略，营造全新的教学环境来吸引学生的注意力，学生可以通过网络与老师交流心得，把信息反馈给老师。这样一举两得，有利于提高教学质量。"}
