{"title": "独立学院计算机网络课程教学改革的探索与研究", "url": "https://www.lunwendata.com/thesis/2019/155815.html", "time": ["2019-02-17"], "info": " 　　摘要：针对独立学院计算机网络课程教学体系中存在的问题，结合独立学院学生的特点，本文从课程教材的编写，实践教学改革及师资队伍建设等方面对独立学院计算机网络课程教学改革进行了探索和研究，提出了一系列建设性的改革思路。　　关键词：独立学院；计算机网络；教学改革　　中图分类号：TP393.092-4 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-02　　独立学院是我国高等教育从精英教育向大众教育转变的大形势下的产物，以培养适合地区发展的基础型、应用型复合人才为主。它的培养目标是高级应用型本科人才，所以在课程设置、实验环节上不仅要抓基础、抓理论，而且要重实、重应用。　　一、独立学院计算机网络课程教学的现状及存在的问题　　（一）独立学院学生的特点。对独立学院学生进行抽样调差，得出独立学院学生具有以下特点：第一，专业基础知识较差，数学、英语课程成绩较低，学习计算机基础课程比较困难，这就使得学生对理论知识的学习有了一定程度上的抵触情绪；第二,个人自制力较差，受学习难度、课程性质和个人情绪等方面的影响。第三，更倾向于应用性的活动。在独立学院中的学生，他们思维较为活跃，喜欢能动手、实践性强的课程。　　（二）教材选用不合适，教学内容过时。目前专门针对独立学院的教材基本还是空白，大多数独立学院选用的教材或者是一本、二本使用的教材，或者是技术专科院校选用的教材。这些教材对于独立学院学生来说，一种过于抽象，另一种过于简单。这样在教学过程中很难培养出符合市场需求的高级应用型人才。　　（三）实践环节薄弱。计算机网络实验教学是整个教学过程中一个重要的环节。而目前大多数高校教学中，计算机网络实验是以验证性实验为主，大多数实验课都依附于理论教学，缺乏系统的实验内容。不少学生对计算机网络理论知识的认识并不深刻，不能在实际应用中学以致用。计算机网络实验不能只是对理论知识的验证，它还有更重要的意义：通过网络实践操作，来培养学生的实际动手能力和综合应用能力以及创新能力。　　（四）教师队伍薄弱。计算机网络课程授课教师的综合素质还有待提高。目前大部分高校教师资源有限，教师任务重，长时间、超负荷地进行教学，没有时间更新自身的网络知识，使得师资队伍的综合素质偏低。计算机网络是一门应用性很强的学科，不能在技术上投入时间的教师是无法教出应用能力强的学生。　　二、独立学院计算机网络课程教学改革思路　　针对独立学院计算机网络课程教学的现状及存在的问题，结合独立学院高级应用型人才的培养目标，提出以下独立学院计算机网络课程教学改革思路。　　（一）编写适合独立学院的计算机网络教材。针对独立学院培养高级应用型人才的定位，以及独立学院学生自身的特点，编写适合独立学院计算机网络课程的相关教材。教材应该包括理论课教材和实践课教材。其中内容应该涵盖计算机网络基本原理与技能, 综合管理与应用技能，网络应用与工程设计。　　（二）加强实践教学。计算机网络技术是一门从实践中反映学习效果的学科，学生在实践过程中发现问题，解决问题从而积累经验。　　第一：将计算机网络实验课独立开课　　实验教学是理论教学的深化和补充，为了发挥实验教学的功能，达到实验教学目标，可以将计算机网络实验独立开课,独立考核。这样不仅可以让学生认识到实验课程的重要性，而且可以充分调动学生学习理论知识和参与实验的主动性和积极性。　　第二：充分利用实验环境，采用多模式教学　　传统实验教学是以各种实验设备为基础，学生对设备进行实际的操作。由于网络设备价格昂贵，实验经费需求大，从而造成实验室规模有限。在这种情况下，我们可以借助虚拟软件来扩充实验环境。在每台学生机上安装VMWare和BosonNetSim等虚拟软件，VMWare可以在同一台机器上模拟出多台计算机构成的局域网，Boson NetSim是Cisco路由器、交换机模拟程序，可以进行CCNA\\CCNP实验环境模拟。采用实物教学和模拟教学相结合的方式，在一定程度上弥补了实验设备欠缺的问题。　　（三）培养理论与实践并重的“双师型”教师队伍。计算机网络技术发展迅速，教师必须不断学习新技术，紧跟技术前沿。计算机网络课程授课教师除了要具备扎实的理论基础之外，还应具备较为丰富的网络工程实践经验。所以从事计算机网络教学的教师不但要具有专业技术职称，努力争取进修机会，提高其专业素质，同时还应积极主动到企业中更新知识，了解企业对毕业生知识、能力、素质的确切要求。学校应该鼓励教师去跟踪当前最新技术，与企业合作搞项目，使自身的综合素质和知识得到提高和更新。另外，学校也要引进实践能力强、理论基础好的网络工程师到校任课，聘请有丰富企业实践经验的教师担任课程教学或来校进行交流。　　（四）鼓励学生考取职业资格认证。考取网络职业资格认证可以提高学生专业素质和增强就业竞争力，但是目前认证考试种类繁多，教师必须帮助学生选择社会认可程度较高、有一定含金量的认证，例如中国计算机软件专业技术资格和水平考试――网络工程师、思科认证网络工程师等。根据采访已获得了网络工程师资格认证的学生，发现他们在这个过程中，收获了知识和自信，为今后就业增添了砝码。　　三、结论　　独立学院的教学质量直接关系到其人才培养目标的实现，对于独立学院的生存和发展具有重大意义。计算机网络课程教学的教师要勇于思考、积极探索、与时俱进、及时进行教学的改革，同时密切关注社会计算机网络人才岗位技能需求，使培养出来的学生的技能可以胜任社会工作岗位，提高学生的就业率。　　参考文献：　　[1]教育部2005年1号文件.关于进一步加强高等学校本科教学工作的若干意见　　[2]梁俊斌,将婵.独立学院中基于虚拟实验环境的计算机专业人才培养模式探索[J].广西教育学院学报,2011,1　　[3]胡声丹,陆慰民.独立学院《计算机网络》实验教学的实践与研究[J].福建电脑,2008(6)　　基金项目：重庆市高等教育教学改革项目（项目名称：重庆市西永保税区IT行业紧缺技能型人才培养模式研究；项目编号：113092）　　作者简介：牛朵朵（1982-），女，山西晋城人，硕士，重庆师范大学涉外商贸学院讲师，研究方向：计算机网络技术； "}
