{"title": "浅谈项目教学法在计算机公共基础课中的应用", "url": "https://www.lunwendata.com/thesis/2019/155833.html", "time": ["2019-02-17"], "info": " 　　摘要：计算机公共基础课程是高职学生必修的公共基础课，在计算机公共基础课教学的过程中采用项目教学法不仅能够体现出计算机公共基础课的教学特点，而且对培养学生熟练运用计算机能力和创新型高素质应用人才具有重要的作用，下面主要探讨项目教学法在计算机公共基础课中的应用。　　关键词：计算机公共基础课；项目教学法；应用　　中图分类号：TP311.52 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-02　　引言：随着科技的进步，计算机技术的发展，计算机在各个领域中已经成为必不可少的一项工具。计算机应用能力提高不仅是社会发展需要，也是今后工作的需要。计算机公共基础课程是高职院校中各个专业必修的一门基础课程，其教学目标主要是将学生培养成熟练使用计算机并能够运用计算机实现现代化的管理的人才。所以提高教学质量，提高学生的计算机应用能力是我们亟待解决的问题。　　一、项目教学法的重要性　　在高职院校中，计算机公共基础课程几乎是各个专业的一门必修课。但是由于课程比较多，有的院校计算机公共基础课每周只安排2个学时，在较少的课程下，学生虽然能够掌握一些基础的计算机应用，但是对学生来说，把计算机技术知识运用到实际的工作和学习中是有一定的困难的。由于目前很多职业院校中，教学方法依然是学生被动的接受知识，教师为主导地位，在这种教学模式下导致学生的主动能力和创造能力被遏制。项目教学是师生通过共同实施完整的教学项目而开展的一种教学互动[1]。项目教学法在职业院校计算机公共基础课程中的应用主要体现学生的主导地位，教师的任务主要是为学生获取知识创设各种情景，引导学生如何掌握知识，如何获取知识的教学活动。由此可见，项目教学法在计算公共基础课程中的应用对提高学生的综合素质，职业能力，提高教学质量是非常重要的。　　二、项目教学法的实施　　（一）教学项目的设计　　教学项目的设计并不是把传统的上机操作作为教学设计的项目，而是应该根据教学目标和教学内容，让学生完成项目并能够掌握更多的学习方法、知识和应用技能。在教学项目设计中教师首先应该设置实践性较强的问题情境，问题情景设计的目标是为了让学生通过提出问题、分析并解决问题，从而不断激发学生的思维能力和学习动机，同时还能够提高学生运用知识技能的能力。在项目教学中教师应该根据学生的需要，教学目标的需要结合社会的发展和实际的需要，培养学生的自学能力。比如在进行讲解计算机系统的组成时，在课堂上教师可以设置这样的问题情景：如果一个同学想要组装一台电脑，但是组装的电脑必须满足学习需要，请问在组装电脑中需要什么样的配件才能满足要求呢?[2]或者在进行讲解Excel时，可以设置这样的情景：如果你是某公司的财务总监，需要进行统计一下上个月的收入情况，如何运用Excel方便快捷并准确的完成呢？在教学的过程中通过设置一系列的贴近生活、结合实际的问题，这样不仅能够激发学生的学习兴趣，而且对培养学生解决问题能力具有重要的作用。　　（二）教学项目设计的层次性　　在计算机公共基础课程教学时，教师应该充分了解学生掌握知识的程度，在进行设计教学项目时，应该根据学生的特点和知识接受能力的不同设计不同的教学项目。在教学项目设计的过程中，对于接受知识能力差的学生，可以让他们按照教师的要求和指导重新做一遍；而对于具有一定操作技能的学生，可以设计一些扩展性的项目，教师提出一些具体要求，让学生在上机课中进行操作；而对于操作能力比较高的学生，可以设计一些创新型的项目，对于创新型的项目，让学生自选题目进行创作。在进行项目设计的过程中应该根据学生的知识水平和操作能力进行设计，并且在上机课中，教师还应该创造出相互学习、相互交流以及归纳总结等项目，这样对提高学生学习能力和操作能力具有非常重要的作用。　　（三）师生之间角色的互换　　在计算机公共基础课程中开展项目教学法主要是让学生自身完成项目，并进行探索学习，从而不断培养学生的创新能力和动手能力。项目教学法主要是建立在人本主义、建构主义以及综合认知主义的学习理论基础的一种教学方法。对培养学生的思考问题、分析问题、解决问题以及自学能力的培养具有重要的作用。项目教学法主要是以学生为主体，教师辅助学生完成项目。在计算机公共基础课程中开展项目教学首先应该进行角色互换，角色互换主要是教师从讲授知识、灌输知识转变为组织、指导学生学习，应该从讲台上讲解转变为和学生共同讨论研究、分析、共同学习[3]。学生也应该从被动接受知识的角色转变为主动学习。在教学的过程中通过精心设计教学项目，并根据项目不断提高学生计算机知识掌握能力和应用能力以及实际操作能力。对于一些实践性较强的课程，我们可以在实验室展开教学，从而做到理论和实际相结合，这样不仅能够提高学生的理论知识，而且提高学生的动手能力和实际操作能力具有重要的作用。　　（四）项目教学法的实施过程　　在计算机公共基础课程实施项目的过程中，一般主要是以设计小组的形式，首先应该明确每一个项目小组的要求和目标，然后划分小组成员，并进行选定小组组长，使每一个小组采取分工合作的方法。在项目实施的过程中，教师主要指导和协助学生的项目开展。如果学生在项目开展中遇到问题或者难题教师应该及时进行指导，在指导的过程中根据不同层次的学生采取不同的指导策略。这样才能促进学生的能力提高，比如在学生进行学习绘制表格的斜线表头时，一个学生在利用工具栏中“表格和边框”进行手动绘制，但是在绘制之后在进行插入行标题和列标题时，由于单元格大小的缘故，造成斜线不在对角线上，因此向老师请教，教师不是教他应该怎么制作，而是间接的进行提示指导，你可以换个角度进行思考，是否能够采取表格菜单进行解决问题呢，这位学生受到老师的提示后，很快就解决所遇到的难题。在项目教学法实施的过程中，教师在其中不仅要保证项目有效的开展，而且还要注意对学生的指导和启发[4]。　　（五）做好评价机制　　在计算机公共基础课程中实施项目教学法的过程中，项目实施的过程是学生自己探索研究的过程中，也是自主学习的过程。为了能够了解并及时掌握学生的学习情况，在项目完成后，其总结是非常重要的，通过总结不仅能够了解项目中存在的不足之处，而且对学生学习能力的提高程度、对学生之间的交流和沟通以及相互学习具有重要的作用。项目总结主要包括思路总结和技巧总结。思路总结主要探讨解决问题的思路，帮助学生进行分析所设置项目的最佳思路。从而能够认识到自己的不足；技巧总结主要进行分析解决问题的技巧，同一道题具有不同的解题技巧，然后和同学们讨论出最佳的阶梯技巧。这样不仅能够提高学生思考问题的能力，而且能够使学生掌握更多的操作技巧和解题方法[5]。通过总结也可以使教师了解到教学项目设计的效果、难易程度以及在实施的过程中存在的不足等，这样对今后开展项目教学法提供有力的根据。并且也能够使学生了解自身的不足和努力的方向，对提高计算机公共基础课程的教学质量，提高学生的学习能力和操作技巧有很大的帮助。　　三、总结　　综上所述，在计算机公共基础课程中开展项目教学法，不仅能够提高学生的理论知识水平和操作能力，而且在教师的指导和帮助下，对提高学生的解决问题的能力、创新能力也具有重要的作用。与此同时，教师也能够在项目教学的过程中不断提高自身的教学水平和教学质量。项目教学法在计算机公共基础课程中应用，能够让学习者运用理论知识和方法，对项目进行分析和实施，对提高学生的操作能力、实践能力和创造能力具有重要的作用。项目教学法重点在于培养学生的应用能力和实践能力，对培养实践能力强、创新能力高的人才具有重要的作用。　　参考文献：　　[1]金野.项目教学法在中职计算机基础课中的应用探索[J].读与写（教育教学刊）,2010,7(3):75　　[2]孟令臣,任悦辉.项目教学法在《计算机应用基础》课程中的应用[J].中国科技博览；2011(6):204　　[3]黄胜利.项目教学法在计算机应用基础课堂上的应用[J].河南农业,2011(4):18-22　　[4]韩鑫.项目教学法在计算机教学中的应用[J].金色年华(下),2010(10):174　　[5]张离乡.项目教学法在高职院校计算机应用技术教学中的应用[J].中国科技纵横,2011(19):397 "}
