{"title": "试论计算机视频教学在远程教育中的设计及前景", "url": "https://www.lunwendata.com/thesis/2019/155834.html", "time": ["2019-02-17"], "info": " 　　摘要：随着人类从工业社会进入信息社会，计算机视频教学以其直观、形象、不受时空限制等优势迅速发展，并被广泛应用于各层次、各学科的教育之中，但在实际运用中往往缺少适当的控制机制导致教学效果难以保证。本文从视频教学的优缺点出发，结合远程教育学生的特点，参照美国可汗学院的教学形式，提出计算机视频教学在远程教育中可控进度、可查看教学效果的初步设计方案，并对其将产生的前景进行展望。　　关键词：计算机；视频教学；远程教育；可汗学院；可控进度　　中图分类号：G642 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-02　　视频教学是将传统面对面的教学模式以计算机为主要手段做成视频，其内容是教师要传授给学生的知识（如传统的文化主流知识）、技能（如实验操作）等，以实现教学任务的传达。由于网络的便捷和普及，教学视频已不再局限于传统课堂，在网络上的流传也非常迅速，视频的制作人也不只限于学校教师，制作门槛也相对降低，如舞蹈教学、烹饪教学等。本文所指的计算机视频教学泛指在远程教育中用到的基于计算机软件开发的教学活动。　　一、计算机视频教学的发展背景和目标　　计算机视频教学发展的背景是：以计算机和互联网为代表的信息技术渗透到社会生活的各个方面，实现了各个领域的信息化，从而引起全面而深刻的社会变革，推动人类社会由工业社会迈向信息社会，同时，与之相适应的教育形态也由“模具制造――批量生产”的工业化教育到自主性、选择性和个性化的信息化教育转变。　　计算机视频教学的目标是帮助老师能够更加生动、形象地展现出在课堂上无法实际操作的内容，同时又真实地记录了教学内容，希望能一劳永逸地方便学习者能够随时随地反复学习。　　二、计算机视频教学优缺点　　计算机视频教学最大的优点是直观、形象、不受时空限制等，学生在学习观看的过程中，能激发起大脑中对原有或已学过知识的回顾和再现，并创造性地应用旧知识学习新知识，同时引起对新知识的兴趣、好奇、记忆和情感，从而产生主动学习的渴望。学生可随时随地让教师暂停或重复，而不会浪费教师时间，碰到问题可随时打开观看，厌倦了可快进或关闭，而不用老师一遍遍地问你：“理解了吗？”“听懂了吗？”这些尴尬问题。　　当然，远程视频教学的不足也较为明显，那就是不像传统课堂教学那样，学生都处于一个时空范围内进行面对面地实时交流，学生在学习过程中碰到问题得不到及时解答，教师与学生、学生与学生之间缺乏有效的沟通，学习氛围不浓，甚至会产生学习时的孤独感和无助感，也就是说远程视频教学会使学生产生较大的心理距离。　　这些缺点也是导致视频教学难以在传统全日制课堂中大规模使用的原因之一。全日制学校经过几千年的发展，依靠“反复训练，反复记忆”的方法和“粉笔+黑板+课本+练习本”的工具，已成为成熟度很高的固化教育系统，外力的冲击难以打破它的平衡，全新的教育模式难以插足基中。但在远程教育中不同，远程教育的学生本身就身兼家庭、工作、学习多种社会角色，很难频繁地在同一时间集中到固定的物理环境中进行集体面授辅导，而他们个性化、终身学习的意识又较强，这就使得视频教学在远程教育中具有很迫切的需求和较强的生命力。　　三、计算机视频教学在远程教育中的设计　　我们注意到，当学习者感受到被周围的人所认识、所关注，感受到被认可、被欣赏、被鼓励，甚至是来自同伴的压力或竞争，这种感受参与构成自己周边的学习氛围。　　针对以上这些问题，本文提出设计计算机视频教学两种模式：　　（一）多互动模式　　教师根据教学内容和远程教育学生的特点，选择适合教学要求的计算机应用软件，在制作视频时多增加互动内容，吸引学生多挤出时间学习。　　1.以计算机操作为主的内容，可使用应用软件如屏幕录像专家。该软件最大的特点是内容记录完整且师生都易操作。教师只要安装好屏幕录像专像，打开软件，屏幕上的所有操作都会被记录，并可同时记录声音，保存和上传也都方便；学生从网上下载后可脱机使用，而且不需安装任何插件即可播放。学生在观看此类视频时可边看演示边自己动手操作。于是，随意地让教师重复和暂停都变得非常简单，类似一对一的单独辅导也让学习变得更加重要。　　2.以理论知识为主的教学内容，利用Java软件设计自动生成问题的模式，学练结合，并且把练习嵌入到视频中去，不定时地在视频中出现练习题，如未及时完成练习，则视频将暂停甚至退出。设置小的函数，当做到某一步，奖励一枚勋章，及时地激励和反馈可让学习者重拾学习的成就感。　　另外，努力构建以学生为中心的学习环境，构建和谐平等的师生关系，在教学内容边上加备注，视频下面加教师的联系方式，开设留言版供大家讨论等等也可增加互动。学生查看或自己提出学习心得、困惑，可增进师生、生生间的交流，互相间的关注会拉近彼此的心理距离，有效激发学生的学习兴趣。　　（二）可控进度模式　　利用相关软件将知识点生成一个知识地图，帮学生做分析，让他们知道哪里已掌握，哪里薄弱，并用图表方式加以反馈。利用数据库记录学生对每个视频的播放时间和进度，记录每个问题的完整练习记录，学生和老师可以共同使用这个数据库。学生登录网站看视频、做题；老师作为“教练”在后台察看全班的数据。在显示数据时用色块代替单纯的数据，如用“蓝色”代表正在学习，“绿色”代表已经掌握的知识点，“红色”代表有问题。学生自己可直观地查看记录，教师参考该记录，可以容易地了解学生的学习情况，以便及时提供有效的指导，对普遍反映较难的知识点也可再次讲解或补充说明。　　学生根据自己的节奏学习，教师及时地参与或跟踪学习情况，这样的设计将对师生双方都产生一定的促进作用。　　四、计算机视频教学的发展前景　　在计算机视频教学的发展前景中，值得关注的是，在美国诞生了“可汗学院”。　　以下是摘自互动百科的报导：萨尔曼?可汗最初制作视频教学的目的是想帮助异地的表妹学习数学，他在自己的衣帽间用雅虎Yahoo电子画画笔记本录制视频，当其他的朋友也需要他的帮助时，他就开始把他的教授视频放在Youtube上面。他以“可汗学院”名义录制的视频已被浏览了2，400万次，如今已成为YouTube上最受欢迎的公开课视频系列。加州Los Altos学区的试验点已经将‘可汗学院’引入课堂。在这种反转式的教学体系下，学习模式倒了过来：学生们白天来学校写作业，遇到问题老师当场解答，晚上回家看视频。老师们通过软件监控学生们的学习状况。”　　可以说，在美国，很少有老师不知道“可汗学院”的。　　今年4月，《时代周刊》评出了2012年影响世界的百人榜，可汗位列第四，连比尔?盖茨也成了他的粉丝，可汗学院的影响力已远远超出当年的预期。　　近日，网易公开课正式对外推出了“可汗学院”课程。　　虽然这种教学模式难以在我国当前的教育实际中广泛应用，但它也说明了一个事实，即一个有思想、有组织、可控进度的计算机视频教学的生命力不容小觑，在远程教育中更加明显。　　一个能保持教学内容活力，体现人文关怀的计算机视频教学系统，在解放学生时间、空间的同时如还能有效地控制学生的学习进度、保证学习效果必会潜力巨大，影响深远，甚至会对整个社会的教育变革产生极大的促进作用。　　参考文献：　　[1]王奕标.信息技术何以未能有效变革教育的框架分析[J].教育学人大复印报刊资料,2012,5　　[2]王治文.论远程教育中的心理距离因素[J].中国远程教育,2005,12　　[3]中国远程教育网.http://www.cnycedu.com　　[4]互动百科.可汗学院.http://www.hudong.com "}
