{"title": "利用计算机网络,优化农村小学数学教学手段", "url": "https://www.lunwendata.com/thesis/2019/155121.html", "time": ["2019-02-09"], "info": "　　数学知识的抽象性与小学生认识规律的形象性造成了学生认识上的矛盾，特别是难点的突破、重点的处理、方式、方法问题直接影响学生掌握知识的程度。而现代信息技术手段的应用，网络技术、多媒体技术、现代化远教等教学手段的多管并用，对小学数学的教学内容教学目标及教学手段产生了重大影响，对学生兴趣与学习自觉性的培养得到进一步加强。只要能把准时机，辅助到“妙”处、“巧”处，便有事半功倍之功效。计算机网络的整合，教学手段的优化，可以大大提高农村小学数学教学质量。　　一、利用现代信息技术，让学生爱上计算　　计算教学的最大特点是其内容枯燥，缺乏情节性，而小学生的思维还处于具体形象阶段。学习者和学习内容之间的矛盾导致了计算教学中学生提不起兴趣，更谈不上乐趣。这样的学习是被动的，更是不深刻的。因此，提高小学数学计算教学的第一步，应是让学生爱上计算。　　（一）情景引入，激发兴趣　　教师在进行教学设计时，应“充分利用学生的生活经验，生活环境，知识背景，学生感兴趣的学习情境。”教学《两位数减两位数的退位减法》时，我创设了这样的问题情境：明明想买一盒巧克力，他带了50元上商场，商场里的巧克力各种各样，明明看中了价格是38元。根据以上的情境，你能提出什么样的数学问题？学生提出了“明明买巧克力后剩下多少钱？”以上的问题情境是多数学生比较熟悉的，他们乐意探究，都向明明买东西后剩多少钱，因而独立思考，积极探索算法。　　（二）形象比喻，深刻体会　　在计算机数学中。有时需要多一些难记忆的计算法则赋予形象的比喻，用学生感兴趣的，的易于理解的形式深刻体会它们。教学《两位数加整十数，一位数》时，有不少学生搞不清：有的把几个一加到十位上，有的把几个十加到个位上。这说明计算法则并没有在学生头脑总留下深刻影响。有何让这条计算法则变的形象，深刻起来呢？我是这样向学生讲述的：十位上的数好比爸爸妈妈，个位上的数呢，好比是兄弟姐妹。我们要尊敬长辈，让爸爸妈妈（几十个）坐在十位上，兄弟姐妹（几十个）坐在个位上。爸爸妈妈不在也不能抢他们的座位。这么形象的比喻，一下子拉近了学生与计算题目之间的距离。看到加整十数，学生会很激动地说要尊敬长辈，要和十位上的几个十相加；看到一位数，学生就说长辈没来得把位空着，兄弟姐妹都在个位上合几个一相加。多有意思是啊。巧妙的一个比喻，就让学生找到了计算的无限乐趣，在不经意中掌握了计算法则。　　（三）游戏比赛，快乐做题　　在计算数学中。设计有趣的练习，让学生感受到计算的乐趣。课堂练习设计得好，不仅能巩固新知识，发展学生思维，促进知能转化，而且可以增添学生的学习兴趣。因此教师在教学中要注意练习形式的多样化。计算内容趣味化和练习形式的多样化，激发学生参与计算练习的热情。　　二、利用远教资源丰富的课件，展示知识形成过程，突破教学重难点　　小学数学知识是抽象的，而小学生的思维又是以具体形象为主，数学知识的抽象概括性与学生思维的具体形象性之间的矛盾在客观上决定着小学生在数学学习中要依靠感性材料的支持，否则就难以实现对抽象数学知识的理解和掌握。新《数学课程标准》指出：“数学教学不仅要教给学生数学知识，而且还要揭示获取知识的思维过程。”同时特别强调要让学生经历知识的形成过程，即要让学生知其然，更要知其所以然。远程教育资源网为我们农村教师提供了丰富的课件资源，能形象直观地展示知识的形成过程，通过动与静的相互转化，使数学概念的形成、公式的推导、规律的揭示等都能清晰、形象地展示出来，不仅辅助了教师的教学更激发了学生积极主动地去体验知识的形成过程。　　特别是在教学过程中教师难以口头讲清楚的知识，学生难以理解的教学难点内容，都能从农远资源中下载课件或视屏，通过班班通进行图、文、声、象的演示，把知识的形成过程清晰地展示出来，变抽象为具体，化理性为感性，激活学生思维，促进学生理解，突破教学的重点与难点。例如探究圆面积公式时，在学生用学具动手探究交流后，我用下载的课件，动态演示将圆分成若干等份（分的份数越多，拼成的图形越接近），然后将它们分别拼成近似的长方形、平行四边形、三角形、梯形这些学生已经学过的图形，再探究这些拼成的图形与圆的关系，根据已学图形的面积公式找出求圆面积的方法，学生全面观察这种转化过程后，一方面加深了对圆面积公式推导过程的理解；另一方面又进一步丰富了学生的空间想象与思考，从而促进学生思维能力和解决问题能力的发展，突破了教学的重难点，这种教学效果是常规教学手段难以达到的。　　三、借助多媒体，辅助到“妙”处、“巧”处，激发学生的学习欲望　　（一）使定义清晰化　　在小学数学教学过程中，最令数学教师头痛的莫过于学生对于数学中出现的抽象的概念、定义不能真正理解和学会应用，而借助于多媒体技术就能很好地解决这一难题。例如：教学“同底等高的三角形的面积相等”这一定义时，若采用传统的教学方法，只能是让学生动手用尺子测量三角形的底和高的长度，而采用多媒体教学就能通过“闪烁”、“平移”等手段强调、刺激学生的注意，把两个三角形的底完全重合，两条高也完全重合，使学生在观察、思考中得出“同底等高的三角形的面积相等”这一定义，让学生借助具体事物的直观形象进行思维，从而建立清晰的数学概念和定义。　　（二）使空间形象化　　几何图形，特别是立体几何图形的教学，要帮助学生建立空间观念。而空间观念的形成，有赖于想象。例如：《圆柱体积公式的推导》，教材虽然提供了“割拼实验法”，但难以具体操作，很多学生对这一公式的推导持半信半疑的态度。运用3D Max制成的CAI课件，可以将一个圆柱体沿着它的高切割成16等份的扇形，再把这些扇形拼成一个近似的长方体，再切割成32等份的扇形，再拼成一个近似的长方体，随着等分份数的增加，把学生理解的难点--近似的长方体的长由曲线变成直线的过程呈现出来，从而为学生积累了丰富的感知材料，为大胆合理的想象提供了坚实的基础，有效地培养了学生的创新精神。　　（三）使导入适时化　　计算机多媒体辅助教学，图文声像并茂，形象直观生动，但必须注意适时导入，恰到好处，才能化平淡为神奇，获得最佳的教学效果。例如：在教学《长方体的表面积》时，如果上课伊始，教师就直接把长方体表面积展开之后是一个平面图形展示在屏幕上。那么，这就使计算机媒体过早地介入课堂，应让学生在充分感知、触摸，甚至动手拆开长方体、猜想之后，再让媒体进行演示论证，这样才是适时导入计算机多媒体进行辅助教学，把多媒体用在掌握知识的“刀刃”上，才能取得理想的教学效果。　　总之，优化数学教学手段的方法多种多样，我们每一位教师尽可能根据教学的需要发挥自己的特长。但作为农村教师来说，国家投入大量的人力和财力，为我们创设了工程浩大的远程教育资源网，我们就应该在日常教育教学工作中，充分使用这一资源，让其发挥最大的功效：丰富农村孩子的学习材料，改变农村孩子的学习方式和教师的教学方式，快捷有效地为农村孩子们传递数学信息和数学知识，充分使用现代化的教学手段，把抽象的数学知识化静为动，变小为大，降低数学难度，最大限度地帮助学生理解知识的形成过程，尽快提高?r村小学的数学教学质量。"}
