{"title": "浅谈中职计算机应用基础课程教学的探索", "url": "https://www.lunwendata.com/thesis/2019/156358.html", "time": ["2019-02-22"], "info": "　　中图分类号：G71 文献标识码：A 文章编号：1003-9082（2016）10-0142-01　　计算机应用基础是一门必要的公共基础课程，它既注重基础理论，又注重实际操作能力，直接影响学生的相关计算机课程的学习和操作。通过学习计算机应用基础能够使学生具备计算机的基础知识，并熟练掌握windowsXP、WIN7等操作系统、office、Internet等常用办公软件的使用方法，即达到考试大纲要求又为学习其它计算机相关课程奠定坚实的基础。　　我校是一所培养女性的摇篮，由于性别的单一性，学生素养等问题，计算机水平参差不齐，在以往教学过程中，教师常常遇到这种的感触：有一定计算机基础和在初中学习过计算机的学生感觉这门课不是很重要，更是浪费时间，学习的积极性较差；水平较低和没有计算机基础的学生对计算机课程很陌生，学习的过程中理解和掌握能力很慢。这是一项值得研究的难题：要保证正常的教学之外又要兼顾两类学生的学习把这门课学好完成教学任务。教师除了按照教学大纲制订教学目标和教学任务外，还要动脑筋想办法活跃课堂气氛，把比较沉闷的课堂变得生动让学生提起兴趣学习，创新上课方法理论结合实际做到让学生充分的做好操作练习熟练掌握操作方法。　　例如我校学前教育、旅游、美容专业的学生属于非计算机专业学生。他们在学习计算机应用基础课程的时候就遇到类似的问题，解决他们学习的困难在学期末要参加市计算机应用能力统一考试。在教学中既要练习统考的内容保障考试的通过率，又要在课堂中进行新授课的内容让学生掌握更多的计算机操作的基本知识和方法。中等职业教育具有职业性、实用性、技能性的特点，确保基础知识扎实稳固的同时，更加注重学生的实际动手能力和实践能力的培养，从而大大提高学生的就业竞争力。　　教学内容为计算机基础，windows xp操作系统，office办公软件等；内容多但是课时有限，想让学生学好这门课程，教学方法非常重要，要打破原来的一言堂模式，即教师讲解操作学生听讲，改为任务驱动式教学，让学生通过完成一个个具体的任务，掌握教学内容，达到学生自主学习为主，教师加以引导的一种教学方法。通过完成任务练习使学生能够较全面的掌握office办公软件及各类常用软件的使用，锻炼综合操作能力，为今后走向工作岗位从事计算机相关工作打下坚实的基础。　　首先，在教学过程中采用机房多媒体课件演示教学，将文字、图形、图像、视频、音频融为一体的多媒体教学课件（即优化教学场景），将桌面、窗口、菜单、图标、应用软件的使用，利用多媒体课件讲授完以后，再辅以真实操作环境下进行实际上机操作，这样既能够加深学生对知识点的理解，加强记忆掌握，又能在课堂讲授过程中，省掉板书时间，增大了与学生的双向交流、互动的环节，激发学生的探究兴趣和动手操作的欲望，引导学生进入最佳的学习状态，这样既达到了教学目的，又为学生指明了学习的方向，从而大大提高了学生的学习积极性和主动性。　　其次，采用边讲边练，既可以让学生掌握新知识进行实际操作练习，又能把知识掌握及巩固，让教师及时了解每一位学生的学习情况，随时调整对学生掌握新授内容的教学方法和环节，达到理想的教学效果。　　第三，在课堂上，学生对动态的、色彩丰富的事物比较感兴趣并不喜欢死板一言堂的教学，所以在打字练习中，初级阶段使用《金山打字》软件，这样，学生可以练习基础的字根，指法和键位同时在游戏中完成打字练习，提高打字技巧和速度。在熟练以后打字的练习中可以适当播放些轻松舒缓的音乐伴随学生进行练习，提高效率。　　第四，在学习演示文稿操作的内容中，学生要独立完成一个演示文稿的制作，并运用如文字、图片、声音、影音、动画等对象进行插入幻灯片，添加动画效果和超链接。可以让学生通过网络搜集素材，按照规定时间完成演示文稿的制作。在此过程中，教师给以学生想象和创造的空间，充分发挥学生的主体性，培养学生自主学习，自我提高以及独立解决问题和勇于探索的能力和精神。　　第五，新授课之前加上课前板块这一栏目，提高学生对课外知识的探究和学习，学生可以单独完成或者小组完成，搜集计算机相关的百科知识和现阶段最前沿和流行的计算机产品，即开阔了眼界又分享给其他的同学，从而获得双赢。　　第六，由于学生的计算机参差不齐，水平较好的学生往往认为课上所学的知识自己都已经会了，就开始怠慢对待上课，做一些与课堂无关的事情，针对这一现象，教师在教学中，可以充分发挥这部分学生的作用，为她们担当“小老师”的角色，辅佐教师帮助其它同学解决计算机操作的问题，使这些计算机能力较好的同学找到自我的价值，互帮互助，互教互学，营造一个的良好课堂氛围，有效地解决了由于学生计算机水平参差不齐造成考试成绩不理想的问题。　　教师不仅要教授学生计算机方面的操作技能，还要时刻注意对学生进行计算机使用的道德规范教育，如今网络很发达，要及时和学生讲解上网的规范性和遵守法律法规，有效地利用好计算机和网络，对计算机有日常维护和安全使用的意识和行为，把每一位学生都培养成为高素质的技能型人才。"}
