{"title": "商科院校计算机科学与技术专业网络工程课程教学改革探索", "url": "https://www.lunwendata.com/thesis/2019/154381.html", "time": ["2019-02-01"], "info": "　　0 引言　　湖南商学院是一所以经贸、管理等商科类专业为主，工、理、文等专业学科共同发展的商科类高等院校，这是由我校的办学历史，学科特色等因素决定的，在这样的背景下，我校计算机专业的培养方案不能照搬其它综合类高等院校计算机专业的培养方案，应该根据商科院校的特色，更加注重学生商科背景下的计算机应用能力的培养，才能使学生在就业时有更大的竞争优势。随着高等院校课程教学改革的不断深入，互联网+创新性人才培养的需要，如何更能体现“求创新，重实践”的实践教学改革思路，如何将课程的改革推向更深、更宽、更广的范围，切实提高学生的实际动手能力，是我们目前迫切需要解决的问题之一。　　计算机网络工程是计算机专业必修的一门课程，通过该课程的学习，使学生掌握网络工程的综合布线、交换机技术、路由器技术、网络安全技术、服务器技术等原理、配置方法与应用部署方式，根据湖南商学院计算机科学与技术专业2016版人才培养方案的介绍，计算机网络工程这门课程一共有2个学分，课时为32课时，其中理论课时16，实践课时16，先修课程为计算机组成原理，计算机网络原理等。　　1 湖南商学院计算机专业网络工程课程中存在的主要问题　　计算机网络工程这门课程重点介绍网络工程的基础，网络工程综合布线，交换机技术与应用，路由器技术与应用，网络安全技术与应用的原理及配置方法，我们在教学中存在的主要问题有：　　1.1 教学中以介绍主要的网络设备为主，而网络安全技术、服务器技术却介绍不足　　该门课程的理论课时为16，即每周2节课，讲授8周，课时主要安排给了交换机技术与应用中的交换机配置基础，交换机互连技术，交换机VLAN技术，交换机生成树技术。路由器技术与应用中的路由器配置基础，路由协议及其配置，三层交换技术，访问控制列表和网络地址转换技术。网络安全技术与服务器技术则安排了很少的课时进行讲授。　　1.2 网络工程的理论教学环节中实际的项目案例安排不足　　在网络工程的理论教学中，重点介绍设备的配置方法和应用，由于没有引入整体的网络工程项目案例，使学生在学习设备的配置时感到枯燥和繁琐，不能体会到设备能够在项目中实现互通的乐趣。　　1.3 针对网络工程课程的考核重点，过多强调的是理论环节的考核　　计算机网络工程的考核采用无纸化机试的考核方式，以理论考核为主，以实践考核为辅，这种考核方式的缺陷是缺乏对大型网络拓扑结构的配置和操作，使学生不能将理论知识转化为实践能力。　　2 网络工程课程教学改革探讨　　针对在计算机网络工程课程教学中存在的主要问题，我们提出以下几个解决问题的对策。　　2.1 理论教学中增加网络安全技术、服务器技术的教学内容　　针对理论教学中课时过多集中于交换机技术与路由器技术的问题，增加网络安全技术与服务器技术的内容，尤其是安全技术中的虚拟专用网VPN技术具有很强的实践应用价值。VPN技术是指将物理上分布在不同地点的局域网，通过公众网构建成一个逻辑上的专用网络，实现安全可靠，方便快捷的通信，VPN技术采用了加密、认证、存取控制、数据完整性等措施，相当于在各VPN设备间形成一些跨越INTERNET的虚拟通道、隧道，使得敏感信息只有预订的接收者才能读懂，实现信息的安全传输，使信息不被泄露、篡改和复制。目前VPN技术广泛应用于企业员工远程办公，企业内部各分支机构网络互连，以及B2B之间的安全访问服务，因此学习和掌握VPN技术十分重要。　　2.2 增加网络工程理论教学环节中项目案例的安排　　针对网络工程理论教学环节中项目案例安排不足的问题，增加实际案例的教学讲解。例如，每教授一个重点知识点，都配置一个实际网络工程的案例讲解，通过案例来理解理论，使学生能够真正做到灵活运用和融会贯通。　　2.3 加强网络工程的实践教学，将网络工程课程拆分为网络工程和网络工程实验两门课程　　计算机网络工程这门课程具有它的特殊性，应该重点强调实践环节，将网络工程课程拆分为网络工程和网络工程实验两门课程，考核方式均采取网上无纸化考核方式，理论测试以选择题、判断题和问答题为主，而实验的测试以网络工程的配置题为主，重点考核学生在面对网络工程的问题时的实际解决能力。配置题以交换机、路由器的配置为主，如交换机的VLAN划分，生成树协议，路由器的静态路由配置，RIP路由协议配置，OSPF路由协议配置，三层交换机静态路由配置，ACL访问控制列表配置，PPP协议配置，VPN配置等等。　　3 计算机网络工程课程教学改革的具体成效　　在理论教学过程中，通过网络工程配置案例教学，使学生掌握了网络设备的基本理论与基本配置，通过拆分网络工程课程，将网络工程分为网络工程和网络工程实验两门课程，加强网络设备的配置训练，让学生熟练掌握配置设备的理论和方法，为学生进行下一步的网络工程师的认证打下坚实的基础。　　在计算机网络工程实验的考核过程中，引入无纸化考试系统，学生在规定的时间内完成设备的配置才能合格，对学生的动手能力要求更高，使考核机制更加科学化和实用化。　　通过该课程理论与实践的结合，使学生在学习的过程中能够熟练地运用网络工程的理论方法来解决实际问题，教学效果有了很大程度的提升。　　4 结束语　　湖南商学院是一所商科类院校，因此，计算机科学与技术专业必然要与商科的特色结合起来才能得到发展，网络工程课程是课程教学改革中的一部分，在该门课程的教学中还有很多方面有待进一步的提高，下一步将探讨网络工程课程与企业进行合作教学的模式，即邀请企业的网络工程师来学校进行网络工程的专题讲座，定期派学生去企业进行网络工程项目的培训和参观，比如学院于2017年6月组织2014级学生参观长沙地铁1号、2号线的网络配置室与网络拓扑结构图，提高学生的实际动手能力，使学生的创新能力，实践能力方面有实质性的突破，真正培养出互联网+的复合型人才。"}
