{"title": "在计算机基础教学中培养创新能力", "url": "https://www.lunwendata.com/thesis/2019/155049.html", "time": ["2019-02-08"], "info": "　　在创新教育中，培养学生的创新意识和创新能力已经成为素质教育的重要特征。而在计算机 基础实施素质教育必须要从程结构、教学内容、教学方法、教学手段、师资建设、学科教学德育目标、学生能力素质培养、学生学习评估与教师评价等多方面作出整体性创新教学，才能提高教学效率和教学质量，提高学生素质，实现教育现代化。针对中职计算机基础教学存在的问题，从中职计算机基础教学的创新方面入手，全面加强和实施创新教学，从而培养中职学生的创新精神，使其成为具有创新意识和创新能力的高素质人才。　　一、计算机基础教学中存在的问题　　《计算机基础》是中职学生必修公共基础课程之一。随着计算机应用深入到社会的各个领域，它在人们工作、学习和社会生活的各个方面发挥着越来越重要的作用，但在培养中职学校素质教育中计算机基础教育存在不少的问题。　　（一）中职学校学生都是青少年，他们受计算机和互联网络的影响是比较大的。因此，通常他们对计算机都有很浓厚的兴趣，但是他们对于计算机基础教学中的理论知识并不是很感兴趣，而且教学大多是根据教师的理论讲述，结合学生上机实操。很多学生在对计算机基础理论知识和实操遇到麻烦时，都不会及时的寻找解决问题的答案，这样他们很难表现出学习计算机基础理论知识的热情和积极性，学生对计算机基础理论知识课普遍带有厌学的情绪。　　（二）对于中职学校的学生来说，他们的基础文化素质并不是很高，所掌握的计算机基础理论知识也相对较少。由于对中职学校的学生录取要求相对不高，所以部分学生在基础课方面会相对较差，缺乏主动学习的积极性。　　二、利用多种教学方法　　计算机基础实施素质教育必须要从课程结构、教学内容、教学方法、教学手段、师资建设、学科教学德育目标、学生能力素质培养、学生学习评估与教师评价等多方面作出整体性创新教学。而教学方法是为了实现教学目标，由教师组织引导学生学习活动所采取的方式和手段，从而在教学中提高教学质量和培养学生素质、创新能力的关键所在。　　（一）教师理论及演示法　　由于中职学校很好学生都是来自全国各地区的，学生的基础不同，理解能力和授受能力也不同，有此学生甚至在进入中职学校之前没有上过计算机课，因此在计算机基础教学中，不能完全用一般传统教学方法，必须结合学生自身情况。如果教师只是单纯的口头上的讲解，学生一定会觉得枯燥乏味，时间一长，很容易出现疲劳、注意力分散等现象。因此，教师可以利用学校的多媒体教室，现场讲解和演示计算机基础操作部分的内容，使各种操作具体化。这样不仅形象生动，学生还可以立即上机操作理解所学内容，达到较好的学习效果。　　（二）分层次教学法，培养学生创新能力　　中职计算机基础在创新能力的培养过程中，不同的学生会有不同的想法，而且学生的个性、知识基础以及学习潜质等方面也存在着一定的差异。有的学生抽象思维能力比较强、有的学生动手能力较强，这就体现出不同学生之间能力方面的差距，从而也会导致学生不能达到平衡发展的要求。因此，在中职计算机基础教学中，首先针对学生的具体情况，基础分层若干小组，每组都有基础好、一般和较弱的学生，基础好的学生带领基础较弱的学生一起学习。其次在分发学习任务时从易到难，每个小组根据自己小组的情况分配学习任务，从而达到较高的学习。评比也是按照学生的层次进行打分。在任务的驱动下，学生互帮互学，相互促进，即调动基础好的同学积极性，也使基础较弱的学生在合作学习体验成功。　　（三）驱动教学法，提高教学质量　　中职计算机应用基础是一门实操性很强、具有明显的时代发展性特点的课程。在教?W过程中根据教学内容的不同、专业不同和学生个体的差异，合理采用驱动教学法，缴发学生学习兴趣，从而达到教学质量效果。例如，在学生学习完演示文稿软件PowerPoint的基础操作后，完成一个PPT个人简历制作任务，要求简历分为封面和正文两部分，内容包括个人基本情况、家庭成员、学习经历、实习工作经历、荣誉与成就、家乡风貌、学习计划、职业规划等内容，教师可先以优秀作品演示让学生观看作为参考，学生可相互讨论，成完任务后要求学生展示并进行归纳总结，最后教师加以点评修正，让学感到学有所用，能够吸引学生的兴趣，积极主动地完成任务。　　三、在教学实践中培养学生的创新能力　　中职计算机基础理论课教师为了考察学生学习计算机基础理论知识的成绩，通常都是按照规定好的题目，根据学生的实践操作进行评分，这种做法是非常不利于学生创新能力的培养。计算机基础教学的目的就是要培养学生自主学习计算机技术的能力。在教学过程中，教师应当注重培养学生的创新能力。要求他们在老师的指导下，在规定的时间内去探索性的完成规定任务。　　四、结束语　　中职学校计算机应用基础是一门非计算机专业的理论和实践相结合的公共基础课程，如何合理的选择教材，根据专业特点选好教学内容，正确处理学时少与技能训练要求高的矛盾，关注学生的差异性，激发学生的学习兴趣和创新能力，提高教学效率和效果，是教师关注的重点。"}
