{"title": "企业电子商务中计算机安全技术应用效果", "url": "https://www.lunwendata.com/thesis/2019/157571.html", "time": ["2019-03-07"], "info": "　　1 概述　　基于网络资源的电子商务交易随着互联网的迅猛发展已经被大众所接受，虽然电子商务具有降低成本、增加贸易机会以及简化贸易流通过程从而有效提高生产力和改善物流和商品流环境的优势，但是由于其存在的安全问题遏制了其发展的速度。电子商务安全从整体上分为计算机网络安全和数据库安全两大部分，可以说，没有安全就没有电子商务，因此，网络信息安全性成了电子商务发展的关键。　　2 网络信息安全漏洞　　目前，人们面临众多的网络信息安全漏洞问题，比如，网络安全协议OpenSSL被曝光存在安全漏洞（被称为“心脏出血”）。由于该协议常用于电商、网银等安全要求极高的网站，用户访问了受此安全漏洞影响的网站，将无法采取任何自保措施，用户的银行账号、密码等数据将可能被黑客获取。　　根据发现漏洞安全的公司表示，由于占据全球2/3的服务器都适用于该协议从而才会导致这么大的漏洞影响。同时，许多受影响的人群也对这个协议和漏洞提出了疑问：OpenSSL到底存在什么样的安全漏洞？黑客是如何利用这一漏洞获取客户信息的以及用户该如何防范？　　OpenSSL作为一种为网络通信提供安全和数据完整性的安全协议，广泛应用于各大网银、在线支付以及门户网站等许多重要的网站。此次的“心脏出血”事件影响重大且短期内难以消除其威胁。　　根据某权威信息安全机构研究表明，在入侵检测和安防市场上，网络威胁和黑客攻击发挥了重要的作用。该机构表示，IT企业最亲睐的网络安全方法是入侵检测和系统预防。此外，根据全球入侵检测和网络环境的现状，他们也做出了相应的分析和预测报告，该报告认为：日益复杂化的网络威胁、政府施加的安全法规压力以及IT解决方案和服务支出的增加推动了IDS/IPS市场的发展。　　3 企业电子商务中计算机安全防护技术和措施　　3.1 加密技术 加密技术作为一种主动的信息安全防范措施，直接作用于数据本身，通过改变数据原本内容的形式达到安全防护的效果。其最大的特点就是即使由于各种问题泄露了数据，依然存在加密防护，只要算法不被破译，数据本身依然是安全的。随着加密技术和算法的不断进步，破译将变得越来越困难和得不偿失。　　3.2 认证技术 安全认证主要包括安全认证技术（数字摘要、数字信封、数字签名以及数字证书等）和安全认证机构两方面。电子商务认证中心作为签发数字证书并确定用户身份的服务机构，承担了网上安全交易的认证服务。　　3.3 安全认证协议 目前，在电子商务中广泛采用安全套接层SSL协议（服务于银行对企业或企业对企业的电子商务）和安全电子交易SET协议（位于应用层，且用来保证互联网上银行卡支付交易的安全性）。因此，SET是一种服务于持卡消费和网上购物的电子商务。　　3.4 虚拟专用网技术 虚拟专用网技术即VPN 技术，是一项新兴的网络技术，它的信息传输媒介为不可靠的公用联网络，重要信息的传输主要通过附加的安全隧道以及用户认证和访问控制技术，此项网络新兴技术的运用，可以创造一个更加安全的网络环境。　　3.5 制定电子商务安全管理制度 电子商务的安全管理制度是指用文字的形式规定的各项安全要求，这些制度应该包括保密制度、人员管理制度、跟踪审计制度、数据备份制度、系统维护制度以及病毒定期清理制度等六项制度。　　3.6 加强诚信体系建设 电子商务的交易抵赖和否认问题以及对个人隐私的破坏，归根到底还是个人的诚信问题，为了保证电子商务的良好发展，应能加强诚信体系的建设，创造良好的诚信环境。　　4 从数据入手解决不断变化的安全问题　　无论利用哪种手段和方案来应对这种威胁和入侵，数据本身安全才是守卫安全的底线。面临这种需求，采用灵活且具有针对性的加密软件进行防护才是最好的选择。　　从表象来看，网络安全问题多种多样，木马病毒、软件漏洞、黑客恶意攻击等，但究其根本，这些隐患的针对对象都是数据。因此只要把握住了本源数据的安全，无论是怎样的隐患威胁都不用太过担心。而要保证本源数据的安全，加密技术总是最有效的手段。　　加密直接作用于数据本身，在最坏的情况下，即使文件遭恶意攻击被窃取了，加密依然为数据起保护作用，在破解算法愈加难以实现的现在，可以有效保证被加密数据的安全。在加密基础上，国际先进的多模加密技术采用对称算法与非对称算法相结合的技术，在确保防护质量的同时，让用户自主选择多种加密模式，灵活且有针对性。安全安全问题的解决要以不变应万变，所谓万变，就是不断变化的网络安全问题，所谓“不变”就是从数据入手，采取数据加密等措施，在众多安全威胁面前，只要好好利用加密软件，构筑完整的数据防泄漏系统，就一定能全面解决这些问题！　　5 结束语　　电子商务随着网络技术的提高已经成为一种全新的商务模式，但其安全性已经成为电子商务能否成功发展的决定性因素。因此，为了保证电子商务的顺利发展，必须解决电子商务网络交易中的安全问题。"}
