{"title": "关于小学数学计算机教学的分析", "url": "https://www.lunwendata.com/thesis/2019/155396.html", "time": ["2019-02-12"], "info": "　　中图分类号：G424 文献标识码：A 文章编号：1672-3791（2017）02（c）-0185-02　　近年来，我国科技信息技术取得了飞快地发展，尤其是计算机信息技术，其已经深入到各行各业中，同时计算机信息技术逐渐被当作一门大学必修课进入到我国高等教育中，其在小学课堂中也得到了广泛的应用。计算机的教学模式使得我国小学数学教学更具有时代特色，更符合现代教育的要求，对此，教师应该积极更新自己的教学观念，积极采用新型的数学教学模式，实现电算化的小学数学教学。　　1 利用计算机创设情境，激发学习兴趣　　俗话说：“良好的开端是成功的一半”，这句话说得很有道理。为了提高小学数学课堂的教学效率，如果能够在上课之前，采取措施激发学生的学习兴趣和提高学生的学习积极性，将会在很大程度上推动教学内容的完成。计算机应用到小学数学教学中算是一种比较新颖的教学模式，其能够创设多种不同的学习情境，与传统的数学教学模式截然不同，学生的学习积极性和对知识的求知欲会瞬间提高，这对于后期教学内容的顺利完成具有很大的作用，与此同时，这种具有时代特色的教学模式也培养了学生的逻辑思维能力和空间想象力。比如，在讲解“0的认识”这部分内容时，可以小学生比较熟悉的猫吃鱼故事为教学情境来制作动画，通过计算机将该故事动画在课堂上播放，这样学生会对“0”这个数字的认识更加深刻，从而提高了教学效率。由以上可知，计算机创设的情景教学模式对激发学生的学习兴趣具有很大的意义。　　2 运用计算机教学反映事物本质，呈现发展过程　　一般而言，抽象思维是要建立在形象思维之上的，同理抽象的知识务必要通过一些形象的知识将其具体化，这样才有利于学生对抽象知识的吸收，诸如图片、图形、具体的实物等是小学数学教学中经常会被用到，其旨在将抽象知识具体化。例如，教师在讲解“圆的认识”这一章节时，在课堂上，教师可以将一些生活中常见的圆形实物展示给学生，使得学生对圆形有一个初步的视觉认识。值得注意的一点是，生活中的圆形实物和教材上圆的具体概念还存在很大的差别，即圆的概念是：以定点为圆心、以定长为半径的点的轨迹，也就是说圆本质上是点的轨迹，但是呈现给学生的圆形实物，并没有体现“点的轨迹”这一特点，所以这个时候，教师要通过实物教学逐渐将圆的本质特征讲解给学生，即透过现象看本质，借助于多媒体计算机教学模式更有利于实现这个目的。采用计算机创设不同的教学情境，为了使得学生对圆的形成有根本的认识，在课堂上，教师可以通过多媒体教学将圆的形成过程以动画的形式展示给学生，最好能将点的轨迹这个动态变化体现出来，随后可以提出跟这个动画有关的问题，引导学生科学地认?R圆形。这种教学模式一方面可以帮助学生更好地由形象思维过渡到抽象思维，另一方面也提高了学生思维能力，一定程度上也提高了小学数学教学的效率。　　3 运用计算机教学简化教学重点和难点　　抽象思维是数学的一大特点，正因如此，很多学生感觉数学很难学，久而久之，就失去了对数学学习的兴趣，这也是很多数学教师很困惑的一个问题，但又不知如何改善这种状况。计算机教学的出现在很大程度上帮助教师解决了这个问题，原本让学生感觉乏味的内容可以通过动画教学展示给学生，学生对此很感兴趣，从而对数学学习的态度也发生了改变。计算机教学的引入，实现对不同知识点之间的动静转换、虚实结合、抽象具体的转化等，站在学生的角度讲，这种教学模式有利于学生更好地理解所学内容，进一步吸收；对于教师而言，这种教学模式简化了以往繁琐的教学程序，提高了教学效率。比如，学习“长方体和正方体的认识”这节课时，要求学生理解“点、线、面”等之间的关系，单靠一个具体的实物模型可能很难实现该目的，对此，可以通过计算机教学，将长方体的基本框架展示给学生，随后通过移动某个棱来让学生理解上面三者的关系，正方体的学习程序也是如此，这样就可以使得学生更为直观地观察到图形的动态变化。　　4 利用计算机教学充分挖掘学生想象力　　小学生的想象力一般都比较丰富，将学生的这种求知欲和想象力与计算机教学结合起来，则会大大提高学生的学习积极性和思维能力。比如，在学习“圆柱的表面积”这部分内容时，在此之前学生对圆柱的面积和长方形的面积都有所掌握，所以，教师可以将圆柱体剖开演示讲解如何求得圆柱体的表面积，使得学生能够更直接地看到圆柱是由一个长方体和两个圆组成，引导学生如何将长方形的面积和圆的面积、圆的周长等知识贯穿起来运用到该堂课中，这样不仅可以使得学生对已学知识进行有效的回顾，同时还可以促使学生对圆柱的表面积公式的由来有本质上的认识，更好地对本节课内容进行吸收。采用多媒体计算机教学模式，便于将教材上的内容更好地展示给学生，学生对知识会理解地更透彻，同时还提高了学生的思维能力和创造能力，增强了学生对数学学习的自信心。抽象的东西具体化往往会让人记忆深刻。这种具有时代特色的计算机教学模式，一方面可以使得课堂形式多样化，另一方面，有利于培养学生的自主学习能力和思考能力，同时也增强了教学效果。　　5 结语　　科学技术的发展使得计算机在教学领域中得到了广泛的应用。从事小学数学教育的教师一定要从根本上改变传统的教学观念，积极采用符合现代教育要求的教学模式，充分利用计算机网络资源丰富教学内容和教学形式，培养出更多社会需要的高层次人才。"}
