{"title": "基于计算思维的大学计算机教学探讨", "url": "https://www.lunwendata.com/thesis/2019/155082.html", "time": ["2019-02-09"], "info": "　　计算机基础课程作为本科生通识教育的重要组成部分，是培养学生信息素养的重要环节。近年来，大学计算机课程教学遭受质疑并面临新的挑战。　　一、大学计算机课程现状与存在的问题　　国家推动面向所有大学生开设计算机文化课程（后被各学校称为计算机基础课程、大学计算机基础课程）已经近20年，期间经历了若干次的演变和发展，到今天已经明确了用计算思维改造大学计算机基础课程的方针和原则，大学计算机课程应该讲授计算思维也已经形成了普遍的共识，以计算思维培养为主的大学计算机课程已成为和数学、物理、外语一样的通识类基础课程。然而限于“基础-学时-内容”的矛盾，人们对面向计算思维的课程内容体系仍旧存在一些困惑，致使很多教师的教学内容仍旧停留在所谓“狭义工具论”的层面，或者是停留在汇集计算机各门课程前言、绪论知识的层面，仍没有形成有特色的自成体系的大学计算机课程教学内容，不能满足新形势下大学计算机课程面向计算思维通识教育教学改革的需要。所谓“基础-学时-内容”矛盾是指：大学一年级学生计算机基础参差不齐，有些学生计算机基础很好，而有些学生则相对较弱，讲授哪些内容学生才能受益并能接受难以确定；计算机学科是过去60年发展最为迅速的学科，知识与内容膨胀之快速令人难以想象，如此众多内容怎样进行教学选择成为难题；为保证非计算机专业学生本学科知识的学习，不可能拿出太多学时来学习“大学计算机”课程，而且还面临不断压缩课堂学时的压力。　　二、计算思维教学方案和实施　　教学过程中所采用的教学方法随着时代的进步而发展。计算思维的培养不是摒弃以前的教学方法和学习模式，而是将新的计算思维的方法融入进去，达到完善大学计算机基础教学的目的。使学生在掌握计算机学科思想和方法的基础上，达到内化计算思维的目的。　　（一）教学内容设计的基础性和普适性　　计算思维的定义虽然是2006年周以真教授提出?淼模?但计算思维从远古开始由来以久，可以说是无处不在，它与学生的学习、生活、工作密切相关，也是学生不可或缺的生存能力。在教学内容的设计上，以大学计算机基础教学大纲为指导，重新整理出教学单元中所涉及的计算思维基础性内容，改变传统单纯知识的教学方法，着重体现计算思维的基础性\"可见性，突出对计算思维能力的引导。以讲述“计算机发展阶段”为例，将教学内容设计为专题讲座“计算机的昨天、今天和明天”，从结绳计事讲起，到计算机的四个阶段和未来的计算机，提炼出计算和计算思维的普适性与基础性，让学生更好地理解计算思维。　　（二）教学内容的设计具有趣味性和启发性　　大学计算机基础课程有别于其他公共课，学生的起点层次不齐，常规的依赖于课本的教学方法，不能达到理想的教学效果，特别是理论课部分，需要很好的教学设计，才能体现计算思维在理论课中的普遍性与趣味性。比如说“二进制”的部分，便可以设置以游戏的方式进行教学，让同学们在玩游戏的过程中，了解二进制的原理以及进制之间的转换规则，通过使用二进制表示二值图像、计算人的生日、计算ISBN等，来体会二进制与日常生活的密切联系，让同学们感受计算的无处不在，计算思维的无处不在。　　（三）教学内容设计的综合性与实用性　　课堂是一种生活，如何在这有限的时间内让同学们理解和建立“信息、计算、智能”三大核心概念，从传统的以教师为主导或无意识的思维教学中转变过来，让学生想学习，会学习，以计算思维为导向的教案设计显得尤为重要。计算思维的核心是算法的思维，就是抽象的思维，但是同时它也拥有着很多的时代特性。从现实生活的案例入手，通过感悟数字化生存的智慧，让学生感受到计算思维的由来、原理、方法，以及如何有效地运用计算思维来解决现实中的问题，把知识的教学升华为思想的教学。以程序设计内容为例，对于非计算机专业的同学来说，程序设计一直是难学的内容，为了让同学们更好地了解算法和抽象思维，我们加入了可视化的编程语言―――RAPTOR。从计算思维培养的角度进行案例的重组，将问题求解提升至计算思维的培养。以程序设计中经典案例哥尼斯堡七桥问题为例，以计算思维为导向对问题进行求解：问题求解（寻找一条经过各城市有且仅有一次，再回到起点的路径）―――寻找解决方案（一笔画算法）―――算法优化（使用编程语言实现一笔画算法，并在实现过程中对其进行优化）―――总结归纳为现实问题的延伸（总结出解决此类问题的一种通用方法）。通过从算法构造世界的角度，来讲述算法之美，计算思维之普遍与美。　　三、教学评价体系　　不同于其他理论课程，计算机基础类课程的操作性和设计性较强，鉴于这个特点，教学评价将过程性评价和终结性评价相结合。过程性评价（平时成绩）由出勤（30%）和课堂提交作业（品）（70%）两部分组成，占总成绩50%；学生若在作业中有创新和提高，可以适当增加分数，从而激发学生的学习兴趣，提高学生的求知欲。终结性评价是课程结束综合性考核结果（期末成绩）占总成绩50%。不论是在过程性评价还是终结性的评价时，都应采用无纸化的考试形式，这样才能充分体现计算机教学的特点，让学生感受到计算机的强大魅力。　　对于大学生而言，大学计算机基础是必须掌握的。大学计算机基础课程的开设有助于学生计算思维能力的培养。教师在进行教学的过程中，不妨对计算思维的训练课程进行设计，虽然会存在一定的难度和挑战，但同时也可以给大学计算机课程领域带来一缕清风，促进教学的改革和发展。笔者就大学计算机教学的问题与现状进行了概述，同时据此对计算思维教学方法进行了分析，希望可以对大学计算机教学这方面起到一定帮助。"}
