{"title": "基于提高计算机教学的方法探讨", "url": "https://www.lunwendata.com/thesis/2019/155811.html", "time": ["2019-02-17"], "info": " 　　摘要：对于如何在计算机课程的教学过程中调动学生的积极性和主动性，调动学生的学习热情，变“要我学”为“我要学”，从而提高课堂教学质量，让学生真正掌握计算机的基础知识和应用技能进行了初步的探索。　　关键词：任务驱动；分组教学；互动式教学　　中图分类号：G642.3 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-01　　随着计算机技术的飞速发展和信息技术革命的到来，计算机在国民经济和人们生活各个领域的应用越来越广泛，掌握计算机的基本技能已经成为胜任本职工作、适应社会发展的必备条件之一。因此，作为一个计算机教师，教学效果对学生的影响至关重要。传统的“满堂灌”等教学方法，无法充分调动起学生的学习积极性，教学内容过于强调课本知识的传递，缺乏趣味性，容易使学生产生厌学情绪，直接影响教学效果。在计算机课程的教学过程中怎样以学生为主体，充分调动学生的积极性和主动性，变“要我学”为“我要学”，从而提高课堂教学质量，是一个值得探讨的问题。　　一、如何提高计算机教学　　（一）用心关爱学生，建立良好的师生关系　　良好的师生关系有助于调动学生的积极性，提高学习效果。良好融洽的师生关系，是保证教学质量的根本。教育家赞可夫说：“就教育工作的效果来说，很重要的一点是要看师生之间的关系如何”。师生之间的关系处理好了，学生就愿意亲近你，喜欢老师了也会喜欢老师所教授的知识。这样的话，学生的学习劲头也会更大，兴趣自然也会提升，在遇到问题的时候会乐于找老师帮助。　　那么，如何建立良好的师生关系？首先，要关心学生，多与学生进行情感交流，把学生当朋友，信任的眼神、微笑的面孔、和蔼可亲的态度、循循善诱的教诲，让学生真正感觉你是从心底里关心他的，即使遇到学习以外的问题，也愿意来找你。其次，要善于表扬学生，对于好学生要表扬，对于每一个学生的进步要表扬，学生从表扬中获得的是鼓励，是自信，是想进一步学习的热情。　　（二）利用多媒体技术，采用任务驱动法启发教学　　多媒体教学技术的应用，改变了传统的教学模式和手段，多媒体把文本、图形、动画、声音、视频等多种媒体休息集于一体，便于从直观上展现教学信息。　　“任务驱动法”是将学生的学习活动与事先设计好的任务相结合，首先以探索问题的方式来提出任务，引导和维持学生的学习兴趣和动机，通过对任务的分析让学生带着问题去学习，使学生在学习过程中变“被动学习”为“主动学习”。　　PowerPoint是计算机里的一项非常重要的内容，而教师的课件正是由PowerPoint制作而成，在讲PowerPoint这章内容的时候，就可以先把重要的知识点通过教师课件展现给学生，比如说把课件的主题设置为“自我介绍”，在课件里加一些图片、背景音乐、动画以及幻灯片的切换效果等等。然后问学生：“你们想不想制作一个这样的作品来展示你们自己呢”。对于刚接触计算机不久的学生来说肯定想自己也能做这样的一份作品，然后可以接着鼓励学生：“通过本章的学习，你们可以制作出比老师的作品更漂亮的作品，下面就让我们一起来学习吧”。通过这样一个来自日常的任务驱动，可以极大的激发学生的学习兴趣和热情，提高学习效率。　　（三）采用分组教学，增强学生的团队协作精神　　在学生上机实践过程中，有意识的把学生分成几个小组可以促进学生的共同提高。首先，大家都想为本小组争光，希望能成为最好的小组，所以他们的注意力高度集中，上机时间就能得到有效的利用。其次，由于学生的个体差异，不可能所有学生都能完成所有的操作，为了本小组的荣誉，小组成员之间通过交流合作以及老师的指导完成任务，通过合作学习，可以极大的培养学生的团队协作精神。第三，有些同学基础好，反应快，可以很快完成上机任务，他在帮助本小组成员的同时，其实相当于自己把某些操作又重复了一次甚至多次，那么他的记忆无疑又得到了巩固，而因为帮助了别人，又会增强小组成员之间的感情，必然会形成一个良好的人际关系，从而营造一个良好的学习氛围。在这样的一个良性循环中，进一步增强了学生的团队协作精神。　　（四）采用互动式教学，提高学生的学习热情　　计算机基础是一门操作性很强的课程，在上课的过程中必须采取互动的形式，通过互动与学生产生交流，在互动中更好的了解学生对知识的接受和掌握程度，适时的调整自己的授课方案。　　那么，如何产生良好的互动效果？学生在精神状态最饱满的情况下，学习效果才是最好的。可以用激情去感染学生，老师有多激情，学生就有多激情，学生有了激情，就能产生更好的互动效果。为了能够与学生互动，老师应该首先充满激情，用抑扬顿挫的音调来给学生上课，并适时的走到学生的中间，让学生感受到你的激情，让学生知道你在注意着并且很重视他们对所讲知识的反应，明白了就回应，不明白就提出问题，老师便会重新讲解，在与学生激情的互动交流过程中，感染了学生，提高了学生的学习热情和学习的主动性。　　（五）适时活跃课堂气氛，集中学生的注意力　　调查结果显示，近六成的学生上课集中精力的时间达不到30分钟。长时间的集中注意力，会使学生处于一种疲劳的状态，影响听课效果，这就需要老师适时的来调节课堂氛围，比如提问一些讲过的内容，找学生来回答，回答完了，老师来一句“You did a good job”（你回答的很好），接着对其它学生说“Let’s give him a big hand”（让我们给他热烈鼓掌）。学生会感到惊讶，会想，我们不是在上计算机课吗，老师怎么说起英语了呀！这样的一种打破常规的表扬方式一下子就会把学生从疲劳状态调整为高度兴奋和集中的状态，而学生也顺便学了两句地道的口语表达。　　二、结束语　　就如何调动学生的积极性和主动性，变“要我学”为“我要学”，提高学生的学习效率，从而提高计算机教学质量的问题，总结了一些自己的观点。不同的课堂环境对老师的要求也不同，我们还需要积极探索更有效的教学方法，使学生能在轻松愉快的氛围中学到更多的知识，真正掌握计算机的基本知识和应用技能，为今后的发展打下坚实的基础。　　参考文献：　　[1]骆瑞玲,蔡文青.浅谈计算机教学过程中如何提高课堂教学质量[J].甘肃科技,2011,27(14):168-169　　[2]王英.如何做好计算机教学[J].教学研究,2011(11):38　　[3]杨晶.浅析任务驱动法在计算机教学中的利与弊[J].信息通讯,2011(4):80-81　　[作者简介]　　王玉芬（1980-），女,汉族，河南省焦作人，商丘工学院信息工程学院教师，研究生硕士学位，研究方向,数据库与无线网络技术。 "}
