{"title": "基于项目导向高职计算机网络技术专业实践教学体系改革探索", "url": "https://www.lunwendata.com/thesis/2019/156662.html", "time": ["2019-02-26"], "info": "　　中图分类号：TP393 文献标识码：A 文章编号：1009-3044（2015）34-0140-02　　Abstract： This paper is aimed at the problems existing in the practical teaching system of computer network technology in higher vocational colleges，it takes our college this professional as an example， introduces the basic content and function of project oriented teaching， and combines the characteristics of computer network specialty， discusses the practice teaching system in the teaching content， the security system and the students comprehensive evaluation of the construction ideas and process.　　Key words： vocational school； computer network technology major； practical teaching； project driven　　1 概述　　随着计算机网络技术与互联网的飞速发展，网络已成为我们生活、办公和商务等活动中不可缺少的工具，网络技术已参透在各个行业领域，使得现在的企业的运营管理都离不开计算机网络。当前社会需要大量的从事计算机网络系统的设计、安装、维护和网络软件设计开发、测试，网络管理以及网络安全检测等方面的应用型技术性人才[1]，这些对计算机网络技术专业人才的动手实践能力和综合素质提出了更高的要求。在此背景下，加强计算机网络技术专业的实践教学显得尤为重要，所以必须要构建好高职计算机网络技术专业实践教学体系，巩固和加深学生的计算机网络专业理论知识的同时还要重点培养学生的实践动手操作的能力，从而实现计算机网络技术人才培养与社会需求零距离对接。　　2 实践教学存在的问题　　计算机网络技术专业是实践性要求很高的专业，许多地方高职院校虽建设好了网络实训室，但由于实训室内路由器、交换机等网络设备少，没有对实训室进行合理的设计，使得设备利用率较低[2]。由此计算机网络技术专业教学长期存在偏重课堂上对知识原理的讲授，而轻对学生的实践教学，实践内容侧重于验证课本所学的知识点缺乏综合性、设计性实践。从而导致教学效果不佳。　　高职学生普遍存在入学底子薄，学习目标不够明确和自主学习能力差等系列问题，这为教学工作带来了难题，如何激发学生的学习热情与积极性以及形成自主学习习惯，就要改变以往重理论轻实践，实践教学依附于理论教学的现象。多数高职计算机网络技术专业的实践教学采用教师教授，学生跟着学和操作的固定模式，这样的教学模式下学生大多是以模仿为主，很难引起学生的兴趣，学生在解决实际问题和实践动手能力以及创新能力上得不到实质性的提高。　　在实践教学内容这块由于与计算机网络技术相关的企业交流较少，实践教学内容与企业实际应用有很大差距，导致培养出来的学生无法形成完整的技能系统，很难将所学的知识运用到实践中去，在面对企业复杂的信息网络化环境是无法胜任的[3]。　　3 项目导向教学内涵与作用　　与传统教学模式不同，项目导向教学模式要求以学生为中心，教师在整个教学过程中，起到指导和组织的作用，这样可以有效发挥学生的学习主动性与积极性以及创新能力的培养。项目导向教学模式是把学生的学习任务与实际的项目有效地结合，教师与学生共同实施完成一个完整的项目，通过逐步展开项目而进行相应的教学活动，在该模式中由老师先提出项目任务问题，学生可通过探索问题和解决问题来提高学习积极性与学习兴趣[4]。　　项目导向教学模式是将理论知识、操作实践与工程应用进行高度结合，把原本比较分散的知识点整合到项目中，使学生不仅掌握知识要点，而且熟悉整个项目流程，增强了学生专业技能水平，同时也培养了学生的团队合作能力，从而提高他们日后的就业竞争力。　　4 基于项目导向实践教学体系构建　　针对以上高职计算机网络技术专业的实践教学体系存在的问题，提出基于项目导向高职计算机网络技术专业实践教学体系改革，由于高职计算机网络技术专业是以建网、管网、用网为核心能力来培养学生，在人才培养方案的制订中，以项目任务为导向，按照职业岗位对应的知识、能力来选取相应的教学项目内容。下面就实践教学内容体系，保障体系和学生综合评价机制做相关的介绍。　　4.1 实践教学内容体系　　由于计算机网络技术专业知识面宽，应用的技能点比较多。我们通过企业调研和其他高职院校的走访，以及对我院毕业生的反馈信息，将计算机网络专业的网络相关项目按照网络规划分成3种项目级别，分别是小型家庭办公网络、中型企业单位网络、大型综合型网络。并且每个网络项目开展过程中可细分成网络组建、网络管理和网络应用3方面的工作[3]，这与计算机网络技术专业核心能力培养是相对应的。　　在每个项目设计时，要求每个项目的知识点包含教学大纲课程的主要知识点，对每个项目分细化为若干个项目子任务，让知识点融入到项目任务中去。通过以项目任务驱动的模式实施教学，在课程教学设计中，对学生进行分组教学，鼓励学生进行小组讨论交流，培养他们思考问题和解决问题的能力以及创新和团队协作的能力的培养。   　　4.2实践教学保障体系　　1）实训室规划与建设　　高职计算机网络技术专业是应用性、操作性非常强的专业，而学生的动手操作技能只有通过不断地实践操作才能得到锻炼和提升，所以计算机网络技术专业的实训室的规划与建设对学生的实践操作能力的培养起到至关重要的作用。　　在建设网络实训室时，以项目的情景为依据，根据项目任务中的设备要求来进行实训室的建设和规划。由于计算机网络设备比较贵，技术更新换代周期比较短，这些给实训室的建设带来一定的困难，为了更高效利用实训室，在规划时，使硬件和软件共享度高的任务规划在同一个实训室[5]，我们由此规划的实训室有网络基础实训室、网络综合布线实训室、网络工程实训室、网络管理实训室、网络安全实训室和锐捷网络实训室，其中锐捷网络实训室是我院自2007年就与福建星网锐捷网络有限公司共建，合作建立高水平实训室。　　2）实践教学双师型师资队伍建设　　在计算机网络技术专业实践教学方面，双师型教师是实现项目的引导者和组织者，在项目的教学过程中起到关键作用，所以对授课教师提出了更高的要求，不仅要求教师具有系统理论知识和较高的专业技术能力，同时还要具有很丰富的实际项目经验，并且要求授课教师对要授课的项目非常熟悉，了解非常透彻，操作娴熟。　　由于高职院校教师引进来是大多是应届毕业生，其中很大一部分教师是没有实际项目工作经验，这也是制约实践教学质量的重要因素。计算机网络技术专业实践教学不仅要求教师要有很强的教学水平，而且要求教师具备丰富的项目开发经验。在对双师型师资队伍建设方面，我们采取以下措施，一是集体备课、举办专题研讨会、教学观摩、互派访问学者等形式提高教师教学整体水平；二是积极创造条件派送年轻教师到相关企业单位进行实际项目锻炼，我院与多家企业单位合作，利用寒暑假期安排教师到公司、企业单位挂职锻炼，了解企业和生产过程，提高解决网络技术问题的能力，同时可将企业单位的技术项目引入到实践教学中，以便丰富教师的项目实战经验和教学经验，促进教学方法和教学模式的改革；三是聘请具有丰富经验的企业网络技术人员来上实践课和请企业的网络工程技术人员参与实践教学的指导。　　4.3学生综合评价机制　　由于计算机网络技术专业是实操性非常强，我们需要改变传统理论笔试加操作的考核模式，注重学生完成项目能力考查，对学生的评价紧扣实践教学项目，通过采用过程评价、阶段评价和实现项目目标评价等多种评价方式，多方面综合评价学生所学知识的掌握情况和完成项目任务的实践动手能力情况以及分析问题以及解决问题情况。　　5 总结　　基于项目导向的实践教学，可以使学生在学习和实践项目任务的过程中，获得自信心和成就感，激发了学生的求知欲望和学习积极性，提高了学习效率，同时可以加深学生对所学内容的理解，锻炼了他们的分析和解决问题的能力、实践动手能力和团队协作能力。我院计算机网络技术专业通过项目导向实践教学，取得了良好的教学效果，提高了该专业实践教学质量。"}
