{"title": "技校计算机任务驱动教学之“动力型任务”设计探究", "url": "https://www.lunwendata.com/thesis/2019/158840.html", "time": ["2019-03-22"], "info": "　　引 语　　为了提高技校计算机教学质量，教师们都积极的创新新的教学办法，以求更符合时代和现实意义。任务驱动教学办法应运而生，将任务驱动教学引入到技校计算机课堂内，建构动力型任务教学模式，此模式是学生们依据教师设计的任务，从中发现，探究内容中存在的问题和要点，自主建构解决问题的具体办法。让学生可以依据自己的爱好和兴趣自主选择任务，循序渐进，教师从旁鼓励，引导他们完成任务，让学生在完成任务中得到必要的知识，增强他们的信心和求知欲。这种模式是在教师的有效组织和设计下，通过互助，潜移默化的影响来提高学生的素质，提升教学质量。　　一、任务驱动法的基本内涵　　任务驱动法就是将动力型任务贯彻于整个计算机教学中的一种办法。教师在教授知识时将要学的新知识隐藏在几个或一个任务中，让学生们在通过对任务的分析，探究和讨论的过程中，发现问题，独立思考加上教师的适当引导，再通过实践操作来寻找解决问题的途径，最终找出答案。通过任务与任务之间的衔接与深入，启发学生的思维和兴趣，让他们自觉，快乐的接收新知识，完成教学目标。使用任务驱动教学的好处主要体现在一，因为任务驱动法强调学生在通过实践操作中获得知识，这提高了学生们计算机的实际操作能力，给他们足够的自由，让他们主动参与到完成任务中，培养了他们的创新精神。二，任务驱动教学法改变了过去死板的教学模式，任务驱动教学要求学生边操作边学习，在操作中学习，在学习中操作。体现了学生才是计算机课堂主体，教师变成了指导者和组织者，强调给予每一位学生创造和表现的机会。　　二、动力型任务的动力来源　　动力型任务的情境设计要求尽可能的真是可靠，最好来自于生活中鲜活的例子，且要考虑技校学生的接受能力和心理状况，营造良好的课堂氛围是拓宽学生的思路的动力来源。还应将计算机中的图像，视频，动画，声音和文字等资源整合在情境中，激发学生的兴趣。比如在教授ppt课程时，我们创设了一个机场售票处作为情境，内容包括搜集优秀机场人员的照片并设置自定义动画，链接和图片效果。此外我们还应考虑技校学生的特殊性，因为技校学生一般成绩都不太突出，可能长期遭受学习和成绩的打击，对学习缺乏兴趣，所以他们理解知识的能力和一般学校里的学生由一定差距。而且技校的学生虽然对就业方向很明确，但就业意识较差，根据这几个技校学生的特点，教师应将总体教学任务模块化，如果有需要可以将一个课时分为两个课时进行教授。对于那些比较难的内容，教学可以划分一定的层次，循序渐进，给不同层次的学生布置不同的作业，体谅那些成绩较差的学生并多加鼓励。　　三、动力型任务设计实例　　教学任务是让学生们可以正确输入表格内的数据与熟练操作abs，average，sum的数据计算，通过学生们奥运会的兴趣转移目标。　　首先课堂导入：“同学们，08年奥运会将在我们中国北京召开，作为骄傲的中国人，我们是不是应该为之喝彩呢？今天就让我们来做一位奥运宣传人员，大家是否为这个身份感到骄傲呢？好的，接下来让我们每个人准备一份奥运数据的材料，让我们打起精神来向世界证明我们作为东道主的实力吧！　　然后讲授新课，首先将光标定位在相应的单元格内，然后输入相关数据。再布置第一个动力型任务，要求学生们打开奥运宣传的.doc文档，参照图片里的内容，在表格内输入正确的数据，要求最近三届奥运会金牌榜设置为竖排文字。怎样通过输入的数据比较每个国家金牌数的多寡呢？然后进入计算提示，运用sum用于参数选用，left用来计算光标左边单元格的数值，above计算光标上单元格数值，用average求平均数。然后再布置第二个任务，在奥运宣传文件中，使用刚才输入完成的内容进行平均数和总数的计算。思考题：最近三届奥运会取得的平均数能不能直接用来计算光标左边的数据呢？　　任务驱动教学之动力型任务强调动力的重要性，为了达到预期效果，动力任务的设计一定要凸显出所学知识的实用性，运用奥运宣传资料这个可行性比较高的数据作为基础，在这个基础上运用表格的各种知识，让学生们可以感受奥运会这件盛世的同时回顾以前学习的知识，牢牢把握知识要点。　　四、动力型任务设计的注意点　　以任务作为主导的计算机驱动教学之动力型任务对“任务”的要求格外高，所设置的任务必须要合情合理，难度上要循序渐进，这样才可起推动作用，否则可能会适得其反。教师们应将一些教学难点，大任务拆分成各个不同层次的小任务，让学生们通过完成一系列小任务的途径获得大任务的精华，完成教学任务。而且每个小任务之间一定要能紧密的结合，小任务之间也要有难易差别，随着学生能力知识的上升给予新的任务。对于学生们的容易犯错的操作点，教师应在课前或课后进行反复试验，加强学生辨别错误的能力，警惕再犯。此外也不能忽视总结与反思的作用，在每一阶段任务完成后，教师都应该将整个任务脉络串联起来，重新进行梳理，加强学生的记忆和理解。　　总结　　通过对计算机任务驱动教学之动力型任务设计的不断研究，我在众多不同任务的选择上有了新的体会和了解，明白为了要在实践探索中找到更多适合技校学生学习计算机的动力，一定要关注技校学生的心理状态，依据他们的需求和理解能力，寻找现实生活中生动有趣，适合课堂的真实情境进入教学中，不断引导学生们进行有益的探索学习。"}
