{"title": "浅谈计算机在图书馆现代化管理中的应用", "url": "https://www.lunwendata.com/thesis/2019/154847.html", "time": ["2019-02-06"], "info": "　　中图分类号：G251 文献标识码：A 文章编号：1003-9082 （2017） 04-0046-01　　当前，网络信息技术广泛应用在各个领域，给人们学习、生活与工作提供便捷。计算机网络在图书馆管理中的应用，推动了图书馆管理的自动化、数字化、智能化发展，该应用不仅给读者带来方便，而且能够减少图书馆管理工作人员工作量，减轻工作负担。可见，图书馆事业的未来发展依旧离不开计算机网络技术，本文主要探讨计算机网络在图书馆管理中的应用与实践。　　一、计算机技术在图书馆管理中的应用现状　　1.计算机技术改进了图书馆工作方式，提高了服务效率　　传统图书馆管理中一般采用的是手工借还方式，其借还手段比较单一，容易出现错误而且文献服务效率不高，因此在过去的图书管理中经常出现问题。而随着计算机技术的发展，各行各业开始在自己领域引入计算机技术，图书管理中毫不例外。在图书馆中应用计算机技术实现了现代化管理，图书馆服务器可以帮助读者了解到自己想要阅读的书籍的所在位置，也能方便读者查看自己的阅读情况。这种方式为读者节省了许多翻找图书的时间还为图书馆管理人员的工作减轻了难度，从而提高图书馆管理效率。而且传统的图书馆管理模式具有一定局限性，服务范围比较小，仅仅局限本馆内。而在图书管理中应用计算机技术没有了时间、空间、地域的限制，开始向社会化和开放化方向发展。计算机技术功能十分强大，利用互联网传播功能可以让文献资源得到共享，不同载体、不同地域的信息资源通过信息技术进行存储并供传播所用，对跨地区、跨行业网络查询提供了很大的便捷，使得图书馆管理在原来的基础之上，增添了对其他信息资源的融合功能，为读者、学校、社会提供了更加方便的信息资源服务。　　2.计算机技术改变了传统图书馆管理的方式　　图书馆具有文献集存、文献整序、文献传递、智力开发和社会教育的智能。传统图书馆管理一般是由人工进行图书馆文献的收集、登记、整理和统计工作。现如今科学技术飞速发展，原来的图书馆管理模式已经跟不上时代的脚步，一些弊端逐渐突显出来，并制约了图书馆的发展。在这样的背景下，图书馆管理中引入了计算机技术，代替了原来手工业务的工作方式，让信息化、自动化和程序化管理应用到了图书馆中的各项工作中，经过一段时间的应用和实践后发现，这种管理方式不仅能够大大的提高工作人员工作效率还实现了信息的系统管理，让图书馆管理模式得到了进一步的发展。　　在图书馆管理中应用计算机和网络技术，就是要让图书馆的各项业务由计算机来完成。传统的图书馆管理中馆员的职责就是单纯的对图书馆进行管理，而现代化的图书馆管理工作中馆员的职能和业务水平都和以前不一样了，现在馆员需要更多的专业知识管理图书馆还需要指导和监督图书馆信息系统，使其更加完善。比如，如果读者想要阅读书籍时，要利用计算机管理系统明确图书馆流通情况，并制定相应的采购计划，从而保证采购工作的合理和优化。另外，在图书馆管理中应用计算机技术除了可以将原来的图书馆采编、借阅、数据库建立和更新等各项业务转化成计算机自动处理外，还在图书馆各个层面的工作中增加了管理和统计功能，大大减少了人为纰漏、错录、漏录等情况，并能对人为失误进行纠正，保证了图书馆管理的精准性。　　二、加强信息资源的数字化管理　　1.数字化图书馆与传统图书馆的关联互补　　虽然数字化图书馆使用计算机技术取代了传统图书馆的繁杂的工作，但是以纸质形式存在的书籍与文献是不可能被其取代的。由此可见，数字化图书馆与传统图书馆有着一定的关联性与互补性，要做好相关整合与衔接性工作。　　2.创新管理观念与理念　　现代化图书馆不仅具有特色环境与活动，同时还具有特色服务与馆藏，其拥有的藏书种类与规模更多、更大，符合现代社会信息资源的开放性与共享性的发展需求，受馆藏数量与开放时间的限制越来越小。我们必须注重信息资源的共享，对多种信息资源进行优化整合，构建具有开放性的信息库资源，为快速获得所需信息资源提供支撑。　　3.提高?D书管理人员素质　　过去的图书馆管理人员工作内容就是单纯的管理图书馆，实施现代化管理后管理人员的工作内容也随之发生了改变，因此管理人员需要作出调整，应该不断提高自己的专业技能，从而更好的适应现代化图书馆管理模式。为了提高图书馆管理人员素质，图书馆可以采用以下办法：其一，可以安排一些培训活动，培训内容主要是针对信息技术方面的知识；其二，采用绩效考核手段，定期安排考核，考核合格的可以留下来继续工作，没有通过考核的要对其淘汰。而且要让工作人员的工作情况和工资收入成正比，给工作人员提供动力；其三，提倡工作人员进行工作创新，对于创新效果好的工作人员要给予奖励，调动工作人员的创新积极性；其四，图书馆要和高校进行定向培养、在职进修等方面的合作，为图书馆输送高素质人才。　　4.广泛应用信息资源勘探技术　　信息资源勘探技术是通过对信息资源进行统计，并对这些信息资源进行在线分析与处理。这一过程广泛使用了计算机技术进行情报检索，并根据以往经验组建专家系统，最后通过机器学习及模式识别等来实现对信息资源的勘探。该技术的使用大大方便了现代化图书馆对各种信息资源进行数据分析与处理。目前在高校图书馆中广泛地使用了该项技术，能够有效对信息资源进行分类、评估以及预测等，同时还能对这些信息进行相关性分析与分组和关联规则等。　　综上所述，信息技术对于提升图书馆管理工作效率、提高工作精度具有十分重要的意义，作为图书馆的决策者应当顺应时代的发展，认识到信息技术对于图书馆管理的重要性，采取相应措施，从而为图书馆的发展加添动力，并为用户提供更好的服务。"}
