{"title": "中职计算机教学优化的探索", "url": "https://www.lunwendata.com/thesis/2019/158539.html", "time": ["2019-03-18"], "info": "　　1 中职院校计算机教学现状　　1.1 教学设计及内容的问题 计算机技术的发展很迅速，顺应时代的要求我们在教学过程中选择教材时，应当紧跟计算机的未来发展趋势，充分体现其应用性，但是现阶段大多数中职学校中做不到这一点，常常延用一些老教程，方便教学，教师虽然熟悉教材，但教材可能不是最前沿、最新的教材，但这样就使得学生无法获取前沿的计算技术专业知识，影响其实践能力的培养。另一方面，中职院校在对学生进行教学环节设计上有时过于老化，计算机知识的传授应当是新颖的。　　1.2 教学目标方面的问题 当前，中职院校的计算机教学存在与时代脱节的现象，师资配备不合理，教学质量差，而且在校生的能力水平参差不齐。为了提高教学管理水平，一部分院校片面地效仿高职院校的教学模式而失了中职教育的特色，在教学目标的设计安排中有时并不适用，使得课程设置不当，从而导致学生学习的积极性不高，学生对于自己的学习方向目标不是很明确。也有些中职院校对于教学目标又设置过高，使得学生课程很多很全，但是在学习过程中，学生的学习都很空泛，没有真正掌握实际技能知识。因此这种现象的出现也阻碍了学生们对现代计算机技术的掌握。　　1.3 教师队伍的问题 现阶段，大多数中职院校的师资力量薄弱，计算机教师人数严重不足，整体的教学水平无法与本科院校相媲美。另外，很多老师的教学经验丰富但因缺乏定期的培训，对新知识、新技能的掌握程度不高，有的教师从事理论教学的同时兼任着实践课教学，精力不够，严重制约了计算机教学水平的延伸。　　2 教学方法改革措施　　2.1 分组学习法 在计算机教学过程中，不同的学生对计算机知识的领悟能力有一定差距。学习能力强的学生会很快领悟新知识的内涵，但接受能力稍差的学生往往跟不上进度。计算机教师在教学设计最初必须对学生的接受能力进行必要的了解。可由此在计算机实操课时针对学生不同情况进行分组，由计算机操作能力相对较强的同学作为组长，选择部分学习相对较弱的同学同分在该组内。上机实操过程中，由组长协助教师对水平较弱的同学进行个别辅导。　　2.2 任务驱动法 任务驱动法在计算机教学中的应用，是将计算机教学内容细分成若干任务，让学生以小组的形式独立完成各项任务，培养学生独立解决问题的能力。　　在教学过程中，应该将具体的工作任务融入计算机教学理论中，鼓励学生根据任务要求结合所学知识自主实践，教师从旁指导，确保学生掌握扎实的操作技能。例如在《photoshop》课程教学时，讲授photoshop软件时就可以先给学生呈现平面设计中的具体案例，再让学生对于案例进行分析，结合案例讲授photoshop软件在平面设计中的运用，接着可让学生提出自己感兴趣的设计方案。并让学生动手去实现自己的方案，学生在实现过程中教师应给出相应的辅导，这样学生能动而轻松的掌握学习内容。　　3 中职计算机教学优化的其他方面　　3.1 计算机教学优化应当以优化教学环境为基础 教学环境主要包括硬环境与软环境。多媒体与机房是硬环境，中职学校应该根据学生数量的变化及时增设硬件设备。同时对不适应当前教学形势的教学方法和教学手段进行优化和调整，紧跟计算机发展形势及时更新教学内容，避免计算机教学落后于时代要求。　　3.2 建立科学的考试制度 中职学校重在指导教育，即通过实践教学培养理论与实践并重的技能型人才。计算机教学也应该如此。计算机教学应该在夯实理论基础的同时，多组织学生参与上机实践课，促进理论知识与实践技能的转化。同时，要将知识、素质、技能作为主要的教学目的，理论知识做到能精讲、操作实践能多实践、能力培养最重要。鼓励学生积极参加国家有关计算机方面的资格考试。具有实用性、针对性的开展教学，因此符合职业岗位需求与社会需求。　　3.3 教师要加强继续教育 中职院校应该定期组织教师参加培训等继续教育活动。通过参加培训，教师可以进一步开阔视野，更新教学理念，提高了参与教科研的积极性。继续教育是培养骨干教师的有效手段。教师参与继续教育后，可以把最前沿的信息带给学生，拓宽学生的知识面，从而提高教学效果。　　中职院校必须在普及计算机教育的同时还应加强对中职学校中现有的计算机教学教师进行高层次的培养，从而促进中职学校计算机教学整体水平的提高。解决该问题就是应当不断提高计算机教师的专业理论水平，拓展视野，将教师送出去培训学习，从而以适应计算机技术的快速发展。　　中职学校计算机教学的优化，需要深入改进教学方法，同时进一步优化教学环境，在教学手段、教育模式上寻求创新发展，加强专业教师的能力培训和再教育，着力提升中职学校的计算机教学水平，培养出技能水平过关、专业素质过硬的高水准计算机人才。"}
