{"title": "大学《计算机基础》教学方法实践应用体会", "url": "https://www.lunwendata.com/thesis/2019/155814.html", "time": ["2019-02-17"], "info": " 　　摘要：结合多年的实践教学经验，通过案例介绍了几种计算机基础教学方法的实践应用，可供相关专业教师参考。　　关键词：计算机基础；教学方法　　中图分类号：TP3-4 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-01　　一、选用分层次教学，使得教学内容得以丰富起来，并促使学生的学习兴趣得以提升　　现在，大学计算机文化基础教学内容一直处在不断地变化发展的过程当中，其大致涵盖了：excel2003、word2003以及power-point2003的使用，计算机基础知识，计算机网络基础，数制以及windows操作系统概述。　　因为我国的地区以及教育体制的发展呈现出不平衡的趋势，因而导致各个地区的教学水准具有很大的不同之处，与此同时，学生的计算机水平的差别也是非常大的。倘若未将学生的差别性考虑进去仅仅使用一样教学手段教授课程的话，那么将会对许多学生产生严重的影响。倘若我们均凭借着相同的教学模式水准，具备好基础的同学将会在课堂上表现得不大积极，缺乏学习欲望，学习热情也会遭受到严重的打击，更有甚者还会对课堂的纪律造成不利的影响；但是，一部分同学也会因各式各样的客观性原因丧失自信，并存在讨厌学习的思想。所以，在详细的教学过程当中，应当实施分层次教学。针对具备一定基础且有能力的同学，教师应当设置好更高水平的教学目的，使得学生在将计算机文化基础学完以后可以非常顺利地通过全国计算机等级考试一级MS office；而针对学习不好的那些学生，在教学大纲上规定学生要对excel、word以及windows操作进行熟练地掌握，但是仅仅只需学生初步地认识计算机网络基础知识。该分层次教学的手段，对于学生的学习兴趣的提升有一定的促进作用。　　除此之外，教师应当在课堂上将一些具备实际操作作用的、学生们较为感兴趣的内容教授给学生，。与此同时，还应当对教学内容进行丰富，耐心疏导他们，从而指引学生实现主动学习的目的。比方说，在对第一章计算机基础进行讲述的时候，由远古时代的计数工具至世界上首台电子计算机的发明，这中间将很多时期的关键的典型人物的最具代表性的故事穿插进去了，其侧重于对计算机发展的历史上的两大重要性人物的生平事迹进行讲述，即：图灵以及冯?诺伊曼，从而使得较为乏味的计算机发展历史极具趣味性，进而引起学生们的关注；面对学生讲述些计算机的硬件的构成要素，鼠标、键盘以及显示器，学生们均较为熟悉，然而，但是其对于电脑主机内部的硬件的认识度还不够通透，因此，作为计算机老师，其在授课的时候可以将内存、硬件、主板等硬件带入到课堂当中去，从而使其学习兴趣得以激发出来；在对windows xp操作系统进行讲述的过程当中，不仅要对操作系统的基本操作以及功用进行讲述，还要对学生很少看到并且使用到的unix以及linux操作系统进行简要地阐述，在这当中，还将比尔盖茨的故事插入进去，这有利于学生的眼界的开拓；而在学习使用word2003的表格的时候，应当尽量使得教学内容愈渐丰富，并选用word表格能够将工作报表、个人简历以及课程表等制作出来，把学生的就业需求当成目的，以使得学生的学习兴趣得以提升，所以，应当将其同毕业论文结合起来，使得学生能够将目录的自动生成等掌握好；在学习利用excel表格的过程当中，对于函数的运用与认识，学生们均觉得难度挺大的，但是在设计教学的时候，将实体公司财务求算也加入了进去，再与实际联系起来，从而使得计算不是很泛泛，趋近于易学易懂，从而使得学生学习的积极性以及主动性得以提升。　　二、积极贯彻落实 “以学生为中心”的教学方法，并且对于学生们的个人能力的培养进行重视　　美国的儿童心理学家和教育家杜威提出了“以儿童为中心”的观念，而“以学生为中心”的观念正源于此。在教学中，以教师为中心是杜威非常反对的做法，在课堂教学中不应该使用填鸭式以及灌输式的教学方式。计算机文化基础这门课程的应用性极强，在每一个教学活动中，我们应当把学生当为中心，使学生学习的自主性以及能动性得到充分体现，使学生拥有学习的积极性，让学生能够主动的学习和研究所教课程。举个例子，在教学中，师生位子可以调换一下，这样有助于吸引学生的注意力，使课堂纪律得到有效的管理；在课堂上，提问时教师应当使用合理的语言，将其指导性、启发性以及激励性体现出来；布置教学内容时，要考虑到所有学生的差异，帮助学生建立一个非常合理的学习目标。　　三、合理安排课时，精讲多练　　计算机文化基础课，采用集中上课和上机指导是两个主要的教学环节。目前，计算机文化基础总学时为44学时，其中8学时为理论，课件和板书相结合在多媒体教室集中上课，而剩余36学时主要在机房上课，主要采用教学软件方式授课，由于本课程是一门注重实际操作的课程，不能依照传统的教学模式，“光讲不练”，达不到教学效果，所以二学时90分钟的课程，要依据老师当众演示20分钟，学生练习消化、老师全面指导50分钟，老师总结10分钟，学生再练习10分钟的安排，这就对老师提高了要求，老师的语言组织即生动又要言简意赅，做到老师“精讲”学生“多练”。　　四、完善考核手段，积极将“以考促学”机制建设起来　　对于计算机文化基础考核的划分，可分成期末考试以及平时成绩两大块，二者各占一半。该“以考促学”的行为能够期末成绩以及平时表现将严格把握住，以此推动学生在学习的过程当中主动地、认真地去练习、学习，从而使他们的学习动力得到加强。　　在教育教学时，最为关键的环节就属期末考试了，其是对教学的得失的评价的重要标准，与此同时，它也是对教学质量进行保障的一种要素。传统意义上是实施上上机操作考试。但是因为任何一个机房的计算机的数目均具有局限性，不能够再两个学生间空出一个位置来。所以，要防止相隔的两个同学之间做一样的题目，进而对考试的公平性进行较好的保障。然而，因为教师在出题目的时候任务过重，可能会对题目的质量产生一定的影响。　　所以，在考试的过程当中，均是依靠系统随机性地组合试卷，然后再在学生答完试卷的时候马上给出成绩。该考试手段能够对原先考试的方案的不足之处进行有效地避免，例：系统所提供的适时成绩不仅仅能够对试卷批改的时效性做好保障，而且又可以对试卷批改的精确性进行保证。　　五、结语　　计算机发展日新月异，人们对计算机操作的要求越来越高，在新形势下，我们要与时俱进，认真思考如何更有效地促进计算机应用基础教学，及时对教学内容、教学方法做出调整，提高计算机的教学质量，全面提高学生计算机应用的能力，为以后的各科打好基础。　　参考文献：　　[1]付智华.关于高校计算机基础教学变革的几点思考[J].教育教学研究,2009,2.　　[2]邓长春.论高职学校中计算机项目教学模式[J].科技资讯,2009（5） "}
