{"title": "技工学校计算机专业教学改革策略分析", "url": "https://www.lunwendata.com/thesis/2019/155730.html", "time": ["2019-02-16"], "info": "　　计算机专业可以说是当今社会最热门的行业之一，计算机网络行业迅猛发展的同时带动了计算机人才需求量的增长，而技工学校开设计算机专业为社会培养计算机专业人才，有效的填补了当前社会计算机专业的人才缺口。由于技工学校的毕业生大多会直接走上工作岗位，因此在技校的计算机专业教学中就要理论性与实践性并重，既要让学生扎实的掌握好计算机的基础知识，又要让学生多参加教学的实践，让学生能在项目中得到锻炼，巩固学到的内容。　　一、技工学校计算机专业教学的现状与问题　　当前的技工学校计算机专业教学基本形成了一个完整的教学体系，学生在学习中可以掌握一定的计算机知识，但是必须看到的是随着社会对于计算机人才要求的提高，技工学校的计算机专业教学开始显露出了很多问题与不足。　　1.教学观念过于陈旧，导致学生缺乏学习的积极性。在技工学校的计算机专业教学中基本上延续了传统的板书笔记加教材讲授的方式，枯燥的学习，抽象的理论让学生无法在其过程中产生兴趣，这样的教学中教师处于主导地位，学生处于被动接受的地位，没有学习的兴趣，自然也就很难把这门课程学好。　　2.教材和教学知识老旧，与社会主流计算机应用脱轨。众所周知近年来计算机领域的发展可谓日新月异，技术的更新和产品的换代速度非常的快，而技校授课所用的教材更新速度则远远跟不上时代的步伐，教师的辛苦讲授和学生的努力学习往往受限于教材的过时和落后，使得技校学生在毕业后才发现自己的所学与工作实际所用的知识相差如此巨大。　　3.教学设备过于落后，学生缺乏良好的实践平台。不仅是教材，在其他硬件条件上技工学校也有落后的环境，工欲善其事，必先利其器，学校在硬件设备和软件系统上也都较为落后，在这种环境下，学生很难在所谓的教学实践环节中体验到将来工作时可能面对的实际环境，这样也就使课堂实践的效果大打折扣了。　　二、技工学校计算机专业教学定位　　技工学校计算机专业教学不同于普通的高职院校计算机专业，我们的计算机专业旨在培养具有计算机专业综合职业能力，能从事计算机专业生产、服务一线工作的高素质劳动者和技能型人才。因此，我们对于计算机专业课程的基本设置方向应该以从事计算机工作所需要的专业技术操作能力和培训综合的职业素质为目标。　　技工学校在计算机专业教学方面不能够局限于一般的知识和能力的培养，在计算机专业课程方面应该有自己独有的教学特色、理论和教学模式，突出以服务为宗旨、以就业为导向的办学宗旨，为社会培养素质全面、操作能力较高的计算机专业人才。另外，我们的教学应该不断地吸取先进的教学经验，在教学过程中积极与企业结合，定向培养专业性的人才，激?l学生的潜力，在不断地改进创新过程中，更好地培养计算机专业人才。　　三、技工学校计算机专业教学改革策略　　1.建立以学生为主体的教学模式　　时代的发展正在促使教育改革从传统的以教师传授为中心转向以学生为主体。以学生为主体的教学模式，强调“学”，重于“教”，目的在于体现“教育应满足社会发展与人的发展之需求”，体现“顺应市场、服务社会、服务学生”的价值取向。因此，在这种教学模式下，教师在教学中应起组织、引导、答疑的作用，从知识的传授者、教学的组织领导者转变成为学习过程中的咨询者、指导者，充分调动学生学习的能动性，使学生变被动学习为主动学习。　　2.提高计算机专业教师的综合素质　　计算机教学的教学模式，现在仍然与其他学科一样，以教师为中心，学生被动地接受知识，这种教学观念对学生学习掌握计算机基础知识的影响尤其严重。应该转变为“教师指导下的以学生为中心”的教学模式，以学生为认识的主体，充分调动学生的主动性，使学生主动建立知识结构和能力结构。　　由于计算机软件、硬件的更新速度快，计算机专业教学内容不断更新，各种新的教学手段的出现，对从事计算机教育的教师的业务水平、教学水平等各方面的素质提出更高的要求。计算机教学专业分布广、教学量大、知识面广，要求从事计算机教学的教师要思想敏锐、不断学习、不断掌握新技术，在学术上要有强烈的进取精神，在事业上要有坚定的敬业精神。注意计算机的发展动态，不断更新知识，提高自己的业务水平。学校要注意组织对专业教师教师进行业务培训，促使他们很快地学习新的专业知识，掌握新的应用软件。　　加强对教师的实验指导能力的培养和考核。要求教师必须具备计算机基本操作能力、基础应用软件的使用能力。程序设计任课教师应能完成一般的应用程序设计，其他应用软件任课教师应能使用应用软件进行一般的设计和制作。在条件许可时，要求教师必须在计算机上进行备课、出试卷、制作多媒体辅助教学软件，并要求每个教师的每一门课程，都要安排一定数量的课时，在多媒体教室对学生进行授课。　　3.设计科学、合理的专业教学　　计算机专业的课程一般都属于要求具有较高动手操作能力的专业技能课程，因此，在专业教学课程的设定方面，应该以实践上机操作为主，让学生多动手练习，实践理论知识的学习，引导学生对所学知识的思考。专业课程的设计应该将重点方向定位于社会实际应用。学生所学的专业知识与技能，在今后的岗位中，主要的应用就是实践操作。只有让学生多方位地全面掌握基础，在基础的层面上加深专业技能的培训，才能让学生在众多的竞争者中脱颖而出。中职教育的最终目的在于学生就业，因此，教学内容的设定应该与就业紧密结合，这样才能够为社会培养出高素质的计算机专业劳动者和技能人才。　　4.更新计算机教学软硬件设备　　计算机教学应该紧跟计算机发展的步伐，中职教育重在学生动手能力的培养，因此，教学中所需的计算机软硬件设备的及时更新就必不可少了。只有让学生掌握了最先进的、最有用的计算机专业知识，具备较高的实践动手操作能力，才能够提高中职计算机专业办学的质量，从而促进学生的就业率。　　5.建立以实验室、视频室为主战场的教学模式　　计算机课程具有操作性强、适于视频教学和实践教学的特点。在教学过程中不能再沿用“教室+黑板+粉笔”的传统教学模式，而应采用以实验室、视频室为主战场的教学模式。　　6.建立以多媒体技术为教学环境的教学模式　　多媒体技术为教学提供交互式的教学环境。教学内容里用文字和语言难以表述清楚的部分，用教学课件可以直观地呈现出来，既明了又生动形象。其次，多媒体技术能为学生创造一个能听、能看、能动手操作以及进行讨论、交流的环境，可提供多种感官的综合刺激，有利于知识的获取与保持。　　7.建立以网络为教学系统的教学模式　　应有效利用网络教学资源，充分发挥虚拟教室、远程教学、分布式教学等现代化教学技术的作用。如开设网上选修课，进行网上考试等等。开设网上选修课，可扩大选修课的覆盖面，学生不但可根据自己的基础和需要进行选修，且不受时间限制。　　总之，计算机基础课传统的课堂教学模式、方法、理念等，均已经到改革创新的时候了，它们都已不适应现代计算机技术日新月异变化的需要，也不适应社会企业对人才培养目标的要求。因此，教学中无论是课程设计方面还是教学方法都应该与就业紧密结合。教师必须更新教学方法、创新教学模式、改变教学理念，让学生变被动学习为主动学习，变“要我学”为“我要学”，培养学生拥有较强的专业技能、较高的综合素质。坚持以学生为主体，以教师为主导，真正让学生愿意学，学得好，学得轻松愉快，只有这样才能够适应社会发展的需求，在众多竞争者中脱颖而出。"}
