{"title": "分层教学法在学校计算机教学中的应用", "url": "https://www.lunwendata.com/thesis/2019/159864.html", "time": ["2019-04-02"], "info": "　　前 言　　随着我国的迅速发展，计算机技术也得到了相应的发展，随着计算机技术的不断应用，也为人们的工作、学习提供了很多便利。学校的计算机教学要想跟上时代的步伐，培养出更多的专业型人才与复合型人才，就需要提高计算机教学的质量。但是由于学生的个人素质与计算机水平都不尽相同，这也给学校的计算机教学增加了难度，所以，计算机教师就需要改进教学方法，使用分层教学法进行教学，这样能够使不同层次的学生都能够相应的提高计算机水平，并且提升学生对计算机学习的兴趣，激励学生更加自主的学习计算机。　　1、在学校计算机教学中应用分层教学法的必要性　　1.1 学生个体之间的差异性　　从现阶段来看，学生群体之间的个体差异性较大，展现出的层次较多，对于计算机的知识和能力都不尽相同。此外，由于学生们的家庭和社会因素作用，学生个体之间的差异会表现得越来越多，也会更加明显。从学生的学习自主性和积极性来看，学生大体上可以被分为主动型和被动型，介于两者之间的可以被分为非主动型。采取传统的无差别教学方式显然不能使每位学生都获得良好的学习效果，所以我们要针对是三种不同类型的学生分别采取相应的教学方式，对于教学内容也要做出相应的调整。争取让主动型学生在完成基础知识的同时学习更多发展性的知识，鼓励非主动型的学生努力完成基础性知识并向主动型学生的学习态度看齐，力保被动型学生尽全力完成基础知识学习。　　1.2 有利于培养学生兴趣　　在计算机教学中采用合理的分层教学方法可以将学生的学习潜力恰当地激发出来，这主要得益于能够培养好学生的兴趣，为培养日后社会需要的人才做好良好的铺垫。从计算机课程来说，学生的学习兴趣对于学习的动力来说十分重要，对于那些自己本身对于计算机知识感兴趣的学生来说，他们不单单满足于在课上学习计算机相关知识，他们还会在课下自行钻研自己感兴趣的知识。而没有兴趣的同学知识将学习当做任务，必须要努力完成。采用分层教学法，我们要努力挖掘每个学生在计算机知识中的兴趣点，因为计算机应用领域广阔，知识面也十分宽广，教师要调查好学生们的兴趣点所在，设计良好的教学方法，正确激发起学生的学习兴趣。　　1.3 有利于塑造学生技能　　计算机课程的教学目标主要是为了加强学生们对于计算机的实际操作和应用能力，最终培养出技术过硬的计算机技能人才。由于分层教学法充分考虑到了学生之间的个体差异，克服了教学内容笼统性的缺陷。针对学生学习兴趣和能力所在，分别设计出适合学生正确成长和发展的教学计划。在保证学生吃透计算机理论知识之后，加强学生上机操作技能培养，最终形成学生们良好的计算机应用素质。　　2、计算机教学中分层教学法的主要实施方法　　2.1 需要认真把教育对象进行分层　　因为分层教学法是把学生的知识结构与学生其他的具体情况进行划分，所以，教师在进行分层教学之前首先需要充分的了解学生计算机的掌握情况，并且结合学生的知识接受能力、综合能力、智力和非智力因素等进行综合的评价，才能够把学生划分成不同的层次。其中，A层次的学生一般应该具有非常强的接受能力和学习能力，并且具有比较扎实的计算机功底，具有良好的学习习惯；B层次的学生的计算机功底与操作技术比较一般，在学习上缺乏主动性；而C层次的学生一般计算机功底较差，并且学习效率相对低下，缺乏自主学习性，在知识的接受上也存在着一定的困难。由于着三个层次的划分依据并不是固定不变的，因此教师可以根据学生的具体情况进行调整。　　2.2 划分不同的教学目标　　教师在制定教学目标时，需要结合学生的知识结构与知识的接受能力，使不同层次的学生都能够达到制定的教学目标。教师在教学时，应该鼓励学生积极的思考，通过自己的学习与努力，从而提高自己的计算机水平，但是教师一定要说明只有通过学生的不断努力，才能够实现教学目标。而教师在制定教学目标时，应该针对不同层次的学生进行不同的学习目标与要求设置，使学生能够结合自身的实际情况来进行计算机的学习。在教学目标确定之后，教师需要根据具体教学目标的层次性与总体性，再分别制定每个层次的教学目标与总体的教学目标。　　2.3 实行教学过程的分层　　教师要做好分层备课的工作，在备课时应该充分的结合不同层次学生的实际情况、教学大纲要求以及教学目标，来进行不同课堂活动与教学内容的设置，从而制定出更加科学的教学方案。教师需要把学生的上机辅导进行分层，因为计算机的学习具有非常强的操作性，只有学生通过自己的动手操作，才能够更好的掌握学习内容，所以教师需要加强对学生上机的培训。在对上机操作进行教学目标的制定时，应该对A层次与C层次的学生进行特殊性的操作性练习，而对B层次的学生只需要进行一般性的上机操作即可。因为A层次的学生具有较强的接受能力，教师可以要求他们完成一些难度较大的操作；应该多培养B层次学生的应用操作，提高该层次学生的计算机应用、处理以及获取信息的能力；需要明确的给C层次的学生制定学习目标，提高他们对计算机学习的兴趣，使他们能够掌握基础计算机知识与技能，逐步缩小与A、B层次学生的距离。　　3、结束语　　总而言之，在学校的计算机教学中使用分层教学法能够非常有效的提高学生对学习的主观能动性与对计算机学习的兴趣，通过因材施教的原则，更好的树立不同层次学生的学习目标。同时教师也需要针对不同层次的学生使用不同的教学方法，设定不同的教学内容，最终使每位学生的计算机水平都能够显著的提高。"}
