{"title": "计算机软件在数学建模中的应用探析", "url": "https://www.lunwendata.com/thesis/2019/157789.html", "time": ["2019-03-10"], "info": "　　从中学到大学，从中国到美国，形式多样的数学建模竞赛，将对知识、能力和素质三者的考察融为一体，以它独特形式与丰富的内容吸引了广大学生。然而，数学建模与传统数学的学习有很大不同，体现在涉及领域的“广”，学习内容“多”，模型计算的“难”。一般来说，数学建模包括以下基本流程：　　图1 数学建模基本流程　　随着计算机技术的发展，人们设计开发了多种数学应用软件。这些软件充分利用计算　　机的高速运算能力，对于海量数据的处理，复杂而又烦琐的数值计算，以及复杂数学模型的求解，提供了有力的工具。　　一、数学建模的常用软件及其主要功能　　（一）Matlab，利用它可绘制已知函数的图形，完成符号运算、精确到任意精度的计算。可以求解对数学中的微积分、线性代数、概率统计、解析几何、（偏）微分方程、神经网络、小波分析、模糊逻辑、动态系统模拟、系统辨识等诸多领域的常见问题。其在矩阵计算和图形绘制方面的优势尤其受到数学建模爱好者的青睐。　　（二）社会学统计软件包SPSS由IBM公司推出，可针对社会科学、自然科学各个领域的问题完成基本统计分析、相关性分析、回归分析、聚类分析、因子分析、非参数检验等统计功能。　　（三）LinGO/LinDO是数学规划软件，长于线性规划、二次规划和整数规划中求最优解，也可以用于一些非线性或线性方程组的求解以及代数方程求根等。因此在数学、科研和工业界得到广泛应用。　　（四）几何画板等动态几何软件，一般用来制作一个想象中的图像，也可以采用PHOTOSHOP、Flash 等制图工具，可以将建模内容形象化的展示与呈现，便于人们理解与接受。作图工具可以说是完善和提高建模内容的有效手段，不仅可以生成学生难以绘制的图形，而且提供了图形的动感“变换”，模型的“动画”效果，视觉感受耳目一新，许多解决问题的方法和依据可从画面中去寻求。　　（五）Word、Excel等编辑软件的应用，使学生在数学建模论文的格式编排、图表文混排、公式编写，以及图表数据的处理方面得心应手。　　上述计算机软件，能够有针对性的解决相应领域的普遍性问题，各有所长。在数学建模的过程中，常常需要结合应用多个软件包问题才能解决问题，甚至有些问题，还需要高级语言（如C、C++和 Java 等等）编程才能解决。　　二、数学建模过程中计算机软件应用案例　　案例――利用几何画板直观展示数学模型及其变化。利用几何画板对数学现象进行展示或对命题进行检验的过程，往往通过学生自己动手操作，进行探究、发现、思考、分析、归纳等思维活动，最后获得理解概念或解决问题效果。　　在初三学生学习函数知识的时候，曾经学习过一个点关于坐标轴或原点对称时，对称的两个点坐标的变化规律；高中学生学习函数的过程中，对抽象函数符号表示的函数y=F（x） 的研究，一直以来是学习的难点，特别是在给定条件时研究该函数的性质，更是感到困难重重。利用几何画板探究一个函数的图象，寻找函数解析式的变化与图象之间的关系，有利于帮助学生理解抽象问题，探索一般性结论。　　操作过程中可先要求学生通过几何画板作出y=x这一直线，然后作出y=x-2，y=x+2，y=2x+4，体会其不同规律，再按要求分别通过几何画板找到对称点，建立各种对称直线方程。　　在学生使用几何画板过程中，引导他们体会：（1）直线关于坐标轴、原点对称时，其对称图形的方程只是自变量和函数值的符号发生了变化；（2）关于直线 y=x和y= -x 对称时，对称图形的方程中自变量 x 和函数值 y 位置发生互换；（3）关于直线 y= -x 对称时符号发生了变化，那么如果在 y=x及y=-x 后面加上一个常数C，即关于直线 y=x+C或y=-x+C对称的直线方程会发生怎样的变化呢？（4）对于高中学生，还可进一步提出问题，一个二次曲线 f （x，y）=0 关于斜率绝对值为 1 的直线y=x+C或y=-x+C对称的曲线方程与原曲线方程之间有何位置关系。　　借助动态几何软件，在计算机上进行大量的方程构建实验，让学生在数学建模过程中探究规律，提出猜想，再进行论证。引发学生的好奇心，从而激发学生的求知欲。将“讲授知识”的权威模式向以“激励学习”为特色的顾问模式转变。　　三、结语　　数学建模不仅有利于学生更好的掌握知识、运用知识，也有利于开放性思维和创新意　　识培养。开展数学建模时充分利用计算机软件，可以有效地帮助数学模型的构建、解答、运算及成果展现，同时又使学生的计算机水平得到提高，可以预见，随着计算机技术的发展，在数学建模中计算机技术的使用会愈来愈多，越来越大地提高数学建模的质量和效率。"}
