{"title": "计算机辅助教学在高校教育的现状和对策研究", "url": "https://www.lunwendata.com/thesis/2019/156104.html", "time": ["2019-02-20"], "info": "　　计算机辅助教学（computer assisted instruction）是利用计算机来模拟教师的行为，通过学生与计算机间的交互活动来达到教学目的的新的教学方法[1]。它是利用计算机作为主要的教学媒体来进行教学活动，即利用计算机来辅助教师执行教学[2]。作为一种现代化的教学技术，计算机辅助教学越来越受到人们的重视。计算机不但能呈现单纯的图表、数字、文字等字符教学信息，而且还能输出照片、动画、录像和声音等音像教学信息，使字符教学信息和音像教学信息相互配合，相互解释。这样就达到的图、文、声、像并茂地传递教学信息，增强了教学信息的感染力和表现力。从而使教学信息由抽象、深奥变得直观、形象，使学生容易理解、掌握和应用。虽然计算机辅助教学已发挥出越来越大的作用，但就当前其在高校教育的实际使用和效果上，反映却不尽人意。为此，作者就当前计算机辅助教学在高校教育的实际应用中存在的一些问题作初步分析和对策研究。　　一、计算机辅助教学的应用现状　　（一）教学软件极为缺乏　　目前，市场上有很多的教学软件，但是适用于教学中的软件比较少。很多情况下，教师的课件都是自己编制，软件的开发本来需要多方协作的，可教师单独完成这一过程，需要花费大量精力的。　　（二）课件的制作、使用与教学的要求脱节　　由于计算机辅助教学的优越性明显，所以，很多教师就用课件进行教学，但他们对课件的制作和使用并不是很了解。通常没有抓住课件的优点而进行盲目的授课，结果事倍功半， 取得了相反的效果。　　（三）教学设计缺乏创新性　　教学方法是因人而异的，课件也是一样的，所以，在使用他人的课件时总会遇到一些想象不到的事情，所以，如果使用他人课件的话，课件的内容和进度都是别人的，而没有自己的观点，从而这极大的影响了教学效果。　　（四）内容过于简单， 表现形式单一　　很多的时候，教师用计算机来替代幻灯机和投影仪，用来展示部分板书， 展示一些图表，计算机的复杂的功能而被忽略了。甚至有教师将课本上的内容原封不动的搬到计算机上，而不能系统地将知识以图形、文字、声音、动画等方式形象直观地再现或模拟出来，导致教学单一，没有明显的教学效果。　　（五）缺乏交互性　　教学课件和自学课件都具有相同特点就是交互性，交互性使得人与计算机之间有了相互沟通，也让教师灵活性的控制教学，从而实现多种素材的呈现、运行与消失。课件的交互性也可以让学生发挥学生学习的积极性和主动性。　　（六）注重形式， 漠视内容　　当前，大部分学校的多媒体课件都是自己制作，从总体效果来说，存在着很多不和谐的地方，比如色彩、构图、文字等各元素不相衬，这样不仅没有达到较好的学习效果，还极大的削弱了学生的创造性。总之，课件是为教学服务的，形式是为内容服务的，如果学生只把精力放在变换上，教学效果反而不好。　　二、有效运用计算机辅助教学的要点　　高校教育的目标是显著提高教学质量和学生素质，教学质量是高校教育的生命线。计算机辅助教学的运用是服从和服务于这个目标。要想取得较理想的教学效果，关键是充分认识处理好计算机辅助教学的以下几个要点：　　（一）计算机辅助教学的适用场合　　计算机辅助教学一般适用于以下三个环节：创设情境、突破重点难点、促进自主学习[4]。计算机辅助教学有助于抽象概念的阐述，有助于深奥内容的直观形象表达，有助于重点难点的理解和帮助学生自主学习。　　（二）计算机辅助教学要结合学科特性　　对于建筑施工的各种过程、操作要点、成品图像等来说，真实的视频录像和形态学资料，往往能取得最佳的教学效果。建筑学科的许多理论观点有赖于大量资料和案例来说明，这需要引用丰富的文献资料、图表、照片和相关的视频材料。　　（三）计算机辅助教学要调动学生的主动性　　计算机辅助教学不仅是供教师演示的教学工具，而且也是学生进行自主学习、自主探究的认知工具和协助交流工具。　　（四）计算机辅助教学的内容要直观　　计算机辅助教学的内容涉及图表、录像、动画、照片、和声音。首先，所有这些内容必须正确；其次，还应满足形象、生动、直观、简洁。　　（五）计算机辅助教学要与其他教学手段相互配合　　既要充分利用计算机辅助教学的优势，也要使用其他教学方法，如板书、师生互动等，以学生为教学主体，提高学生学习的趣味性和积极性，从而提高教学质量，培养高素质、创新性人才。　　三、计算机辅助教学的改革新思路――积件思路　　积件是一种思想，它是一种关于发展的系统思路，是针对课件的局限性而发展起来的一种新的教学软件开发和应用模式。积件提出者认为，积件由积件库和积件平台组成。积件库是教学资料和表达方式的集合[5]。　　?e件是由教师和学生根据教学需要自己组合运用多媒体教学信息资源的教学软件系统。该系统不是在技术上把教学资源素材库和多媒体著作平台简单叠加，而是积件库与积件组合平台的有机结合，其中积件库中的多媒体资料库、微教学单元库、资料呈现方式库、教与学策略库、网上环境积件资源库，为师生利用积件组合平台制作教学软件提供了充足的素材来源和多种有效途径；灵活易用的积件组合平台则是充分发挥师生创造性的有力工具。　　积件是针对课件的局限性而发展起来的新的教学软件模式和新的教材建设思想。它与教育思想、教学方法、学习理论无关，积件素材将教学信息资源与教学思想、教学方法、学习理论分离，成为教师和学生学习的工具，因而适应任何类型的教师和学生，具有高度的灵活性和可重组性。将过去课件设计者从事的教学设计回归到教师学生自己的手中。教学设计和学习理论的运用，不是在课件开发之初，而是由师生在教学活动中进行，真正做到以不变（积件）应万变（教学实际），计算机成为课堂教学的有力工具，成为教师和学生个性与创造性充分发挥的技术保障。积件素材与教材版本也无关，积件素材是以知识点为分类线索，这样，无论教材课程体系如何变化，教材版本如何变化，积件素材都可被师生应用于当前教学活动中。　　积件思想是对计算机辅助教学存在的问题进行探讨和反思后提出的改革新思路，其目的是让教师根据不同的教学要求运用计算机辅助教学，简化学科课件的编制，把教师从资料收集管理和复杂的教学课件制作的技术问题中解脱出来，专心于教学研究。教师可以在制作教学课件的过程中充分利用互联网络提供的各种有用的资源信息和市场上的素材库或教学软件，结合自己的教学需要、教学目的来制作个性化、适用性强的课件，从而彻底改变教学软件在设计、开发和使用上的相互割裂的局面，从而提高高校教育的教学质量，培养高素质、创新型的人才。"}
