{"title": "计算机辅助的家庭教育方法对策培训系统的可行性与对策研究", "url": "https://www.lunwendata.com/thesis/2019/155843.html", "time": ["2019-02-17"], "info": " 　　摘要：为了进一步普及科学的家庭教育观念和教育方法，结合教育学、心理学和计算机科学的理念与知识，设计了一款面向家长的家庭教育方法对策培训系统。该系统主要从亲子关系沟通和子女性格培养两个方面，让家长根据实际情况完成测试问卷。系统根据问卷的测试结果，进行教育方法的自动匹配，给出具体可行的教育手段，从而提高家长的教育能力。　　关键词：家庭教育；亲子关系沟通；子女性格培养　　中图分类号：G78 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-02　　随着信息技术和互联网技术的逐步普及以及现代科技不断向家庭教育进行渗透，传统的家庭教育受到猛烈的冲击，一旦改变它的形式，也将改变人们在家庭教育上的观念、态度和行为。目前，家庭教育面临着教育内容片面失衡、教育观念守旧、教育方法方式单一等问题，使得家庭教育功能缺陷。而计算机辅助的家庭教育方法对策培训系统是用于家长教育的，涉及到教育学、心理学、计算机科学等交叉领域学科，它针对家庭教育中存在的关键问题，给出相应的解决方案。　　一、研究现状　　全国妇联调查组织的调查表明：90%以上的家长反映自己在教育孩子方面不成功；95%以上的家长表示对如何教育孩子苦无良策；近80%的家长在喂养和教育孩子方面没有经过系统的、科学的培训，只是用经验法教育。面对儿女教育知识和技能的缺失，需要迫切地解决面向家长的家庭教育新模式。　　伴随着家庭教育法律政策环境的不断优化，全国家教工作“十五”、“十一五”和“十二五”规划等一系列指导性文件的不断完善，家庭教育支出的不断增加，家庭教育越发引起广大家长的重视。尽管如此，面向家长的教育培训仍寥寥可数。　　另外，调查显示，在中国，教育软件已经占领了整个软件市场三分之一的份额。而现今的教育软件也主要分为家用教育软件、校用教育软件和远程教育软件。但是，大部分软件都是以孩子学习为目标，意在提高孩子的学习成绩，提高升学率，几乎很少出现面向家长的教育培训软件。尽管存在少数的家长培训机构，但因为大班教学的模式，培训内容缺乏针对性且价格高昂，费时长，难以保证效果，也不为多数人所接受，因此覆盖面低，推广性不强。　　再而，家长获取教育方法的渠道一般为杂志、教育网站、论坛等，家庭教育知识零碎繁杂，家长难以抛下工作或者无法在如此浩瀚的网络和大量的杂志中获取相关有用的知识。因此，家长的教育方法缺乏针对性和专门性，无法保证其科学性。　　所以，无论是理论上，还是实际上，人们都很难从家长教育的角度去透视家庭教育中的问题，很少从怎样培训家长及其教养素质的角度去开展家庭教育工作，这是家庭教育领域研究的一种缺陷，也是本培训系统要解决的问题。　　二、计算机辅助的家庭教育方法对策培训系统的可行性分析　　由于目前人工智能水平的局限以及家庭教育方法对策研究的片面性，目前的培训系统仍难以做到针对特殊儿童的家长教育。同样，家庭教育方法对策培训系统适合在6至18岁的儿童的父母，旨在引导家长们发现教育中的存在问题并给予科学的方法对策。　　在设计家庭教育方法对策培训系统前，我们根据前期的需求调研，确定了系统的目标与架构。本系统旨在提供一个平台让家长更为客观科学地评价与教育孩子。对于系统的架构：1.我们通过调研提取家长关注的重点内容，即亲子关系沟通与孩子性格培养。2.针对其内容设计一套完整的测试系统用来准确评估目前用户与子女之前的沟通状况和子女性格。3.根据测试系统结果匹配相应的教育方法。4.将教育方法规划到日程安排上，使家长养成科学的教育习惯并跟踪家长对教育方法的实施情况。5.最后家长根据效果调整教育行为。值得一提的是：该系统设计200多条具体可行的教育方法，并以任务的形式将相应的教育方法和教育周期显示在日历中，旨在使家长养成科学的有针对性的教育习惯，能持之以恒地运用。　　对于家庭教育方法对策培训所需的内容，目前随着家庭教育理论的不断深入研究、网络的日益普及与资讯、论坛，特别是家庭教育网站的大量出现，使得系统所需要的资料来源十分丰富。为此，可以取其精华、去其糟粕，设计具有大规模的资料库以满足系统的需要。　　对于家庭教育方法对策培训的技术支持，采用新的界面框架WPF（Windows Presentation Foundation）来实现友好的交互体验，提升培训效果；利用Microsoft Visual Studio2010开发工具进行开发，实现了亲子沟通关系评测、子女性格评测、教育方法筛选和教育方法任务规划等基本功能，不存在难以冲破的技术问题。　　三、计算机辅助的家庭教育方法对策培训系统的难点分析以及对策　　计算机辅助家庭教育方法对策培训系统的基本思想是构建一个具备一定规模的量表测试―教育方法数据库，这个库包含有关亲子关系沟通和子女性格的测试量表，并且根据不同的测试结果匹配相应的教育方法。　　（一）难点剖析　　利用计算机建立系统的量表测试―教育方法数据库的难点主要体现在以下几个方面：　　1.亲子关系沟通量表。目前对亲子关系沟通的测试量表种类繁多，题目分布散乱且缺乏系统性，不能明确地指出父母与孩子之间存在哪方面的沟通问题。而本培训系统旨在将亲子之间的沟通细分成几个具体的方面，让家长能够对症下药，改善亲子之间的关系。　　2.子女性格量表。用于对性格测试的量表诸多，如艾森克个性问卷（EPQ），韦氏儿童智力量表等。然而，本培训系统需要一份能够专门针对孩子性格测试的量表，能够权威准确地测试出孩子的性格特征。　　3.针对亲子关系沟通和子女性格的不同匹配相应的教育方法。现今关于家庭教育的书籍、杂志非常多，但是不一定每种方法都适用于每个孩子。本培训系统要求其教育方法不仅要有针对性，更要保证科学合理性，这需要通过查阅、整理一系列资料，最后给出切实可行的方法。　　（二）对策研究　　在建设家庭教育方法对策培训系统中，针对上述的问题，可以采取如下的解决方案：   　　1.对于亲子关系沟通量表的设计，我们首先引用亲子沟通的5个维度：发起交往，提供情感支持，施加影响，自我袒露，冲突处理。其中，“发起交往”指父母与孩子沟通的主动性，用于考察父母是否能够引导孩子进行交流；“提供情感支持”用于测试沟通双方是否愿意沟通、提供帮助、互相倾听以及情感上的支持和鼓励，测试双方对互相的理解与接纳程度；“施加影响”考察家长能否以身作则，说服子女同意自己的观点或做法，以及父母能否尊重孩子的隐私等；“自我袒露”旨在说明一方能否主动或被动地通过语言或行为向对方传达任何关于自己的信息；“冲突处理”指父母与孩子之间能否用合理的方式处理冲突，包括亲子间能否换位思考等。根据这5个维度，系统能够生成量表同时给出每个方面的沟通等级，让家长能够明确地了解到自己与孩子之间的关系处于怎样的阶段，哪个方面还做得不足等信息。　　2.对于子女性格量表的设计，我们采用了Achenbach儿童行为量表（CBCL），它自七十年代发表以来，研究证实其信度和效度较好，也是在众多的儿童行为量表中用得较多，内容较全面的一种，是目前被公认为评估儿童行为和情绪问题最常用的工具之一。并且，家庭教育方法对策培训系统是一款面向家长的教育软件，而CBCL也是让家长根据孩子的行为表现填写的量表，符合系统的需求。CBCL量表中的测试题目分属9个综合征，分别是抑郁、分裂、交往不良、强迫性、体诉、社交退缩、多动、攻击性和违纪行为。家长完成这份量表后，系统会给出孩子性格特点的分析，能够使得家长了解子女在这九个方面的性格表现。　　3.针对亲子关系沟通和子女性格的特点匹配教育方法的原则。　　关于亲子关系沟通的培训：由于沟通细分成5个不同的维度，每个维度划分不同的等级反映家长与孩子之间的沟通情况，因此系统会依据不同的情况匹配具体的教育方法，这些方法均遵从以下几个教育原则：定时沟通；尊重子女人格；鼓励表达；耐心倾听；宽容异见；解释规则。　　关于孩子性格方面的培训：系统会针对孩子的性格特点匹配具体的教育方法，这些方法也将遵循美国的《父母》杂志和“保持孩子健康”网站相结合的10个训导原则：家长要给孩子做好榜样；家长要给孩子创造一个充满爱和信任的环境；父母要保持一致，态度要持之以恒；孩子的习惯是从小养成的，家长立规矩要趁早；家长要少对孩子说“不”； 家长要表扬孩子的好行为；孩子发脾气或者大哭大闹时候要“忽视”他们，千万不能让步；家长不要打孩子，不要体罚；家长要分清奖励和贿赂；父母要讲究说话技巧。　　同时，为了能够让家长更加行之有效地使用这些教育方法，系统会以日程安排的形式，使家长按照日程表实施。不仅令家长有“法”可依，还能为家长的实施提供了监督机制。实现了操作简单、科学教育、方便快捷的目标。　　四、结语　　一个现代家庭，能否充分发挥其特有的教育功能，已成为推动社会发展和创造家庭幸福的重要基础。而信息技术的快速发展，使得利用计算机进行家庭教育也已经变得切实可行。家庭教育方法对策培养系统针对每个孩子的特点，使家长学会更加科学合理有效地教育自己的子女，让他们健康快乐地成长。并且，系统以日程表的形式安排教育方法，既可以让家长方便快捷地获取教育信息，又可以让家长持之以恒地实施教育，从而养成科学的教育习惯。　　参考文献：　　[1]宣兆凯.家庭教育研究的理论方法模型―家庭支持系统[J].教育研究,1999,(11):63-66　　[2] Buhrmester,D., Furman,W., Wittenberg & Reis. (1988), Five domains of interpersonal competence in peer relationship, Journal of Personality and Social psychology, 55(6), 991-1008　　[3]中国就业培训技术指导中心、中国心理卫生协会.心理咨询师（二级）[M].北京:民族出版社,2005.7:199~204　　[4]雷雳,王争艳,李宏利.亲子关系与亲子沟通[J].教育研究,2001,(06):49-53　　[5]张卫民.美国家长训导孩子培养好性格的十原则[EB/OL].　　http://group.hudong.com/tiancai/doc/jRQNBCFgWAlNdAkJF.html,2010,2010-04-21/2011-11-25　　[6]刘远超,吴冲,郭秀艳.计算机辅助心理咨询的可行性与对策研究.哈尔滨工业大学学报:社会科学版,2011,13(5);15-19　　[7]调查研究成果　中国家庭教育文献研究综述与家庭教育现状评述(摘要)[A].赵东花 主编[C].中央文献出版社,2007:291-293 "}
