{"title": "试论计算机应用能力教学改革与实践", "url": "https://www.lunwendata.com/thesis/2019/159286.html", "time": ["2019-03-26"], "info": "　　计算机的使用已经成为我们日常生活中不可或缺的一部分，计算机系统的升级与计算机软件的出新也是每日一新，这使得计算机应用的教学跟不上计算机行业的发展，课程体系的开发是高等职业院校专业改革的核心。设计合理的、符合技术应用型人才培养规律的课程体系，突出专业知识和能力为核心，增大实践教学的比重，适应高等职业技术教育对动手能力培养的需要，采用多样的课程形式和课程整合，培养满足三个符合度的计算机应用技术专业人才。　　一、激发学生兴趣，营造学习氛围　　信息技术课不同于其它学科，它更有利于培养学生的创新能力。计算机的操作是建立在各种软件的基础上的，从这一点上讲，计算机教学其实就是在教学生如何使用软件。而现在各种软件涵盖了各个方面，同时新软件更以惊人的速度层出不穷，因此在教育过程中，不可能使学生掌握每一种软件的使用，信息技术的教学更应当培养学生举一反三、不断探索，具备创新精神和实践的能力。　　随着多媒体技术、网络技术的发展，传统的班级式教学已经逐渐转变成多元化的教学模式，学生的学习途径也越来越多，为了提高学生自我学习能力和创新的学习意识，教学模式与教学方法的改革与进步，带动的计算机技术的创新和发展，教师可采用如传统模式和多媒体相结合方式，学生可分工协作进行实践操作。　　二、学以致用，培养实践能力　　培养学生的动手能力。计算机应用能力的培养目标是培养具有实践能力的计算机人才，学生在通过学校的课程学习后步入工作岗位，能够很好的适应社会，对所学知识的运用得心应手。　　①计算机基础课程内容的学习。对于计算机基础课程，必须为学生打下牢固的理论基础，这对于学生实际操作时提供良好的保障。同时为进一步深造学习奠定基础。②计算机技术课程内容的学习。对于计算机技术课程，使学生熟练的掌握计算机的软、硬件技术，并对软、硬件的选择与安装操作熟练，懂得维护和维修。③计算机应用能力课程内容的学习。计算机应用是计算机教学的最终目的，教学方面对目前已有的和最新流行的操作系统、软硬件等进行学习，并对计算机未来软硬件的发展信息及时掌握，使学生能够在毕业的时候尽快融入到实际工作中。在学生初步掌握鼠标的五种操作方法后，就可以利用windows98自带的扫雷、纸牌等游戏让学生迅速掌握鼠标的左右单击、双击、拖动等操作。学生在游戏中不知不觉地掌握了鼠标的使用，而且在不断的思考、总结游戏中的规则中提高了游戏成绩，这对培养学生的操作能力、思维能力有很大的帮助。在玩中学，在学中玩，不仅能够让学生迅速入门，还能培养学生的动手能力，训练其思维，激发学生的学习兴趣。　　三、教学方法的创新　　（一）加强有效管理，追求共同进步　　心理学家研究发现，学生在一个课时内最佳的听课时间是开课后的5到20分钟，所以需要教师对学生实际情况的良好掌握，对教学内容的掌握，从而保证教师在最佳时段内能完成课程的主要内容，解决核心问题，然后在课后通过习题练习、学生间的自主讨论等方法促进学生学习的进步。组织比赛活动。如教学完画图后，组织学生进行计算机绘画比赛，进行“校园小报”比赛，让学生充分施展自己的才华，激发学生的创造愿望，让学生在实践活动中体验成功的乐趣，唤起他们对信息技术的爱好。b、与其他学科融合。如教学指法时，如果一味地让学生练习打汉字，比较枯燥，可选一些游戏软件如《开口就说》的英语学习软件作为学习内容，使学生在练习过程中强化对英语单词的记忆，这样既能打破单一授课模式，也有助于信息技术与其他课程的整合。　　（二）分层次教学，使每个学生都能得到更大的进步　　在学生对计算机应用课程学习时，由于学生之间的悟性和学习能力的不同，所以学生对课程内容的掌握能力也不同，为了能够使每个学生都能得到更大的进步，在教学方式上进行分层次教学，对学习能力强的学生分成一组，使其能够产生出更多的创新，另一方面对于学习能力较弱的学生，教师通过良性的引入和指导，使他们尽快掌握知识内容和学习方法。　　在进行Excel的教学时，知识点繁复杂乱，这种情况下用死板的教学方式只能让学生勉强学会方法，记忆力不深刻，也不会对Excel这门技术感兴趣。此时可以讲述一个空调销售的故事，再通过教师示范操作，利用Excel处理了一组空调销售数据，同时显示出增长率与对比结果。这样的实例解析让学生印象极为深刻，也就被其中的Excel功能吸引，从而就有了学习的兴趣。　　四、教育学生健康上网　　在教育实践中，我们发现网络对学生的影响是一把双刃剑：一方面，网络对学生人格发展的具有巨大的正面影响力。网络使学校德育突破了传统的时空的局限，开创了学校德育的新模式，打破了交往的封闭性增强了学生的社会交往。大量的事实告诉我们：上网可以激活现代中学生的思想，让中学生可以便捷地接触到多元的世界文化，接触到开放意识、效率意识、竞争意识、平等意识和全球眼光。他们可以通过阅读网上大量的超文本信息，增加了信息量，潜移默化地学习到现代的发散性思维方法，懂得在处理复杂事物时必须考虑它与周围事物的种种联系，从而改变传统线性思维固有的死板和狭隘。网络还使中学生对世界的认识大大超出他们所能直接体验的生存世界。网络的全方位、超时空、互动性和隐蔽性为中学生的社会交往提供了更为广泛的机会。学生可以利用快捷的电子邮件与他人进行远距离交流，这种“戴面具”的交往方式可使中学生在平等、宽松的社交环境中尽情展现自我。在课堂上，要教育学生自觉遵守网络公约，负责任地使用信息技术，要做到善于利用网络资源学习而不是浏览不良信息，沉迷于游戏，沉溺于虚拟空间。　　总之，如何让初中信息技术教学发挥其有效性，从而帮助学生健康学习，一直都是教育工作者所探索研究的问题。相信只要断追寻新方法，信息技术教学就会迎接美好的未来。"}
