{"title": "浅谈高职院校计算机类微课的制作", "url": "https://www.lunwendata.com/thesis/2019/152591.html", "time": ["2019-01-13"], "info": "　　中图分类号：G642 文献标识码：A 文章编号：1009-3044（2017）36-0100-02　　1 概述　　随着手机、平板等移动设备的普及，碎片化时间产生了微型学习的需求，人们期待在较短的时间里迅速学习和理解某个问题，这种需求促进了微课的发展。在线教学网站的兴起引起了教育领域的广泛重视；全国微课比赛每年定期地举行，受到全国上上下下各级院校的关注，广大教师的积极参与，大力推动了微课的发展[1]。但在实践中发现微课有促进教学的一面，也有适用范围、制作成本、制作条件等一系列的限制，为更好地促进微课的发展，本文从微课的介绍入手，研究高职院校的教师应如何在计算机教学工作中更好的制作和普及微课，最后对微课的发展给出自己的建议和思考。　　2 高职计算机与微课　　在高职计算机教学中，非常适合将计算机专业类的内容进行微课化改造。高职计算机专业强调学生动手和实践能力，对上机操作能力要求较高，但在实践课程学习过程中，学生经常跟不上老师的操作步骤，如果将教师教学过程以微课的形式展示出来，就非常便于学生的学习和复习，这种方式也比较符合高?学生的思维特点[2]。另外，计算机教师有着专业方面的优势，往往在技术手段上比其他专业的教师更加熟练，在微课制作速度上相对较快，质量相对较高。这种新型的信息化教学模式应用到计算机教学工作中可以有效提高授课质量和课堂效率，显著提升学习氛围、学生动手能力和学习兴趣，同时微课以视频方式展示教学过程，方便学生课后的复习和巩固，对于较难的内容，教师可以通过专门的微课视频进行精细化讲解，方便学生反复观看和琢磨，加强对难点的理解和掌握。　　3 计算机课程微课制作　　计算机类的微课制作，大致分为以下几个步骤：选题――教案编写――制作课件――教学实施与拍摄――后期制作――教学评价反思[3]。　　教学实施和拍摄时需要注意尽量选择学校内相对专业的摄像室环境进行，在开始阶段最好有熟悉录像录音设备并能处理剪辑的人员参与，能够帮助对灯光、环境噪声、讲解者的声音质量、配乐、视频质量，人物表情、动作、讲解的文字进行指导，需要注意避免以下问题：　　3.1 光线过明过暗的问题　　普通教室里，拍摄灯光一般不理想，难以调节灯光，不能补光，拍摄出的场景光线要么过暗、要么对比度不够，让观看者感觉非常不专业。　　3.2 声音清晰稳定的问题　　普通房间里在人多时容产生背景噪声，人少时会产生回声，拍摄者通过普通话筒录制，音量大小不稳定，在后期剪辑时往往出现声音不清晰、电流噪声、环境噪声、忽大忽小，回声过重，场景切换时声音变化对比强烈等问题，观看都会感觉声音不流畅，听起来不舒服等问题。另外，要注意所配音乐音量与讲解者声音音量保持一致，避免切换时突然变大的问题。　　3.3 视频质量问题　　尽量避免使用头戴式耳机+电脑摄像头、手机、手持式摄像机的方式，这些小型设备所录制的视频往往出现视频清晰度不够，镜头有晃动、在场景切换时对比度变化明显的等问题。如果是坐在电脑前，录制人员动作将受限于耳麦线的长度，很多动作不方便展现，最终观看者只能看到一个头像在视频中说话，影响肢体语言的展现。　　3.4 脚本准备问题　　录制前要写好脚本，并事先要充分熟悉脚本，在录制时将文字用自然流畅的方式表达出来，同时要有声音的起伏，声音饱含情感，不要变成读稿子，更要避免出现语言混乱、表达不清说错和重复等一系列表达问题，事先准备好的脚本后期直接粘贴转换成字幕。　　3.5 微课制作规则问题　　一般的，微课视频有开头、中间和结尾三部分，开头部分有导入动画、封面，展示微课名称、单位、作者，结尾部分有总结和致谢，中间是微课的主体部分。在比较正规的场合（如有些教师准备微课是为了参加比赛）需要遵守制作的规则。　　3.6 录制技巧　　常见的技巧有：　　1 尽量使用专业的设备和专门的录播室，可以显著提升微课质量。　　2 正式录制前先进行几次预录制。对录制过程的内容事先有个预估，同时熟悉讲稿，练习肢体语言。　　3 录制过程中如果出现了错误，可以将正确的语句再重新说一遍，而不要中断录制，这样做的好处是后期处理时只要将错误内容剪辑掉就可以了，人物站立位置、灯光、声音基本不会有大的起伏，剪辑后仍然保持相对流畅，避免中断后再重新录制导致的浪费时间问题。　　4 如果担心是将课件播放视频与声音分开录制，在后期制作时合成在一起，这样可以降低录制难度。　　后期剪辑如果使用在开始录制时音频、视频的质量不达标，后期不管怎么处理，一般都能达到要求，并且因为剪辑过多容易会产生音频视频不流畅的问题，极大地影响了观看效果。　　4 总结与思考　　对于微课，要有全面的认识。微课一方面有辅助教学的功能，另一方面，微课不是万能的，不要过度使用，在一些理论性较强，需要通过讨论、人与人之间互动较多才能掌握好的内容就不太适合制作成微课[4]；另外，目前一节成功的微课对于教师来讲需要大量的时间和精力投入，即使是熟悉计算机操作的专业教师来讲也是一件费时耗力的辛苦工作，几分钟的微课往往需要几个小时到几天的时间，如果没有合适的设备，录制与处理上还要花费更多的时间[5]。如果各院校需要长期制作较多的微课，最好能够建设专业的录播室，并有比较专业的人员进行技术支持。目前市场上已经有不少专业课程制作集成方案，甚至有不少自助式录制与剪辑一体化解决方案。如果教师能够使用这些设备，就可以让教师专心准备内容，不用在视频制作、设备、灯光、音效之类的问题上耗费大量的时间。　　微课在教学实践中还有许多值得我们去进一步研究和探索的问题，需要教育者们不断地研究才能理好的服务教育。"}
