{"title": "面向计算机应用与科学思维能力培养的教学对策", "url": "https://www.lunwendata.com/thesis/2019/152626.html", "time": ["2019-01-13"], "info": "　　中图分类号：G642 文献标识码：A 文章编号：1003-9082（2017）10-0-01　　培养学生的科学思维能力和提高学生计算机应用能力是计算机教学中的重要教学目标。更好地应用计算机学科技术也是高职计算机学生的直接学习目的，通过计算机的学习来满足自己学习、生活和工作的需要。因此，目前在高职阶段重视学生科学思维能力和计算机应用的培养显得尤为重要。　　一、目前教学中计算机应用教育存在的问题　　1.教学内容滞后于计算机信息技术的现实发展　　目前我国已经处于高水平信息技术的发展状态，多媒体技术和网络技术等已经很大程度的改变了人们日常生活的思维方式和生活方式。大数据、计算机、智能手机、电子科技这些新技术已经得到了全社会的高度评价，所有产品从遥不可及几乎变成了百姓的日用品。在信息技术高速发展的时代，每一天都会由大量新技术问世，这就导致了教材内容无法及时更新而落后于现实的发展水平。这种滞后性严重制约了计算机应用教学的进步，也造成了学生薄弱的计算机应用基础，从而落后于时代发展的步伐。　　2.计算机课程结构设置不合理　　当前，知识的完整性和系统性是高职院校计算机课程设置主要遵循的原则。在这种指导思想下的课程设置便出现了实践内容偏少，理论内容偏多的问题。这就直接导致了学生理论知识充裕，但是缺少实践操作的机会造成计算机应用的薄弱基础。这种学科设置会直接导致学生操作能力低下和学生对计算机课程的低兴趣，严重制约多样化学习的发展。因此计算机课程设置应该以有效应用为原则，才能相应提高学生的计算机应用能力。　　3.计算机教学设计和计算机专业相脱离　　高职院校的计算机教学设计与学生的专业相脱离，直接后果便是学生所掌握的计算机技能并不能应用到自己的工作和生活，无法将所学的内容化成现实生活的服务能力。这样计算机专业的学生在当前社会不断创新的发展趋势下，无法?m应社会的发展。在高职阶段的计算机课程设置中一定要将学生所学专与计算机课程设置密切的结合，才能培养计算机应用能力较强的创新人才。　　二、培养学生科学思维和计算机应用能力的教学策略　　1.在教学中自觉融入培养学生科学思维能力和计算机应用能力的教学理念　　在具体的教学当中融入新的教学理念才能提升计算机教学效果，教师应该自觉得将这种新的教学理念贯穿教学始终，树立学生自觉培养计算机学科思维能力的意识，只有提升了计算机应用能力和科学思维能力的教学才能为培养计算机专业人才带来较强的保障。 计算机学科教师只有充分认识两种能力培养的重要性才能很自然地，抓住一切教学机会培养学生计算机应用能力，另外还要认真培养学生计算机逻辑思维能力、创造性能力和批判性思维能力。在具体的教学过程中要正确认识科学思维的概念，只有运用计算机科学思维，在学生遇到具体问题的时候，才能运用创造性思维解决问题，在提升计算机应用能力的同时也完成了计算机专业人才的培养目标。　　2.突出学生为教学主体的教学模式　　传统的计算机教学模式中，教师是教学的主体，扎这样的教学模式极大地束缚了学生的学习热情，也束缚了学生科学思维能力的培养。因此，高职计算机课程教学模式改革势在必行。改革的重点要以学生为教学和活动中心，树立学生的教学主体地位，在实践中充分培养学生科学思维的学习方法和学习态度，最大程度挖掘学生的学习潜能，这样学生在实践教学中的计算机应用能力和科学思维能力才会得到有效提升。在具体的教学过程中，首先教师可以利用网络、多媒体等教学方法增强学生学习的兴趣，在设置情境问题的时候要采用学生能够积极参与问题探究的方式和适合的活动类活跃学生对问题探究的氛围。这样能够充分树立学生的教学主体地位，教师从头至尾以学习的引导者、协助者身份存在于课堂，在尽量减少学习干预的情况下，培养学生变成具有科学思维能力和计算机应用能力的学习的主人。其次，在教学设计过程中，教师会遇到独立性较差、总是希望老师直接给出答案的学生，这就需要教师积极鼓励这类学生多看资料、多思考进行独立的解决问题，坚决避免学生产生惰性的学习情绪和习惯。当学生圆满完成教学设计或者相关作品时，教师要待全体学生完成操作后，教师要挑选具有代表性的学生进行总结心得体会，与大家分享和总计设计方法和经验。通过这一环节，学生会增强对学习内容的掌握，也会提高自我评价能力和自我认知能力。通过科学思维和计算机应用能力的训练能够为高职学生的日后工作能力的提高奠定坚实的基础。　　3.积极推行个性化学习，打造第二课堂　　第二课堂是对基础课程以外的教学的补充，具有个性化学习的特点。计算机教育的第二课堂学习对于学生培养科学思维能力和培养基算计应用能力都有很大的益处。第二课堂很大程度上也是兴趣学习，能够为培养创新型计算机人才提供保障和基础。例如通过第二课堂学习，学生可以在教师的组织下开展编写软件活动，学生可以根据自身的爱好或者教师根据实际需要确定编写软件的题目都可，学生可以采用合作的方式进行软件程序编写。教师可以在编写过程中与学生共同讨论所遇问题和难题，并不需要直接给出学生定型的答案，学生需要利用已有的知识和方法来解决遇到的问题。在这样的实践过程里，学生的知识面得到了有效拓展的同时，学生的学习动机得以强化，也提高了学生独立解决问题和学习的能力，另外还间接的培养了学生创造性思维能力和合作意识。　　三、结语　　计算机科学思维能力和应用能力的培养需要教师树立重要的教学意识，改变传统的教学模式，在教学中植入新的教学理念，真正以学生为教学主体，培养学生独立运用计算机科学思维解决问题的应用能力。"}
