{"title": "浅析计算机教育过程中的信息安全问题", "url": "https://www.lunwendata.com/thesis/2019/159266.html", "time": ["2019-03-26"], "info": "　　随着教育信息化向纵深发展，越来越多的业务和数据都通过网络来传递和处理，因此教育信息网络安全问题也日益突出。提高网络的安全性，建立起一套真正适合教育信息网络的安全体系是时代的需要。　　一、网络隔离的观念　　随着网络防火墙在网络出口。使用过滤规则和访问控制。该系统分为网络和网站内部网络和外部网络。防火墙的光纤接入网络端口以外。局域网千兆交换机的人群中的人们网络连接，使内外网隔离。使用IP地址的数据背后隐藏的是防火墙的网络内。可以为当今流行的各种网络攻击和未经授权的访问。网络安全定义所谓网络安全是指网络系统的硬件、软件及其系统中的数据受到保护，不受偶然的因素或者恶意的攻击而遭到破坏、更改、泄漏，确保系统能连续、可靠、正常地运行，网络服务不中断。常见的影响网络安全的问题主要有病毒、黑客攻击、系统漏洞、资料篡改等，这就需要我们建立一套完整的网络安全体系来保障网络安全可靠地运行。　　二、网络安全管理　　（一）网络控制措施。严格的管理是网络安全的重要措施。事实上，很多网管都疏于这方面的管理，对网络的管理思想麻痹，网络管理员配置不当或者网络应用升级不及时造成的安全漏洞、使用脆弱的用户口令、随意使用普通网络站点下载的软件、在防火墙内部架设拨号服务器却没有对账号认证等严格限制，舍不得投入必要的人力、财力、物力来加强网络的安全管理等等，都造成了网络安全的隐患。众所周知，一个国家国民教育程度的高低对整个国家国民素质的发展有着重要的影响。因此，网络化教育已经成为教育发展的必然趋势，国家的发展离不开教育，而教育的发展离不开网络。然而，由于种种原因，网络也有其不足之处，我们在进行网络教育的过程中必然存在很多问题。为了提供一个安全可靠的网络环境，在培养信息安全人才的同时，还必须加大网络安全系统建设的投入，这是确保信息安全的关键。　　（二）网络服务的安全。影响计算机网络安全的因素有多种，主要是自然因素和人为因素。自然因素是指一些意外事故，例如服务器突然断电等；人为因素是指人为的入侵和破坏，这种情况危害性大且隐藏性较强。无意的损坏，例如系统管理员安全配置不当而造成的安全漏洞，有些用户安全意识不强、口令选择不慎、将自己账户随意转借他人或与他人共享资源等带来的安全问题。有意的破坏，例如黑客利用网络软件设计时产生的漏洞和“后门”对电脑系统的非法恶意攻击，从而使处于网络覆盖范围的电脑系统遭到非法入侵者的攻击，有些敏感数据就有可能被泄露或修改，这种破坏主要来自于黑客。电子邮件是互联网上运用得十分广泛的一种通讯方式。攻击者可以使用一些邮件炸弹软件或COI程序向目的邮箱发送大量垃圾邮件，从而使目的邮箱被撑爆而无法使用。当垃圾邮件的发送流量特别大时，还有可能造成邮件系统对于正常的工作反映缓慢，甚至瘫痪。相对于其它的攻击手段来说，这种攻击方法具有简单、见效快等优点。　　三、网络信息安全的防范措施　　（一）加强计算机防火墙的建设。所谓计算机防火墙是由软件和硬件设备组成、在内网和外网之间、专用网与公共网之间的界面上构造的保护屏障。它是一种计算机硬件和软件的结合，保护内部网免受非法用户的入侵，能够保护计算机系统不受任何来自“本地”或“远程”病毒的危害，向计算机系统提供双向保护，也防止“本地”系统内的病毒向网络或其他介质扩散。　　（二）建立一个安全的网络系统。及时对操作系统和应用软件漏洞补丁。下载并安装补丁的漏洞，最新发布的第一时间，确保清晰的漏洞打补丁。把站点的访问设置，非一个外部发生的写访问，以确保无效的数据是不写。安装防篡改软件，以防止敏感信息被修改以确保发布网站信息的准确性。配置IIS服务器，修改错误的反馈文件。Web软件版本的防信息泄漏。必要时，增加设置URLScan建立，配置接入号码，允许访问的文件类型。关键词和其他相关内容的访问。和拒绝服务攻击等网络攻击和非法请求。用于SSL连接协议的重要性。在以下的协议和PCTI服务器SSL3.0禁止协议。漏洞和弱口令修改。限额以下128加密协议。对SQL注入攻击。现场验证和重新编写代码来访问用户输入数据的合法性进行判断。消除安全隐患。防止未经授权的用户访问数据库的密码，和修改数据库的内容。　　（三）明确安全对象，设置强有力的安全保障体系。的跨站点脚本攻击防范。为有效验证用户的输入访问，过滤和限制某些输入。达到防止交叉站点脚本攻击。发布内容的网站上评论和关键词过滤。在必要的时候增加手工审计的重点关键词，在保障范围最发达的网站安全。通过采取有效的安全措施。制定一个可行的安全解决方案。和实现最后通过仿真软件的。证明在有条件的情况下保护网络和网站安全。应该做的网络和网站系统容灾中心的建设，因此为了更好的消除环境，如地震，洪水，火灾和其他潜在的安全问题。防火墙是两个网络之间的成分集合，有以下性质：①内部网络和外部网络之间的所有网络数据流都必须经过防火墙；②只有符合安全策略的数据流才能通过防火墙；③防火墙自身应具有非常强的抗攻击免疫力。一个好的防火墙应具有以下属性：一是所有的信息都必须通过防火墙；二是只有在受保护网络的安全策略中允许的通信才允许通过防火墙；三是记录通过防火墙的信息内容和活动；四是对网络攻击的检测和告警；五是防火墙本身对各种攻击免疫。　　随着信息化进程的加快和网络安全行业的快速发展，网络教育在学校教育中扮演着越来越重要的角色，推动新的教育模式不断向前发展。同样，我们也面临着新的威胁，因此我们必须运用新的防护技术。网络信息安全是一个系统的工程，我们不能仅靠硬件设备（杀毒软件、防火墙、漏洞检测）等的防护，还应意识到计算机网络系统是一个人机系统，计算机是安全保护的对象，但执行保护的主体是人，只有树立人的计算机安全意识，才有可能防微杜渐，同时还要不断进行网络信息安全保护技术手段的研究和创新，从而使网络信息能安全可靠地为广大用户服务。"}
