{"title": "基于能力本位的计算机基础项目化教学改革", "url": "https://www.lunwendata.com/thesis/2019/156611.html", "time": ["2019-02-25"], "info": "　　中图分类号：G424 文献标识码：A 文章编号：1009-3044（2013）11-2625-02　　当前计算机的应用已渗透到社会的各个领域，已经成为一门不可或缺的工具，高职毕业生的计算机应用能力也成为各用人单位对其最基本的要求。因此，如何提高高职学生计算机的实践应用能力，改进教学模式，提高教学质量与教学效果是计算机基础课程急需解决的问题。　　1 知识本位教学模式　　目前我国高职院校的课程，大多是从普通高校继承而来，采用传统的知识本位课程教学模式。在整个教学活动和教学结构中，教师是主体，是知识的传授者，采用“上课→复习上次概念→引入新概念→规律→知识→系统→应用→案例→作业→下课”的课堂教学形式，学生只能被动地接受知识。　　在此教学模式中，教师的教学水平、教学技巧和教学艺术决定着学生的学习效果。因此，课程评价考查的对象都是教师，而不是学生的学习效果。结果造成许多课程教师讲得没有问题，但课程的实际效果很差；学生对所学课程没有兴趣，没有积极地投入到教学过程中，课堂上睡倒一片，甚至逃课。同时，这种以知识为本位的教学模式培养出的学生容易出现“高分低能”的现象，学生知识学得很好，考分也很高，但到了实际工作岗位，却不能胜任职业岗位工作，学到的知识不能转化为职业活动所必需具备的能力和素质。　　因此，以知识为本位的教学模式，用简单的练习、习题、作业、问答、读书和课堂活动等方式，强调老师和书本传授的间接知识；而不重视对学生而言最重要的，从实践操作中体验和感悟到的直接经验。这就是高等职业院校用传统的知识传授模式上课必然失败的根本原因。　　2 能力本位教学模式　　高等职业教育培养高等技术应用型人才，与研究型高等教育的实践教学以发现、验证性实验为主相比，高职院校则应以强化技能训练为特点，以能力为中心，加强对学生动手操作和模拟实习的能力培养。　　知识可以通过语言、文字、图形和公式传授，但“能力”却不能传授，只能通过项目和任务的训练获得；通过自己动手、动脑，解决尽可能真实、复杂、综合的实际问题的过程中获得的。所以，能力不是老师讲出来的，也不是看出来的，更不是学生听出来的；能力是在老师指导下，学生在完成项目和任务的过程中，自己动手、动脑练出来的。教学活动中应遵循“上课→情境（案例）→任务→问题→示范/模仿→任务完成→知识归纳→功能扩充→独立完成→知识归纳→新任务对能力反复训练（提高要求）→知识总结→作业→下课”。　　因此，能力本位教学模式首先在课程中应突出“能力目标”，让学生得到企业需要的、实用的、系统的应用能力，能够在未来的职业岗位上解决实际问题。其次，应以项目、任务为载体进行能力训练，让学生直接解决未来职业岗位上可能遇到的种种问题。最后，在教学活动中应以学生为主体，激发学生对项目、任务的兴趣，积极、主动地参与到教学过程中来，自己动手、动脑操练，相关能力得到明显提高。　　3 能力本位教学模式在“计算机基础”教学中的应用　　过去我院“计算机基础”教学采用传统的“知识传授+实验”形式的教学方式，教学效果很差，学生只能应付考试，不具备计算机的综合应用能力。 针对“计算机基础”课程知识更新快、信息量大、学时少、生源差异大等特点，以现代办公应用为目标，以提高职业能力、掌握实用技能为出发点，注重提高学生处理复杂办公事务和综合应用的能力，对该课程进行了以能力为目标的项目化教学改革。　　3.1 依托项目任务，进行教学整体设计　　从现代办公应用遇到的实际问题出发，采用“项目引导、任务驱动”的项目化教学形式，以Windows XP+Office 2003为平台，将该课程分为计算机入门、校园生活、商务办公、办公实例等四大模块，每一模块设立若干项目，每一项目再明确若干任务。把各知识点与操作技能融入到各个项目、任务中，突出高等职业教育的职业性和实践性，强化实践，培养学生实践动手能力；学生通过项目任务完成相关知识的学习和技能的训练；项目任务的安排遵循由易到难、由简单到复杂，层次推进，循序渐进的原则；精心选取每个项目任务，针对学生在校期间和目前多数企事业单位的实际需求选定项目，使学生保持较高的学习兴趣和动力，并能够学以致用。　　例如，校园生活教学模块中，设计三个项目，如表1。　　任务2：制作电子报　　任务3：毕业论文排版　　任务4：制作准考证＼&项目2：处理实用数据＼&任务1：制作学生成绩管理表　　任务2：制作学生成绩分析表　　任务3：制作工资管理表　　任务4：制作工资分析表＼&项目3：制作演示文稿＼&任务1：制作“我爱学院”演示文稿　　任务2：制作“职业生涯规划”演示文稿　　任务3：制作“毕业论文答辩”演示文稿＼&]　　3.2 采取“五步教学法”，实现“教、学、做”合一的情境教学　　教学过程中体现“以能力为目标，以项目为载体、以学生为主体”的原则，采取“项目引入→任务驱动→资源拓展→知识归纳→融会贯通”的五步教学法。　　第一阶段：项目引入，明确目标。　　首先，通过一个情境引入项目，引导学生了解项目的应用背景，从而引出相应的任务和工作，以此激发学生的学习兴趣，让学生有学习的内在动力，并认识到学有所用，明确教学目标。　　第二阶段：任务驱动，分析问题。　　其次，通过分析项目，找到解决问题的方法。将每一个项目都分解成若干个任务，把各知识点与操作技能融入到各个任务中，在任务的驱动下进行项目制作；使学生在项目的制作过程中，不断地发现问题，解决问题，从而实现相关知识的学习和技能的训练。　　第三阶段：资源拓展，完成项目。　　为突出高等职业教育的职业性和实践性，培养学生实践动手能力和综合运用所学知识的能力，要求学生通过网络、图书馆等多种教学资源拓展知识，在老师的引导下，自主完成项目制作。　　第四阶段：知识归纳，引申提高。　　由于教学过程中采取的是从实际到理论，从具体到抽象的教学方法，直接面向应用组织课程。因此，项目结束后，应引导学生进行总结归纳，对每个项目的应用背景，所涉及的知识点及操作技能进行总结，同时引申和提高项目的不足之处，从而使学生具有高质、高效的现代办公软件应用能力。　　第五阶段： 融会贯通、学以致用。　　学习的最终目的是为了学以致用，基础项目完成后，应引导学生制作一综合性项目，项目的选取应有针对性。该项目应涵盖一个真实项目的全部过程和内容，在实践锻炼中，使学生能够将所学与所用结合，以所学为所用，以所用悟所学，融会贯通，为学生的可持续发展奠定良好基础。　　4 结束语　　我院自2010年实行“计算机基础”课程项目化教学改革以来，将传统的以教师、课本为中心的教学模式，转变为以学生、项目为中心。在教学过程中始终贯彻“以能力为目标，以项目为载体、以学生为主体”的原则，使学生在学习过程中，有一个完整的、具体的、真实的项目作为知识的载体；并且极大地激发了学生学习的积极性和主动性，提高了学生的计算机综合应用能力。"}
