{"title": "运用计算机知识做好人力资源劳动工资管理工作", "url": "https://www.lunwendata.com/thesis/2019/153483.html", "time": ["2019-01-22"], "info": "　　中图分类号：F272.92 文献识别码：A 文章编号：1001-828X（2017）015-00-01　　一、计算机在管理中的应用的可行性和必要性　　近年来，我国计算机事业得到了飞速发展。随着微型计算机在我国的逐渐普及，计算机的应用已从实时控制、科学计算方面逐渐扩展到非数值处理的众多领域。尤其是微型计算机系统在企事业管理及办公自动化的应用方面正日益受到各部门的广泛关注，并在在现代企业管理中占据越来越重要的地位。　　计算机在国外企业工资管理中已经被广泛应用，在我国也已逐步得到推广和应用。因企事单位人员?多，在工资管理方面涉及工资的计算、核算、发放等工作，相关财务人员劳动强度大，并且因其特殊性，不允许出现失误。计算机在工资发放中的运用，既能够保证工资精准，还能对发放工资后所反馈的信息加以收集整理，以服务于财政部门其他方面的核算和财务处理，这样有利于财政部门效率和精确度的提升，促进企业的良性发展。因此，工资管理系统在财政部门中的应用显得至关重要。　　二、计算机工资管理系统概述　　劳动工资管理系统主要是为实现劳动工资规范业务信息的管理。一方面，围绕整个数据流程，及时加工整理工资核算、发放中反馈的各种信息。系统根据工资的变化、以及员工工作状态的变化整理成统一的数据文件，发放给相关单位。另一方面，则是对各个二级单位的工作进行考核并评估绩效工资，将各二级单位数据上报，并由此分析员工的工资现状，工作现状及其基本规律，以便人事部门管理掌握其工资的增减幅度。　　三、计算机工资管理系统介绍　　1.数据字典的建立　　数据字典的存在，使系统具备通用性、推广性；切合计算机的处理模式，使其更加专业化；符合代码的唯一性与系统性的特点，使其具备一贯性；符合代码的具有扩展性的特点，使其易于扩展。这样既适用于计算处理，又降低数据出错率和冗余度。　　2.通用性　　为适应各个单位的软硬件设施等各方面差异，程序设计时采用了区分个性与共性参数文件的设置，优化了参数在程序中的使用，使程序的通用性和可移植性得到大大提高，也进一步保证了程序（模块）的利用最大化。　　这样一来，各个模块之间的内聚性得到了提升，藕合性也因此降低，系统内部的模块调用关系更加明确。与此同时，模块的重用使模块的效能得到最大程度地释放，由此减少了研制周期，提升了软件效率和质量，因此，为便于差错和改进，增强灵活性，在管理系统程序设计时，采用多模块段程序方法。　　3.数据字典与数据审核公式库　　建立数据字典库和数据审核公式库，方便于当系统数据项目、数据运算、审核公式发生变化时，无需改动程序，只需要维护相应库存数据项目或公式即可。　　4.系统响应快　　在系统中采用代码设计方法，即，将有规律遵循汉字名称均设计为一一对应的代码，这样既节省了磁盘空间，又为数据处理留出了大量时间。　　四、处理好人、计算机与数据三者之间的关系　　1.人事人员操作能力的提升　　随着计算机技术的发展，计算机工资管理系统的功能日趋完善的同时，操作难度与专业型也相应有所提升，这对相关从业人员的整体素质要求越来越高。为在运用计算机处理人事劳动工资问题上得心应手，人事人员应具备较高的计算机操作水平，与时俱进，不断学习新的操作知识，这样才能更好地为大家服务，做好工资管理工作。　　2.计算机数据管理与收集　　（1）计算机录入档案数据应以人事工资档案资料为主。录入计算机资料时，应重视档案资料的管理，因为其中包含了员工工资轨迹，可谓是个人人事工资的最原始、最具体、最公正科学的记载凭证与根据，包括个人工资的历史数据掌握了解工资原始情况，有利于减少工资调整带来调阅档案的麻烦，有效提升了工资调整的准确性。　　（2）计算机收集档案数据应真实准确。应用计算机在人事工资材料中提取档案数据，是一项需要谨小慎微而又庞大的工作。需要人事工资管理人员在录入人事工资档案时，认真核对，确保没有遗漏历史数据。　　3.强化数据管理提升工作效率　　（1）当今是一个大数据时代，每个数据都关系到大家的切身利益。所以，在数据录入的过程中，应谨慎细致，做到不遗漏，不失误，确保数据的准确，以与原始档案数据保持一致。　　（2）应当对档案数据实施时时变化，就时时收集、记录和整理，并在档案数据变化的同时，对计算机的已存数据也要做出相应变化。这样一来，有效保证了借助计算机调阅和整理的各项数据的新鲜性与准确性。　　（3）严谨使用已存数据。为高效且便利使用已存档案，应建立健全计算机使用的有效机制，在操作过程中，谨慎使用数据，规范化操作，提升工作效率。　　五、结语　　计算机引入工资管理，给人事工资管理者带来了极大的便利。但人始终是生产力诸因素中最活跃的因素；人是管理的主体，管理是人的行为，这是其他任何事物所不能替代的。人力始终是第一资源，计算机只能是对人事工资管理起辅助作用；计算机智能辅助处理人事工资管理中的数据问题，真正要完善人事工资管理工作，只有提高人事工资管理的水平，才能实现效益的最大化。"}
