{"title": "浅谈高校院校计算机网络环境下的网络教学", "url": "https://www.lunwendata.com/thesis/2019/158846.html", "time": ["2019-03-22"], "info": "　　计算机网络是一门理论性、实践性以及应用性比较强的学科，因此在实施网络教学中，需要结合计算机网络教学的内容以及主流的网络技术和网络应用为主要内容，在教学中需要将网络教学的理论与实践相结合，通过计算机网络教学的推广来提高我国高校教育的总体质量，本文重点分析了计算机网络教学的特点以及对计算机网络教学的现状进行分析，从中取得进一步创新，为教育事业做出了重大的贡献。　　一、计算机网络教学及其特点　　计算机网络教学是教师在教学的过程中利用信息平台来向学生传授知识，借助计算机教学的时效性、共享性以及相互交互的特点来实施具体的教学，在计算机教学中，教师占据着主导的地位，在这种新的模式中激发学生的学习自主性，并且在丰富的教学资源中，培养学生独立解决问题的能力，从中有效的提高教学的效率。　　在计算机网络教学中，有教师进行引导，在学习多媒体信息技术的网络理论下，将学生看成是知识学习的构建者，在学习中，教师引导学生采用正确的方式进行，并且结合计算机教学的特点来具体实施，其中计算机教学的特点有：交互性。在网络教学中，其最大的特点是能够进行实时的交互，这种交互的方式可以使得学生与教师之间增强交流的机会，在利用网络课件中，学生可以利用更多的教学资源来完善自身的教学过程，这种教学有助于提高自身的教学方式，最终提高教学的效率；网络教学资源的共享性，在计算机信息教育中，它包含着硬件的共享和软件的共享，因此在这种教学资源中，学生有助于形成个性的思维，增强了创新性的学习，为提高学生的综合素质有着重要的推动作用；多媒体信息的综合性，由于多媒体信息中包含着图像、文字、声音等，在这种综合模式中有利于提高学生对知识框架的构建，从中激发了学生的学习兴趣，极大的推动了素质教育的有效实施；计算机教学的多样性，在网络教学实施的过程中，教师可以根据学生自身的特点以及学习的风格来实施多样性的教学模式，在教学中不仅为学生提供了更加丰富的教学内容，而且为学生提供了更多的学习方法，这些为提高学生的学习效率有着极大的推动作用。　　二、计算机网络教学的基本方式　　在我国高校计算机网络教学中，为了促进网络教学的多元化，其中网络教学的模式可以分为：（1）基体教学模式。在这种教学模式中，由教师来创设教学情境，从中激发学生学习的兴趣，在多元化的教学途径中，让学生在计算机教学资源中收集更多的教学知识，在教学中，教师可以采用监视管理来为学生选定特定的学习小组，这样学生自身能够利用对话、留言簿等进行进一步的交流，这种教学模式有助于学生之间相互交流，能够在相对比较宽松的教学环境中，相互借鉴，有助于培养合作意识，然而对于教师来说，能够有效的收集学生的学习信息，以便及时的调整学习的方案。（2）自主学习的方式：通常在自主学习中，主要是利用服务器的功能来利用硬件资源实施具体的教学，在高校教育中，学生可以利用服务器来自主选择学习的内容，这样有助于增强学习的信息量，加强学习方式的转变，提高学习的效率。　　通常在网络教学中基本的方式可以表现为：（1）视频广播：能够在网络管理中心将录制的教学进行实时的播放。这种教学方式在课堂中不受到任何条件的约束，具有实时性的特征。（2）视频点播：这种教学方式，学生可以根据自身的需求来点播服务器中的视频，因此在实时具体的点播中，视频制作人需要精心的设计，保证传递的信息的有效性。（3）视频会议：这种方式使用的范围比较小，通常在教师进行答疑的过程中使用，能够利用计算机网络将视频音频进行实时的传输。（4）WEB教材：这种方式是根据具体的教学内容以网页的形式展现出来，在操作中比较简单，并且应用的范围广。（5）多媒体课件：它主要是在进行下载之后进行传输使用的，将教学资源进行制作后使用。（6）BBS论坛：它是一种电子公告平台，师生之间可以进行交流合作，共享教学资源，共同促进学习效率的提高。（7）聊天室：在聊天室中，师生之间进行文字或者是语言沟通，实现了教学的实时性交流。（8）E-mail：在实施教学的过程中，师生之间可以通过电子邮件来进行教学交流。提供了比较方便的平台。　　三、网络教学中存在的问题以及具体的解决措施　　1、网络教学课堂容量问题。在教学中，由于网络资源比较丰富，因此需要将网络教学资源合理利用，在增强课堂教学容量的同时，为学生提供了比较广泛的学习内容，但是在教学资源中，由于图片、语音等知识比较丰富，这种状况就使得学生在学习中造成对知识容量的错误使用，没有对具体的内容进行消化，这就大大的影响了学习的效率。因此针对这种学习现状，教师和学生需要将网络教学资源合理的利用，在教学中明确教学的目标，合理利用网络资源，把我好教材中的课堂容量，提高教学的效率。　　2、自主学习的问题。在教学中，在网络教学的使用中，教师减少了讲授的时间中，增强学生自主学习的机会，这种教学有利于学生自主学习的培养，然而教师是教学的引导者。因此在网络教学平台下，需要对教师和学生的角色进行重新的定位，让教师在教学中去引导学生进行教学资源的整合，组织教学。提高教学的效率。　　3、情感互动问题。在网络教学中，教师占据着主导的地位，学生只是被动的接受知识，这种教学方便了学生问题，但是拉大了师生之间的距离，在教学中缺乏人性化。因此在利用网络教学资源中，需要将传统的教学与网络技术进行有机的结合，注重师生之间的情感交流，在课堂中让学生发挥主动性和积极性，来提高学习的效率。　　4、课件通用的问题。在网络教学中一般是将特定的课件进行设计，其通用性比较差，因此在网络教学中必须要优化教学的课件，在网络教学中利用网络的交互性，预先设置相应的模板，让后实施具体的教学，这种模板节省了大量的制作课件的时间，并且提高了通用性，同时大大的激发了学生在学习中的主动性，增强了学生的实践能力，有助于培养综合性的人才。　　四、总结　　在我国高校教育中实施计算机网络教学，在师生共同配合中，培养学生自主学习的能力，在使用网络教学中，丰富了教学的资源，并且提供了更多的教学方法，这种教学有助于增强师生之间的情感，在改进教学现状中，增强了教学的新方式，这些有助于将教学课件进行优化，将学生作为主体，提高教学的有效性。为增强我国网络教学提供了有效的平台，促进教育事业的进一步提升。"}
