{"title": "案例教学在大学计算机基础实验教学中的应用研究", "url": "https://www.lunwendata.com/thesis/2019/155723.html", "time": ["2019-02-16"], "info": "　　Abstract In twenty-first Century， information technology has gradually become an important productivity of the industry， therefore， colleges and universities in education， it is necessary to strengthen the training and improvement of College Students' computer literacy. The main innovation of this paper from the angle of teaching method， discusses the application of case teaching in university computer experiment teaching， and case teaching organization， teaching methods and teaching content design are analyzed， in order to improve the learning enthusiasm and experimental teaching of college students participation， promote the use of computer skills to solve practical problems effectively.　　Keywords case teaching； college computer basic； experimental teaching　　0 引言　　案例教?W是一种卓越的教学方法，被认为是顺应当代教育改革方向的成功教育模式。本文将案例教学引入到大学计算机基础实验教学过程中，并对教学效果与经验进行研究，结果表明，在大学计算机基础实验教学中应用案例教学手法，不仅极大地调动起了学生乐学、爱学的主观能动性，而且，教学效果与质量也卓然可观。　　1 案例教学的概念及优势　　1.1 案例教学的概念　　案例教学起初是由美国哈佛大学商学院提出的，在经历多次实施后最后获得了成功，在教学中成功的将西方的先进教学理念进行了汇聚。案例教学在课堂上引入了具有趣味性和生动性的案例，和传统教学相比，使课堂更加活跃，教师也通过这种教学更新了教育的理念，实现了“知识传授”向“能力培养”的质的转变，对于现实教学更具实践价值。案例教学最早在法学行业和医学行业开始使用，一直到1970年开始，这种教学方法才开始在教育行业被推广使用。案例教学法要求相关任课老师以特定学科的教学任务和教学内容作为核心，将一个案例展现在学生们的面前，针对学习过程中的问题带领学生们进行讨论，帮助学生形成科学合理的思考方式，调动学生们的积极主动性，提高学生们的综合素质。案例教学具有灵活的特点，老师要以这个特点为基础对教学开展准备工作，应该着重选择合适的案例并将其与教学内容进行有效结合，带领学生进行有效的学习，学生在这样的教学方式下主要要做的是认真阅读材料，分析案例积极参与到讨论中去，从中吸取真正有用的东西，深刻理解知识精髓并能学以致用。案例教学具有直观性、全面性、深入性和实践性等特点，非常契合大学生的心理和兴趣特点，对提升计算机基础实验教学效果与质量，具有积极的促进价值。　　1.2 案例教学的优势　　案例教学在开展时，一般是老师对某个教学情景进行具体性的描述，然后通过正确的引导使学生对情景开展讨论，整个的过程是师生共同参与进行案例讨论和问题解决的一个过程。相比传统教学，这种方法更具有针对性，并且在知识更具综合性，学生也可以通过实践和有效的启发，获取更多的知识，提升教学的整体效果。　　首先，因为案例教学的直观性比较强，对于学生具有较大的吸引力。通过案例来化解疑问是案例教学法最主要的优点，通过这些实例，来调动学生们的积极主动性，让他们参与到讨论之中形成自己的思维方式学习习惯，培养学生处理问题解决问题的技能。案例教学法通过一个或多个问题情境的呈现，能够最大程度地激发学生兴趣与吸引力，使其能主动参与到与教师设计的情境互动中，从而不知不觉地就很容易地理解和记住所学的内容。　　其次，案例教学是通过“导入案例―提出问题―组织讨论―案例评价―课后延伸”，来步步深入的。教师在浅显、有趣地导入案例之后，根据教学内容，尽可能多地联系实际生活，创设形象生动的情境，通过学生身边常见的案例，激发学生的学习兴趣，使其融入至学习环境中，加强对知识的理解和领悟。教师在开展案例教学时，可以先给学生一个精彩案例，然后在此基础上创建起案例情境，让学生自主进行思考和分析，最后得出结论。整个的过程会使学生在自己亲身体验基础上获取发现、分析和解决问题的能力。教师选取的案例，可以是涵盖多个方面的综合性案例，这样不但可以使学生创建起生动形象的思维模式，还向学生提出了信息收集以及提出问题的要求，学生据此就可以拟定出一个切实可行的方案来解决问题。这不但对学生是一个综合知识巩固的过程，还是一个全面的教学培养方式。　　第三，案例教学关键性的优势在于其具备的实践性特点。从本质上分析，案例教学属于一种“做中学”的教学方法。虽然学生在知识和经验上已经有了一定的累积，但由于理解欠缺很多时候不可能会在遇见问题时就将所学知识和累积经验应用其中，并解决问题。教师可以采用案例教学法，引导学生，将自己的知识与经验融汇到问题解决中来，从而将其已有知识经验再提升一个层次，使他们学会用“理论指导实践”，促进学生动手能力和操作能力的提高。   　　2 案例教学在大学计算机基础实验教学中的应用分析　　2.1 精心设计案例　　教师应根据自己的教学内容选择合适的案例，同时，案例选择还应兼顾典型示范、现实新颖，案例的筛选要体现特色。通过实践探索，笔者认为案例的选择既要典型，又要贴近学生的实际生活，是学生们感兴趣的。案例的选择要能激发学生们的学习兴趣，培养学生的学习力及思考力，以培养能力为中心，在案例教学中，学生是主角，教师在课前将精心设计好的案例告知学生，让学生了解案例内容，并要求学生下课查找一些相关的资料，自己先模仿案例，自主探究完成案例，让学生们进行较充分的课前准备。例如，在讲解EXCEL电子表格的制作时，有的学生在中学已经学过，有的学生在中学没学过，那么如何让学过的学生既复习了以前所学过的知识，又在原有基础知识上有新的突破呢？笔者精心设计了学生成绩单案例，案例要求学生：（1）建立“期末考试成绩统计表”，将“期末考试成绩统计表”中的A1到H1区间的单元格整合为一个单元格，并将字符设置在居中位置；然后对每个学生进行总分的计算；将各科的最高分和最低分进行标注；在总分计算后，按照从高到低的顺序进行名次的排列；三科成绩总分在270分以上的学生，备注栏中要做出“优秀”字样的标注；统计各科成绩大于等于90分的人数，将工作表命名为“期末考试成绩表”。（2）选取“姓名”和“总分”两列（不含“最高分”和“最低分”行）数据建立“簇状条形图”，图标题为“期末考试成绩统计表”，清除图列，将图表插入到表的l1：L19单元格中区域内，保存该文件。该案例学生们非常感兴趣，是与学生们学习生活密切相关的，兴趣是最好的老师，学生们的学习热情很高，通过该案例让学生们掌握以下主要知识点：EXCEL工作簿的建立、基本函数（SUM（），MAX（ ），MIN（ ），RANK（ ），I F（ ），COUNTI F（ ））等的使用、条件格式及图表的建立等。　　2.2 讲解案例　　案例讲解，教师为主导，学生为主体，教师应给与学生指导和鼓励，引导学生大胆的尝试和探索，对于学生的问题，教师应引起重视，并给与正确的指导、点拨和调控，从而实现教与学的统一，提升整体的教学水平和教学效果。学生可以在此抒发自己的见解，并通过有效的讨论，开拓自己思路，活跃课堂氛围，教师就可以利用表格设计填充、图表以及数据分析等形式实现边讲边练的互动式教学，使学生不仅对以前的知识有所巩固，还给学生机会进行讲解，给没学过的学生又上了新课，学生间的提问和讨论，在很大程度上提高学生学习的主动性。在学生讲解时，教师要给予一定的评价、建议以及鼓励性话语等，可以提升学生的自信心，对于知识丰富并有韧性、喜欢钻研的学生，教师要给予鼓励，并根据学生提出的问题，给予正确性引导和讲解，点评其中的难点以及重点，形成师生间的有效互动，也解决了问题。这种方法激励了学生的求知欲。计算机基础相对比较薄弱的学生，就可以利用课前和课后的时间，由教师或者和水平高的学生来进行辅导，帮助他们他们提高学习的水平。　　2.3 引深拓宽案例　　教师在开展案例教学时，要注重思维情境的创设，选择案例要具有完善性和代表性，不断的对案例做出更新，并引导?W生形成自主发现、分析及思考问题的思维模式，引导学生创造性思维的培养。在教学中，教师要根据实际情况，审时度势的对学生做出引导，引发学生深入思考。例如，可以提出这样的问题“如何将图2中学号的第二位的0替换成1？”在此时，就可以提示学生利用REPLACE函数来进行完成，在案例拓展应用中，不但使学生知识得到了巩固，还扩宽了学生们的知识面，提高了学生解决问题的能力，同时还使学生的创新意识和应用能力也得到了提高。　　2.4 学生反馈及改进　　教师要精心策划，选择合适的创造性大作业，布置给学生，让学生的创造性思维可以得到训练和拓展。创造性大作业，为学生提供了一个创造性思维再现的机会，有助于提升学生的思维能力，使其更具灵活性和流畅性，并且使学生的好奇心得到了满足，对于丰富学生的想象力和创造力有重大意义。　　3 结语　　综上所述，案例教学具有启发性高、实践性强的优势，是一种有效的教学方法，在各级学校教育教学中已经被广泛的应用。在具体实施运用中，教师需要认真考量案例的挑选、课堂的引导、讨论的节奏以及多种教学方式的有效融合，以提升学生的思维能力，拓展思维方式从而在实践中切实提高大学计算机基础实验教学的有效性。"}
