{"title": "VMware在高校计算机机房中的应用及实现", "url": "https://www.lunwendata.com/thesis/2019/156158.html", "time": ["2019-02-20"], "info": "　　中图分类号：TP393 文献标识码：A 文章编号：1009-3044（2016）31-0245-03　　Abstract： Computer rooms in university generally have three main tasks， the first is to take experimental teaching and practical teaching for courses of computer science， information technology and other related professionals， the second is to serve all kinds of grade test， and the third is to serve social training and examinations. This paper analyzed the current situation of computer room in universities， and then VMware-based solutions are proposed according to the problems of destroying experimental teaching， software conflict and server shortage which are often encountered in computer room management. It is proved that the proposed solution solved the destructive experiments very well and reduced the management workload and difficulty of the administrator， Software conflicts and resource shortages that occurs when multiple software is installed on the same computer is solved， And the needs of multi-server for all kinds of examinations is solved too. The solutions greatly improved the efficiency of the use of the computers， improved the experimental environment， and reduced the workload and difficulty of laboratory management. The solutions are valuable and worthy of promotion.　　Key words： VMware； Computer Room； Destructive experiment； Software Conflict　　1 引言　　随着我国信息化技术的不断发展，高校许多学科都需要应用计算机进行教学，高校?算机机房不仅要承担计算机、工学、理学、农学和美术学等专业的教学实验，还承担着计算机等级考试，社会培训及社会考试任务。机房管理中经常遇到三个方面的问题，一是有的课程的实验具有一定的破坏性，比如计算机组装和维护、操作系统、计算机网络、网络安全等课程的实验需要改变计算机的配置，这在机房管理中是不允许的；二是机房需承担很多课程的教学，需要安装各种各样的软件，容易出现软件冲突；三是计算机机房还需要承担计算机等级考试和各种社会考试，需要提供多台不同的服务器，这无形中增加了机房建设的投入，增加了管理的难度。因此，如何解决机房管理中经常遇到的破坏性的实验教学、软件冲突和服务器不足等一些棘手的问题，已成为当前计算机机房管理中迫切需要解决的问题。本文针对高校计算机机房中出现的这些问题，提出了将VMware虚拟软件应用到高校计算机机房管理中，并针对上述问题给出了解决方案和实现方法。通过基于VMware的虚拟实验室环境的搭建来提高计算机设备的利用率，为相关课程的破坏性的实验提供很好的实验平台，解决了同一台计算机上安装各种软件出现的软件冲突问题，通过基于VMware的虚拟服务器的搭建，满足了各种考试对服务器的需要，降低了实验室的资金投入，有效降低了实验室管理员的工作量和难度。　　2 高校计算机机房的现状　　目前高校计算机机房的发展过程中存在的主要问题有以下几点。　　1） 随着我国高校招生规模不断扩大，新增专业和学生越来越多，而教学经费的投入却远远跟不上学生数量的增长，现有机房很难满足实践教学的需要。　　2） 高校机房多，计算机型号杂，配置低，而为了满足相关专业各种课程的实验实践教学，机房中需要安装的软件越来越多，随着软件的不断更新，计算机运行速度越来越慢，经常出现软件冲突等问题。　　3） 高校计算机机房还需要承担除正常教学以外的各种计算机等级考试和社会培训及考试等工作，需要提供多服务器支持。   　　4） 高校计算机机房管理人员少，机房多，管理任务重，难度大。　　如何利用现有的计算机资源，更好地为相关专业各种课程的实验实践教学服务确保教学质量，如何解决同一台计算机安装众多软件出现软件冲突，以及为各种等级考试和社会考试提供多服务器支持，并尽量减少管理人员的工作量和难度，是高校计算机机房管理中亟待解决的问题。　　3 VMware虚拟机技术简介[1-2]　　3.1虚拟技术概念　　所谓虚拟机就是虚拟的计算机， 它是通过虚拟机软件在实际的物理计算机上模拟出虚拟的一个硬件环境， 我们称运行虚拟机的物理计算机为宿主机器， 由宿主机器创建的虚拟机， 和真实的计算机几乎一模一样， 拥有自己独立的CPU、硬盘、内存及其他硬件， 这些硬件是标准的， 能被大多数系统所支持。虚拟机可以使用宿主机器上的一些资源， 如软驱、光驱等设备。用户在虚拟机上分区、格式化、安装操作系统或应用软件等任何操作均不会对宿主机器软硬件系统产生任何影响。　　3.2 VMware虚拟机技术特点　　VMware虚拟机软件是VMware workstation， 它是由VMware公司出品的。要构建一个虚拟实验环境， 不需要额外的硬件设备， 只需要在现有的系统上安装上VMware虚拟机软件即可。VMware虚拟机的主要特点如下：　　1） 使用VMware虚拟软件技术可以在物理电脑上虚拟出多台虚拟机， 每台虚拟机如同独立的PC机， 可以安装不同的操作系统， 这些虚拟机可以独立运行和并发运行， 各虚拟机之间、虚拟机和宿主机器之间还可以进行对话、文件共享、应用网络资源，并可以以 C/S 方式工作运行。　　2） VMware虚拟机虚拟出来的硬件都是标准硬件，这有效地降低了由于硬件不一致导致的兼容性问题或难找驱动程序的问题。 在主系统上虚拟出的硬件都是相同的，可以简单地在不同的主机之间复制后直接使用， 不用考虑硬件差异， 因此在实验中对虚拟机造成的任何损坏可以得到快速地恢复。　　3） VMware虚拟机使用的虚拟硬盘实际上是一个或多个文件，因此虚拟机具有可快速恢复的特点，而且具有保存系统状态和还原系统的功能，虚拟机系统和宿主机系统具有良好的隔离性，在虚拟机上对现有主机的硬盘分区和数据不会造成任何影响。　　4） 因为VMware虚拟机的硬件都是虚拟出来的，所以虚拟机具有灵活的扩展性，可以任意添加或删除硬件。　　5） 由于虚拟机硬件是标准硬件， 在虚拟机上安装的操作系统，不仅可以克隆到另一台虚拟机上，还可以克隆到不在同一台物理电脑的虚拟机上，甚至还可以在虚拟机上做系统克隆映像。　　6）VMware虚拟技术具有很好的兼容性，可以安装不同版本的操作系统，且安装方便、快捷，可以将同一系统下产生冲突的软件分别安装到不同的虚拟机下，从而解决软件冲突的问题。　　4 VMware在计算机机房管理中的应用　　4.1利用VMware构造计算机虚拟实验环境[1-4]　　计算机机房承担着全校计算机等相关专业很多课程的实验实践教学任务，任务重，使用率较高，维护工作量较大，一般课程实验只需安装必要的应用软件就能满足实验的需求，而软件的安装是由专门的机房管理人员统一安装，学生上机实验时只允许使用软件，不允许安装任何软件，更不允许学生对计算机进行BIOS设置、硬盘分区、格式化、安装操作系统及计算机系统配置的更改操作，因为这些操作都会破坏计算机系统。因此，管理人员都会在每台计算机上都安装还原保护卡或保护软件，保证计算机的正常运行，保证实验的顺利完成。然而有些课程需要做一些破坏性的实验才能达到实验目的和效果，比如，“计算机组装与维护”、“计算机网络”、“操作系统”等课程实验需要安装操作系统，对计算机进行一些相关的配置，这就会对计算机系统造成破坏。如何顺利开展这些破坏性实验，而又不对计算机系统造成破坏呢？利用VMware?拟机技术搭建实验环境，就可以避免这些破坏性实验对计算机系统造成不良的影响，不仅可以保证物理计算机的正常运行，还可以保证实验的顺利开展。　　下面以利用VMware虚拟机搭建 “计算机组装与维护”课程的实验环境为例进行介绍，步骤如下：　　1）在机房中的计算机上安装VMware虚拟软件，保证软件的正常运行。　　2）实验准备，在计算机磁盘剩余空间最多的分区新建一个存放虚拟机的文件夹，命名为“Windows7操作系统”，然后启动VMware Workstation。　　3）单击工具栏上的“创建新的虚拟机”按钮或文件菜单下的“新建虚拟机”项，在弹出的新建虚拟机向导中选择“典型”选项，单击“下一步”按钮，选择“稍后安装操作系统”，并单击“下一步”按钮，选择“客户机操作系统”为Microsfot Windows版本为windows 7，然后单击“下一步”按钮，输入虚拟机名称，存放位置选择磁盘上新建的文件夹“Windows7操作系统”，单击“下一步”按钮。指定磁盘容量选择默认大小，单击“下一步”按钮，最后单击“完成”按钮，完成虚拟机的创建。　　4）在安装操作系统之前需要对新建虚拟机的磁盘进行初始化操作（分区、格式化）才能安装操作系统，而磁盘的分区和格式化需要系统安装盘或分区工具，但分区工具需要引导系统启动才能使用，启动的方式很多，这里使用最常用的U盘安装方法进行安装。因此，首先在编辑虚拟机设置下添加U盘设置（在添加硬件设备对话框中单击“添加”按钮，在弹出的对话框中单击“下一步”按钮，选择默认的SCSI选项，单击“下一步”按钮，在弹出的选择磁盘对话框中选择“使用物理磁盘”，单击“下一步”完成即可。并对虚拟机的BIOS 进行启动顺序的设置，开启虚拟机，在启动画面迅速按下键盘的F2进入BIOS设置界面，设置第一启动顺序为USB启动，按F10保存并退出。   　　5）重启动虚拟机，虚拟机从U盘启动，选择U盘中所带的WinPE系统选项，进行WinPE系统，使用WinPE系统中所带的分区工具“Disk Genius”对虚拟磁盘进行分区和格式化。　　6）操作系统安装，在WinPE系统下有一个Windows安装器，这个安装器需要操作系统映像文件和虚拟光驱（将操作系统映像文件打开）。因此，安装操作系统之前需要将映像文件拷贝到U盘或新创建的虚拟机磁盘除第一分区外的分区中。通过安装器复制完安装文件后，重新启动虚拟机，进入BIOS设置，设置为从虚拟机磁盘启动，保存退出，重启虚拟机，进行Windows7的安装界面，单击“下一步”按钮并对相应选项设置，直到进入Windows7系统桌面，安装相应应用软件，完成整个操作系统安装实验，整个实验过程都在虚拟机环境下完成，对机房中的计算机硬盘和系统不产生一点破坏。　　4.2利用VMware解决软件冲突问题　　目前，新增专业和学生越来越多，而教学经费的投入却远远跟不上学生数量的增长，现有机房很难满足实践教学的需要，为保证相关课程的实验实践教学的顺利开展，每个机房每台计算机都需要安装所有课程需要的软件，这不仅导致系统运行缓慢，还存在软件冲突的问题，如，VC++6.0与office2010同时在WIN7系统下安装就会冲突。不管先安装那款软件，只要两款软件同时安装，VC++6.0就无法正常使用。如何解决软件冲突的问题呢？一种解决办法是安装双系统，但安装双系统工作量大，且对机器的配置要求较高。更好的解决办法是使用VMware虚拟机软件安装一台虚拟机，将VC++6.0安装到虚拟机上，就可以解决软件冲突的问题。　　利用VMware解决软件冲突，将安装好操作系统和软件的虚拟机文件包拷贝到机房中的计算机上，实验时，在物理机上运行VMware虚拟机软件，通过VMware虚拟机软件或虚拟机播放器打开已安装好的虚拟机，就可以在虚拟机上进行实验。　　4.3利用VMware解决多服务器问题　　通常机房管理中经常会用到服务器来为机房提供一些服务，比如计费管理服务器、等级考试服务等。如果利用VMware搭建虚拟服务器，只需要使用一台配置较高的计算机，就可以实现多台服务器的搭建，免去重复投资，降低投资成本。配置虚拟服务器时，分配每台虚拟机独立的网址，使每台虚?M机处于独立运行状态，将相应系统安装在不同的虚拟服务器上，并进行配置、测试，这样服务器之间就不会相互干扰。　　利用VMware搭建多台服务器，在一台配置较高的服务器上安装上VMware虚拟机软件，并在此服务器上创建多台虚拟机服务器，根据需要分别命名虚拟服务器，将每台虚拟机安装上服务器操作系统，使每台虚拟服务器使用固定的IP地址，并进行相关的系统配置。如考试服务器的安装与配置，将考试系统软件安装在虚拟服务器上，并进行系统配置与测试，即完成了考试服务器的搭建。　　5 结语　　VMware虚拟机技术在计算机机房管理中的应用，解决了三个方面的问题，首先给计算机等相关专业的很多课程的实践教学提供了一种有效的手段，虚拟机实验环境很好地模拟了真实环境，在虚拟机上完成的实验效果等同于在真实机器上完成的实验效果，完全符合教学要求和满足试验意义。 在虚拟环境下，学生可以放心地进行各种实验操作，不用顾虑对主机系统的破坏，可以增加学生的实践动手机会，加强学生的实践技能。 基于虚拟机技术的虚拟实验环境的建设，在一定程度上缓解当前实验设备和场地不足的问题，提高实验设备的安全性和利用率，降低实验室的管理难度，而且不用额外添加硬件设备的条件下，很好地满足了实验课程对实验环境的要求，从而保证了实验课的正常开出。其次，虚拟机技术还为在同一台计算机上安装多个软件产生软件冲突提供了有效的解决方案；最后，利用VMware虚拟软件搭建多台虚拟服务器，可以很好地为机房计费、计算机等级考试、各种社会培训和考试服务。"}
