{"title": "计算机网络技术小型课程群教学", "url": "https://www.lunwendata.com/thesis/2019/154316.html", "time": ["2019-02-01"], "info": "　　文章编号：1672-5913（2017）05-0019-03　　中图分类号：G642　　0 引 言　　对网络工程专业的学生来说，计算机网络技术是本专业最重要的基础课，其内容比较繁杂[1-2]，直接关系到后续课程，如网络安全、网络系统集成与管理、网络编程和网站开发等课程的学习效果[3-4]。作为网络工程专业的基础教学内容，需要安排较多的学习时间，才能将知识点讲清楚、讲透彻。　　在多年的教学实践中，笔者发现安排两个学期来学习计算机网络中从底层到上层的知识较为合适，有利于学生充分理解网络的理论知识点，并有足够多的时间参与实验。当前主流的计算机网络教材主要围绕OSI七层模型与TCP/IP协议栈四层模型组合后的五层模型来讲述，比如谢希仁教授编写的《计算机网络（第六版）》。在使用该教材的过程中，笔者发现了一些问题，其中主要问题是教学内容的选择与课时的分配。　　在教材提出的五层模型中，物理层涉及较多的通信网内容，知识点多且分散，但该部分并非计算机网络的核心点，可以不作为教学的重点。随着网络技术的推陈出新，数据链路层和网络层在内容上有较多变化：旧版教材中数据链路层和网络层包含的一些网络技术已被逐步淘汰，教材仅以PPP协议和以太网协议作为代表协议进行介绍；网络层也仅限于与IP协议相关的内容；运输层内容变化不大；应用层的一些非主流协议（如FTP、TELNET）也逐步减少了篇幅，同时引入了应用进程跨网络通信内容的介绍。在介绍完整体模型后，教材还引入网络安全、无线网络、通信网络等其他内容。　　1 课程群结构　　经过几年的教学尝试，笔者发现将计算机网络技术拆成几门课，以小型课程群的方式进行教学，获得的教学效果比较好。小型课程群包括计算机网络、计算机网络实验课程、互联网原理与应用、现代通信网概论。这4门课不仅涵盖了传统计算机网络的内容，还包含了一些主流的网络技术，同时能实现理论与实践的紧密结合。其中，计算机网络、互联网原理与应用在内容上完整地包含整个TCP/IP协议栈的内容，这部分是整个网络工程专业知识体系结构的基础，为学生后续学习网络编程、网站开发、网络安全、网络系统集成或管理奠定了坚实的基础。在内容分布上，计算机网络强调底层通信协议，互联网原理与应用强调对高层应用的理解和开发能力，现代通信网概论从横向角度对网络技术进行了?U展。计算机网络实验课程是计算机网络的配套实验课，将理论知识应用在实验中，加强了学生的应用能力。课程群的课程内容对培养“具有较强的网络工程专业知识和工作能力的高级专门人才”起到打基础、长内功的作用，其基石作用在专业培养中不可欠缺。　　1.1 课程学时学分与内容分配　　建设网络工程专业小型课程群的过程中，在学分设置上，计算机网络、计算机网络课程实验、互联网原理与应用属于专业核心课程，分别占4学分、0.5学分和3学分；现代通信网概论属于专业方向课程，占2学分；每个学分分配18个学时。在课程安排上，第4学期开设计算机网络、计算机网络课程实验，第5学期开设互联网原理与应用，第6学期开设现代通信网概论。　　课程的具体内容分配如下：计算机网络讲述五层模型中的物理层、数据链路层、网络层中的IP协议、运输层；计算机网络实验课程在前者的基础上，完成5个验证性实验；互联网原理与应用除了讲述五层模型中的IP路由、应用层协议，还强调基于SOCKET API的网络编程、基于RPC和RMI的互联网应用开发，配合3个课程实验；现代通信网概论作为知识点的衔接课程，介绍当前或曾经出现过的通信网技术，比如通信网中的传送网、信令网、传统电话网、IP电话网、移动通信网、ATM、接入网技术等内容。　　1.2 教材选定情况　　在教材选择上，谢希仁教授编写的《计算机网络（第六版）》虽然对底层协议讲解较多，但应用层协议方面不够深入。Comer D E编写的《计算机网络与因特网（第六版）》对应用层协议介绍较多，但在章节安排上没有完全按自底向上的方式编排。Tanenbaum A S编写的经典巨著《计算机网络（第五版）》，对每部分都有详细介绍，但全书知识点太多，接近800页，不太适合作为师范院校的教材。　　当前的解决方案为：计算机网络继续使用谢希仁教授编写的《计算机网络（第六版）》，但互联网原理与应用使用Comer D E编写的《计算机网络与因特网（第六版）》。对课本中不够详细的内容，应通过教学课件进行补充介绍。主讲教师在课堂上给出足够的解释，同时标注参考书籍和参考网页内容，让学生课后自行查阅。现代通信网概论使用杨武军副教授编写的《现代通信网概论》。计算机网络实验课程使用学院自行编写的实验讲义。　　1.3 教学新形式　　从课程群的内容可以看出，整个课程群其实围绕着“如何将信息从一台计算机传输到另一台计算机”这一问题逐步展开。重点内容体现在TCP/IP协议栈中的数据链路层、网络层、运输层和应用层的协议及相关技术。难点在于学生学完所有内容后，如何将这些知识有机地联系起来，完整地回答前面那个看似简单却十分复杂的问题。　　为了让学生对问题和问题的答案有清晰的理解，在计算机网络的第一堂课中，任课教师抛出这个问题，然后让学生带着问题听课。教师每讲到一处知识点的时候，适时地将问题结合起来，提示学生当前知识点与问题的关系，该知识点解决了问题中哪个细节，从TCP/IP协议的底层一直到应用层，层层强化内容与问题的关系。在讲授现代通信网概论的时候，从横向角度扩展，向学生解释在不同环境下通信网络或计算机网络如何根据不同环境不断变化技术手段，进而解决这个最基本问题。   　　通过几年的教学尝试笔者发现，采用这种小型课程群组课的方法，结合现代多媒体教学手段和上机实验操作，学生能够较牢固地掌握这些课程的关键内容，并对网络工程的全局架构有一个整体认识，为学习其他专业课程打下良好基础。　　2 ?n程群实验教学内容　　作为理论的实践部分，计算机网络实验课程是网工专业的核心课程之一，其设计初衷是让学生有更多的动手机会，并在动手过程中提出问题，鼓励实验者自行寻找答案并进行理论解释，从而加深其对理论知识的理解。此门课程共包含5个实验，覆盖课程的主要理论知识，分别是以太网抓包实验及网线制作、小型局域网设计与VLAN配置、静态路由配置、ARP抓包及ARP欺骗设计、TCP协议的工作原理和分析。　　互联网原理与应用课程中包含3个课程实验，与前者不同，实验是课程的一部分，不单独计学分。3个实验分别是SOCKET网络编程设计、应用层TELNET和FTP协议分析、应用层HTTP协议分析，要求学生完成一个网络编程程序和3个协议的抓包分析实验。　　实验配备专门的网络工程实验室。实验室共有5个机架，每个机架安装2台二层交换机、1台三层交换机、4台路由器、4台电脑。在保证人手一机的前提下，每次能容纳20名学生完成一个批次的实验。　　实验前，教师提供实验指导供学生预习，一些稍难的内容（比如机柜中网络环境的搭建、如何用PC机配置网络设备等）会在实验前进行简单讲解。实验过程中，主讲教师和2～3名研究生在现场辅助学生，解决学生在实验过程中遇到的问题。常见问题包括抓包软件无法捕获数据包、ARP欺骗实验无法实现欺骗、添加路由后网络无法连通等。对于遇到问题无法继续实验的学生，指导者会先进行原理分析，启发学生找到问题的根源，然后找出相应的解决方法。实验完成后，学生需要提交实验报告并分享自己的实验心得，重点分析实验中遇到的问题以及解决方法。　　从实验过程和实验报告的结果来看，两门课程设计的实验内容对学生理解理论知识、识记关键内容效果明显。这些实验对学生深入理解报文格式、协议原理有很大的帮助，同时能激发学生的学习兴趣，使学生愿意动手“折腾”。　　3 结 语　　单门课程单打独斗发展为几门课程联合起来形成课程群，是当前教学改革的新形式。在未改革之前，几门计算机网络相关课程无论课程内容还是课时安排，都存在一些交叉重叠的问题，使得部分知识点重复讲述，但重点内容却没有足够的课时展开。经过小型课程群建设改革后，上述问题得到了解决，整个网络技术的内容安排也更加科学合理。学生对课程安排的满意度大大提高，对知识的理解与掌握也更加深刻。整体上，通过几年的实践教学，以小型课程群方式讲述当前计算机网络的主要技术有益于学生接受、理解网络的关键技术，能拓展学生的视野，提升其实际动手能力。"}
