{"title": "论计算机多媒体在教学中的应用", "url": "https://www.lunwendata.com/thesis/2019/159303.html", "time": ["2019-03-27"], "info": "　　随着知识经济时代的来临，掌握知识的人才日益成为国家繁荣、民族振兴的决定性因素和主要资源。远程教育这一基于计算机技术和通讯技术的教育方式，正以其自身优势，成为现代教育的一个亮点。课程建设是学校提高教学质量的一项重大举措。学校能提供的产品是专业和课程，是课程以及围绕着课程所提供的服务。对于计算机基础教育这类应用型课程而言，学习的方向应瞄准应用，学习的目的是学会做事，这既是课程改革的关键，也是评价精品课程最重要的客观标准。　　一、多媒体现状　　1、中国网络远程教育发展趋势虽然缓慢，但仍不失上升态式以EDU域名注册的网站以每半年增加几百家左右的速度向上攀升。从这一显而易见的角度来看，早在1998年，教育部颁发《面向21世纪教育振兴行动计划》文献中就指出：大力发展我国网络远程教育。程序语言从C、C++到Java，程序设计方法从面向过程、面向对象到面向代理，这些发展变化让人不知所措。计算机基础教育的落后状况有目共睹，为此我们一直在探索学习方法和教学方法，但收效甚微。读了系列专访“一项计算机基础课程改革的启示”，突然觉得找到了探索的方向和方法：以辩证唯物主义为指导，才能找到有效的学习方法和教学方法，才能推动计算机基础教育。　　2、与发达国家相比还有一定的差距我国近程教育主要集中于基础教育在发达国家，网络教育的主体是高等教育、成人教育、继续教育。我国的现代教育正逐步摆脱传统的\"教师――黑板――教科书――学生\"的教学模式，提出大力发展素质教育，提倡培养学生的积极主动性，创新能力及自主学习的能力。为适应学生学习的需求及教育发展的需要，我们的教育引入了多种多样的教育技术手段，如幻灯、投影、电视、录像等视听媒体技术，卫星通讯技术，计算机多媒体技术，计算机\"虚拟现实\"的仿真技术和网络教学技术。　　二、提高课堂教学效率　　计算机基础教学应该大力提倡“精讲多练”，“精讲”要求教师讲出内容的精髓和基本知识点，“多练”要使学生有机时、有目标、有实效。因此，计算机实验教学应在教学计划中占有较大比重，要作统筹安排，形成较完善的实验教学体系，以利于培养学生的计算机应用能力。基于数据网络的计算机远程教育研究始于80年代后期，90年代步入实践。我国远程教育规划是1997年经酝酿提出的，1998年正式批准立项，1999年是整个项目启动的关键一年。规划的近期目标是到2000年要通过网络互联10130所各级学校，并使8000所贫困、边远地区的中小学具备利用卫星上网的能力。目前，我国的清华大学、北京大学、湖南大学、浙江大学等一大批大学建立了自己的远程教育实验室或远程教育中心，基于综合数据网的远程教育研究正在部分院校蓬勃展开。　　可以把符号、语言文字、声音、图形、动画和视频图像等多种媒体信息集成于一体，使学生所学的知识以图表、彩色文字、动画、游戏等多种方式呈现，让学生动眼、动手、动耳、动脑，增强学生的学习热情和对知识的理解，使学生通过多个感官来获得相关信息，提高信息传播效率。　　计算机基础教学应努力做到理论与实践、知识传授与能力培养相结合，将能力培养贯穿在教学全过程，以保证学生具有较强的实践动手能力。根据教学内容，教学对象和教学条件等具体因素，我们应该选择比较合适的教学方法。　　三、利用多媒体工具软件提高教学质量　　多媒体技术是90年代兴起的一股热潮，以往的计算机通过视觉才能接受信息，后来增加了“听”的功能，人们才把具有“视听”两种以上功能的计算机称之为多媒体计算机，并把这种技术称之为多媒体技术。近年来它的发展非常迅猛，从一台计算机到局域网乃至国际互联网络，都可以使用。科学实验纷繁多样。微观的、宏观的、活动的范围很广。传统教学中的演示实验较多，学生的实际操作相对较少，尤其是一些大型设备的试验，往往没有这种试验环境。这样，我们可以用计算机多媒体来实现此类实验，通过计算机多媒体音频、视频、动画等的合成，使学生如同身临其境，这样就大大增强了学生的感性认识，而且提高了学生的实验效率，节省了自然资源。　　多媒体技术改变了微计算机多年来生硬、呆板的脸孔，换上了丰富多彩、形声并茂的漂亮面容。使以往靠多种设备、技术实现的课堂多媒体教学集计算机于一身，具有集成性的特点外，其明显的优势是还具有即时性、交互性、信息量大和能够进行个别化教学的功能。计算机科学的快速发展，积累了庞大数量的实证的知识材料，如果我们把这些知识材料平等看待，毫无关联地排列起来，像照镜子式地直观反映，那么它们不仅表现为杂多，而且因为我们孤立地看待它们，所以对很多复杂的概念无法理解，这样就超出了我们的认识能力。面对程序语言的不断发展，我之所以感到困惑，主要就是因为我没有牢牢掌握辩证唯物主义这个法宝，一心一意地去探索程序语言内在联系和发展规律。人们常称这类只有“视的”功能的计算机及其网络技术为一般的多媒体技术。　　四、结束语　　实施计算机远程教育是中国国情的需要。我国是发展中国家，教育资源比较紧缺，现有教育资源远远不能满足需求。而采用常规的措施和方法，例如建设学校，增加学校数量，所需投入太大，短时间内也不能解决问题，特别是高等教育的大众化、普及化。我赞同《计算机教育》主编的倡导：“我们共同努力，来落实邓小平同志提出的‘熟悉马克思主义的基本理论，从而加强我们工作中的原则性、系统性、预见性和创造性’。我们坚信，沿着这个方向走下去，我们一定能够在计算机教育领域里真正有所作为。”　　总而言之，高职教育未来发展的重点是质量和特色随着高等职业教育从观念更新与模式转换向教学过程深入，这样的改革方向是种必然。计算机科学技术的发展和计算机应用水平的提高，对计算机基础教育也提出了更高要求。计算机技术正在以飞快的速度发展，我们的计算机基础教学要与当前计算机科学技术以及利一会经济发展相结合，尤其是计算机基础教学，更应与当前计算机应用技术的发展相适应。随着计算机应用技术的不断发展，今后在教学中将而临更多的新问题，我们要为计算机基教育的发展继续研究和探索。"}
