{"title": "浅析中职院校计算机应用基础课程教学的知与行", "url": "https://www.lunwendata.com/thesis/2019/157143.html", "time": ["2019-03-03"], "info": "　　 中图分类号：G712 文献标识码：A &nbsp; &nbsp; &nbsp;文章编号：1003-9082（2015）11-0126-02　　自上世纪90年代以来，信息技术和信息产业发展迅速，信息网络生活化成为当今社会的主流，06年国家提出信息化发展战略，推动了计算机应用这门学科在广大专科院校的发展，各专科院校将计算机应用基础课程作为学生的公共必修课程，作为掌握计算机应用的基础类课程，如何引导学生认识、学习这门课程并且能够掌握运用，是整个教学过程的关键。　　一、现阶段中职院校计算机应用基础课程教学的现状　　中职院校的创办主要导向是为了适应社会、企业的需要，培养实用性综合人才，开设计算机应用基础这门课程是响应社会发展，培养技能型人才的实践型课程，在现阶段的教学过程中还未完全达到开设这门课程的主要目的;出现了以下几方面的问题：　　1.课程内容不合理，与课时安排不平衡　　计算机应用基础课程的主要内容为计算机的基础知识、Windows、Microsoft office的主要软件例如： Word、Excel、PowerPoint以及网络基础知识、多媒体等。整本教材的内容主要分为专业性理论知识和软件的操作知识，专业性的理论知识例如网络基础知识、网页的编制和基础编程课程等内容，专业性较强，讲授也比较枯燥，与实际生活和学习联系性不强，学生的学习积极性明显不高;对于某些较为常见、接触较多的软件如word，学生的学习又表现出比较轻松，不重视的态度;实际操作运用却不是很熟练;这就出现了难的内容学不会、简单的内容不愿意学的恶性循环，而且整本教材的内容过多，与实际安排的课时不平衡，学生没有充足的学习时间，学习这门课程，给教学质量的提高提出了考验。　　同时，理论学习课时和操作实践课时安排不合理，较少的实际操作使理论知识只停留在教材上，计算机应用基础课程是以应用为目的的课程，达不到熟练的运用计算机技术，是计算机应用基础课程教学的普遍问题。　　2.教材更新慢，与实际情况脱节　　计算机技术发展速度快，相比其他类型的教课内容更新换代十分频繁，教学内容应该以计算机技术的发展而改变。但是，从知识的出现到编进教材，这需要至少一到两年的时间，再当学生拿到教材学习到的时候，教材里面的“新知识”已经与实际情况脱节，变为“旧知识”了。计算机知识注重的是实用性和可操作性，教材更新的缓慢，直接与计算机知识的实用性相违背，跟不上实际需要。　　另一方面，计算机应用基础课程作为公共必修课程，范围面向全校所有专业的学生，没有结合不同专业的实际情况开设相应的内容，专业性不强与专业应用联系不上，也是计算机应用基础课程教学知行统一的障碍。　　3.计算机应用基础课程应试教育化依然占主导地位　　计算机应用基础课程是理论与实践相结合的课程，实际运用能力体现了中职院校培养技能型人才的核心理念。但是还有很多院校将是否通过计算机应用的等级考试作为考量课程质量的标准，这是把计算机应用知识应试教育化，为了追求考试的过关和计算机等级考试的合格，学生和老师将注意力都集中在应试题目和应试内容上，并不知道所学习内容的实际作用，甚至无法通过学习的内容完成一些简单的工作。　　4.不同的学生情况和单一的教学方式　　我校的中职生来自省内的不同地区，由于地区条件的不同，和学生的个人能力不同，接触与学习计算机的程度上都是不一样的。有些学生对内容的掌握更加容易一些，有些学生则较为生疏，生疏的学生则由于外界的影响，对这门课程的学习较为被动有消极抵触情绪。　　在教学方式上，一般的模式为三步走即：第一步，由老师的集中讲解教材中的理论知识内容，;第二步，老师利用多媒体设备演示给学生操作流程;第三步，老师指导学生上机训练。这种教学模式使教学与实践脱离开来，学生在听理论讲解的时候会十分枯燥，无法集中精力。在实际操作时，只简单重复老师的教学过程，不会思考每一个步骤的内容，不明白操作的目的，不会举一反三。只得到“鱼”，并没有学会“渔”，这是计算机应用基础课程教学难以知行统一的主要问题。　　二、计算机应用基础课程教学知与行统一的几点建议　　教学质量的提高与学生的努力学习和老师的教学密不可分。计算机运用基础课程与其他课程不同，是社会发展所产生的新学科，有较强的社会运用性。在这门课程的教学上，不能单纯的复制学习其他课程的教学方式，要独立开发具有应用型课程特点的教学内容和方式。　　1.优化课程内容，合理安排课程　　教材的编制需要一定的时间，无法做到及时更新;教学内容的更新则需要老师的补充和指明;建议老师在拿到整本教材时，对所有的授课内容做一个分析，将基础的理论知识和操作知识做适当的保留，对社会上已经明确不再运用的知识进行删除，对新出现的成熟的计算机应用的相关知识进行补充，也可以鼓励和指导学生去发现新的计算机运用知识，将这些知识补充到教学中来，不仅能提高学生的课程积极性，同时也保持了课程的时代性。　　我校长期开始十余种专业技能的课程，对于不同专业的学生，应该将计算机运用和专业相结合，提高学生的积极性，也辅助专业课程的应用性。例如我校发展较为优秀的医疗专业，医疗的信息化，将会使学生在本专业的技能发挥上，得到更好的发展。   　　另外，要重视实际操作课程的安排，将理论课程安排和实践课程安排的时间比重调整，提高学生的实践操作时间，多布置一些开放性的操作题目，让学生发挥其创新性。对所有学生的操作情况做一个纪录和分析，对能力较差的学生多给予关怀和指导，帮助其进步。　　2.优化授课技巧，创新教学方式　　在授课过程中，授课技巧可以多有一些变化。对于死板枯燥的理论知识，更是要创新出新的教学方式，提高学些的兴趣和积极性，把理论知识活化，帮助学生更好的吸收。在实践课程上，注意提高学生的参与性和主动性，把主导性让给学生，老师作为指导的角色，让学生更多的实践操作。在操作中思考并提出问题，更好的运用所学到的知识，做到教学的知行统一。　　建议能够小班教学，根据不同计算机水平制定不同的教学内容。对能力较为薄弱的学生加大关注和辅导，对能力较强的学生给予更深层次化指导，提高能力，最大化的发挥教学效果。对于一些与实践操作相关的理论知识，可以在上机训练的时候讲授，让学生更直白明显的接受，提高教学质量。　　三、总结　　计算机应用基础课程是计算机应用的入门课程，是掌握计算机应用技能的敲门砖，只有踏实高效的学习好这门课程，才能培养出专职性的实用型人才。作为教师，利用计算机应用基础课程，让学生对计算机有一个总体的认知，通过这门课程提高自身和专业能力，发挥更大的价值是教学的主要目的。教学的知行统一，是教学的必修课，特别是计算机应用基础课程这样社会上应用性较强的课程，更是要将“行”，贯彻到教学的始终，以“知”为前提，以“行”为目的，避免“知行分离”的现象。以提高教学质量，让计算机应用基础课程发挥更大的教学效应，为社会培养更全面综合素质优良的专用型人才。"}
