{"title": "高职院校如何做好计算机网络安全管理工作", "url": "https://www.lunwendata.com/thesis/2019/155958.html", "time": ["2019-02-18"], "info": " 　　摘 要 在科技高速发展的今天，网络已经深入人心并普及到全国各地中，为此，我们高职院校也必须紧跟时代步伐，将计算机网络系统普及到高职院校中，让高职院校学生能够更加了解世界、了解社会所需、提升自我。高职院校因为历史原因与技术水平的限制，计算机网络安全出现一系列的漏洞与风险。为此，笔者根据自身经验来分析高职院校网络存在的问题与不安因素，并对其进行分析。　　关键词 高职院校 计算机网络 安全 防护　　随着计算机技术的普及与高职院校的飞速发展，众多高校都建立了属于自己的计算机网络系统供学校使用，它已经成为了高职院校信息系统不可或缺的一部分。为此，计算机网络安全管理工作已经成为高职院校信息化的重点问题，如何做好计算机网络安全管理工作？笔者对其进行阐述：　　一、高职院校计算机网络安全存在的风险　　网络安全：最大限度地减少数据与网络资源被攻击的可能性，采取一系列措施与管理方法，保证在网络环境里的数据信息完整性、真实性、保密性、可用性等。　　(一)网络系统软件的安全隐患　　现在众多高职院校采用的操作系统多数都是Windows 2000 、Windows98、WindowsXP、部分高职院校采用的操作系统为Win7。除开Win7操作系统，其余操作系统本身对于安全方面的考虑就比较少，服务器、数据库与相关的商用产品都存在安全漏洞与隐性病毒等，都会给计算机网络系统带来安全风险。　　（二）计算机、网络设备的安全隐患　　计算机或者是网路设备都会因为各种硬件本身的故障、突发性自然损坏、人为损坏等造成系统或者网络不能正常使用。高职院校中，部分学生的素质问题，对于计算机设备或者网络设备进行偷窃、攻击、损坏都会造成计算机系统不能正常工作。　　（三）计算机网络安全管理隐患　　高职院校因为历史原因对于计算机网络安全管理制度的不完善、偏差造成管理人员在管理的过程中无法找到相应的管理制度来进行妥善管理。　　1.制度的不完善　　高职院校信息化系统建立的过程中，因为没有相应的管理制度，或者是因为管理制度不完善，或者是直接引用其他高校的管理制度来进行管理；这些都严重的限制了计算机网络安全管理的正常进行，管理人员在工作过程中无法找到相应的管理制度来进行管理，或者是管理制度根本不适用于本校的管理，造成了安全制度难以执行的情况发生，安全制度形同虚设。　　2.人员素质的隐患　　学生或者是管理人员在进行使用计算机网络时因为素质参差不齐对计算机网络不正常使用造成的安全隐患。学生的好奇心严重，对于计算机网络系统抱着尝试、对立的态度，比如：熊猫烧香病毒就是由一名学生利用学校网络系统来制定的攻击型病毒。管理人员的素质也有待提高，众多高校中计算机机房的管理人员对于计算机的有关信息并不了解，对于管理更是一窍不通，仅仅只是在“看守”计算机设备，导致计算机网络系统出现异常、故障不能及时地进行处理。　　二、高职院校如何做好计算机网络安全管理工作　　（一）明确使用安全体系结构交稿的操作系统　　计算机的操作系统在一定程度上能够减少网络安全问题出现的几率。比如：Windows XP、Win7操作系统，在这类操作系统中都自带了一些防御措施，能够将一些比较常见的网络病毒、攻击进行抵御，在一定程度上减少安全隐患。　　（二）学校有关部门加强对计算机设备、网络安全监督管理　　各高校的有关负责人必须自身了解计算机设备、网络安全管理的知识及经验，并不是仅仅将设备进行“看守”就可以，对一些常见的计算机故障要能够第一时间进行解决，网络安全必须随时进行检查，是否存在漏洞，是否存在不安全因素，是否需要重新设定安全防火墙等等……　　（三）学校必须有完整的制度　　各个高职院校的计算机网络系统都是不尽相同的，高校计算机网络安全管理人员应该根据自身高校的实际情况，结合各高校的安全管理制度来制定属于自己高校的安全管理制度，严格按照制度执行有关规定，将人员安全因素与自然安全因素引起的隐患防范于未然。　　三、结束语　　信息化在各个高职院校中得到普及，不仅仅是科技高速发展的结果，也是各高职院校不断改革、发展、创新的成果。高职院校进行信息化普及能够有效地提升教学质量，减轻教师教学负担，造就综合型人才；所以，我们各高职院校必须大力引进与提倡信息化教学，将信息化教学融入到各高职院校的日常教学范围之内；保证计算机安全网络是进行教学学习的基础与前提。　　在日常计算机安全网络管理过程中各高职院校要不断积累管理经验，结合其他高职院校的管理制度来建立一套属于自己的校园网络安全管理模式，制定详细的安全管理制度，在日常的管理中严格的按照制度来进行执行，将计算机网络安全纳入管理工作的重心进行对待，将一切不安全隐患消灭于未然，营造出一个良好的教学、学习、管理氛围。　　参考文献：　　[1]孙君.高职院校计算机机房的日常维护与网络安全管理探析[J].计算机光盘软件与应用,2011,(2):193.　　[2]罗晓东,杨珍,张媛等.高职院校网络安全威胁与防护[J].科协论坛（下半月）,2009,(9):64-65.　　[3]黄清.高职院校计算机网络安全研究与分析[J].计算机光盘软件与应用,2011,(20):207-207. "}
