{"title": "项目教学法在高校计算机教学中的应用探究", "url": "https://www.lunwendata.com/thesis/2019/157767.html", "time": ["2019-03-09"], "info": "　　随着计算机技术及网络技术的不断进步荷发展，随之人们的学习、工作及思维方式都在发生变化。在推行素质教育的今天，提高学生的计算机知识技能水平，是计算机教学的最终目标。目前高职院校学生对于计算机学习兴趣浓厚，但对计算机课程的教学内容积极性并不高。探究原因，主要是因为现行的教学模式及方法不太适合计算机课程的教学。因而，转变教学方法，使得学生能在计算机教学中充分发挥学习的主动性及创新精神。而项目教学法主要是以行动导向为主，从而为注重技能培养的计算机教学提供了新型的教学方案及思路。　　一、项目教学的特点　　（1）目标指向具有多重性。学生通过转变学习方式，在积极主动的学习环境中，充分发挥好奇心及创造力，提高分析及解决实际问题的能力。（2）培训周期短，效果显著。项目教学法一般是在很短的时间及有限的空间环境下实行，且的教学效果可测评性好。（3）可控性好。项目教学法由学生和教师共同参与，教师全程指导学生的活动，这样学生能集中注意力学习技能。（4）注重理论与实践相结合。要完成一个项目，肯定会涉及怎么做的问题，这就要求学习结合自身掌握的原理知识开始着手，结合原理分析项目工作流程。　　二、项目教学法在计算机教学中的应用　　（一）应用项目教学法时应该遵守的基本原则。（1）以学生为中心，教师为辅，高校在计算机专业教学中引进项目教学法时必须充分发挥教师的辅助作用，在进行项目教学设计中，坚持以学生为中心，要进一步明确学生在教学中的主体地位，以提高对学生创新能力和学习主动性为目的。要明确教师的位置，其教师在教学过程中的主要起到指导和辅助作用。（2）项目的选取是计算机项目教学的关键，在取项目要时需结合教学的内容，以实际的对象作为材料，既要包含基本的教学知识点，又可充分调动学生解决实际问题的积极性。项目的选取需学生和老师共同参与，教师要鼓励、启发学生自己去发现身边的素材，采用适合的工程项目。（3）创设学习的资源及协作学习的环境是教师最主要的工作。教师提供多种机会让学生在不同的情景下学会应用不同的知识，充分应用现代教育的有效方法给学生提供的多种学习资源。（4）根据学生完成项目的情况来评价学生学习效果。学习过程的最终目不是教学目标，而是完成意义建构。教学是围绕完成项目设计、达到意义建构这一中心来进行的，而不是围绕教学目标展开，因而评价学生学习效果应以完成项目的情况来评定。　　（二）教学项目的设计。明确教学目的、教学目标是教学过程的最终目的。需要根据计算机专业培养方案中技术能力的要求建立，整个教学过程都要以此为目标。计算机教学的可操作性强，在设计教学目标的时，可从认知、技能等多方位考虑，要充分考虑到学生的各种因素的影响，还要尊重学生自我的个性成长。学生在学习枯燥的理论知识时积极性和主动性不足，但是操作能力、语言能力强，将乏味的理论学习融入到合理的项目中，可以提高学生的学习兴趣，挖掘学生的潜能，从而提高学生的学习效率。　　（三）确立实施项目。做好教学情境的设计，是整个项目教学能够顺利的实施的前提条件，所以在设计过程中必须结合实际情况，进行合理的安排教学情境。合理的教学项目是项目教学法最终能成功的有利保证，在设计教学项目时要把教学内容做为基础，还要结合学生的日常生活，老师可充分的发挥自己的想象力，为学生设计一个不但可以运用之前所学的知识去解决问题，又可以在其过程中进行创新的项目，通过项目让学习掌握新的知识。　　三、在项目教学的过程中应注意的问题　　（一）对教师子综合素质的要求。在项目教学法中，教师是学生学习的引导者同时又是学生学习的合作者，又是不断完善自身知识结构的终身学习者，项目教学法要求教师不只要熟练掌握专业知识，能力素质好，使之能养出高素质、高技能的学生，在社会上更具竞争力。另一方面，在项开展目教学时，要求教师要对本课程有一个整体的思路，具有创造性和较强的应变能力，要仔细观察每个学生的学习情况和兴趣发展，根据每个学生的特点针对性设计出不泯灭学生个性又可全面平衡的教学方案。　　（二）课时安排问题。项目教学法跟传统教学不同，不只要掌握专业知识，最主要的是学会运用所学的知识，学生在进行项目实施的中，要将专业理论知识和实践进行相结合，需要有一定的时间才能完成，在项目教学中，师生普遍感觉课时太少，只能研究一些小的项目，而对于一些时间稍长的有价值的项目根本无力去完成，从而影响了学生的求知欲及挑战性，挫伤了学生的积极性。　　（三）教学过程的调整。项目教学法有效教学策略，引导学生对实际的事物进行深入的学习。当实施合理的项目教学时，可以激发学生的学习积极性，能主动学习且完成项目作业的质量高。所以教学策略要根据班级的情况及学生个体的情况临时调整。　　四、结语　　现代社会是信息技术社会，也是计算机快速发展的时代，因而需要大批优秀的技能型人员，但传统的计算机教学并不能激发学生的学习兴趣。而现代企业的员工需要动手能力强，可自主解决各种实际问题，且具有较强的团队和奉献精神。实施项目教学法可以充分调动学生的学习兴趣，又可以更好使学到的理论知识地运用到实践中，提高学生的综合能力，所以各高校在计算机教学中实施项目教学使很有必要的。"}
