{"title": "计算机网络课程面向校企合作的教学实践", "url": "https://www.lunwendata.com/thesis/2019/156635.html", "time": ["2019-02-25"], "info": "　　0 引言　　CNNIC（China Internet Network Information Center，中国互联网络信息中心）在《第 35次中国互联网络发展状况统计报告》中指出：“截至2014年12月，中国网民规模达6.49亿，全年共计新增网民3117万人。互联网普及率为47.9%，较2013年底提升了2.1个百分点[1]”。网络不仅缩短了时空距离，加快了信息传递速度，使各种网络资源得以共享，而且还创造出了更多的机会，可以有效地提高传统产业的生产效率，有力地拉动消费需求，推动生产力发展[2]。　　网络的重要性决定了计算机网络课程在高等教育中的重要性。当前，高校的计算机专业、软件工程、网络工程等相关专业都开设了计算机网络这门课，并且是作为核心专业课程来安排。该课程理论强、概念抽象、知识发展快，而且实践性和应用性很强。在教学中，学生不仅要掌握相关理论知识，而且要能够很好的理解和运用所学到的协议和概念，能解决具体的网络问题。针对计算机网络课程教学中存在的问题，结合我校和广州腾科网络技术有限公司的合作，本文探索了基于校企合作在计算机网络课程教学中几个方面的改革和实践。　　1 计算机网络课程教学中存在问题　　1.1 教学内容　　计算机网络课程概念很多、理论性很强而且比较抽象。在教学中，主要以计算机网络协议族为主，包含了物理层、数据链路层、网络层、传输层和应用层的协议，并扩展了网络安全、无线网络和下一代IPV6协议等内容。学习过程中，主要以教师教授书本上的内容，学生通过上课学习和课后实验来掌握要求的内容。但是教材上的内容是以协议理论为主，而实际的案例和相应的应用不足。如果单纯只是教授这些协议内容，一方面无法做到全面深入的讲解计算机网络的知识，另一方面学生也无法具体的理解所学习的协议的内涵以及其应用的方面，无法做到融会贯通。因为计算机网络课程有太多的概念和协议，这些都很抽象，如果不辅助以相关的实际的案例和操作，是很难理解的，这样只能做到空对空，结果虽然协议都背诵和记忆下来了，但是并不理解是真正的内涵；学生不能认识到所学到的知识的用处，容易失去学习的积极性。这样教学与实践相脱节，无法培养出符合社会需要的人才。　　1.2 教学模式　　当前的教学主要以教师教学为主，学生被动的接受，教学的效果很大程度上取决于教师的教授。而学生往往认为上课听懂了，课后练习都做完了，就是掌握了要学习的内容。然后这种教学模式由于缺乏学生有效的反馈，教师并不能真正掌握学生学习的程度；而且学生往往对于协议内容一知半解，并不能全面理解和应用网络协议。　　计算机网络是一门实践性很强的课程，如果只是教授理论，学习和练习书本和课后习题的例子，不足以掌握其相关知识。以理论为主的教学模式并不能够满足计算机网络课程的教学，学生无法熟练掌握计算机网络的相关协议，无法规划和设计小型的网络，不能够培养学生网络思维能力和运用网络知识解决实际问题的能力。　　1.3 师资力量　　教师的在教学过程中处于非常重要的位置，只有教师掌握的相关的知识，才能熟练的营造良好的教学氛围，才能够很好的教授给学生；相反，如果教师本身知识不扎实，对要教授的内容掌握不全面，对知识理解不透彻，学生想要学好是很困难的。正所谓“要给学生一杯水，教师要有一桶水”。　　然后现实中，计算机网络的师资大多没有直接从学校毕业就进高校工作，理论知识扎实，对网络协议研究方面比较在行，能够从事相关的研究工作，但是没有实践工程经历，缺乏实际的网络配置和管理经验，对网络的规划、设计和实施并不是很了解。由于自身教育知识背景的不足，导致在教学中往往只能够照本宣科，即使能够在网络的某几个方面进行拓展讲解，始终也无法全面的讲授计算机网络的知识。　　2 校企合作的实践与创新　　为了提高计算机网络课程的教学效果，我们和广州腾科网络技术有限公司合作，在教学的多个环节进行合作，采取多种手段，理论联系实际，以实现培养具有独立创新思维能力、理论基础扎实、实际动手能力强的计算机网络工程人才。　　2.1 教学大纲　　计算机网络课程应该理论知识与实践能力并重，通过在教学大纲中穿插入相应的实践内容，以提高学生对理论的理解以及实践动手能力。在理论教学上，为了保持系统性和科学性，重点以TCP/IP协议为主，讲解物理层、数据链路层、网络层、传输层和应用层的协议内容；在协议的讲解中插入实践教学的内容。通过和广州腾科网络技术有限共同制定教学大纲，将CCNA的内容嵌入计算机网络的教学中，在每一个完整的知识点后插入一个CCNA的实践内容，最后以综合的CCNA综合实验作为总结。CCNA是思科网络认证体系的基础阶段，通过CCNA内容的学习，学生可以掌握具体网络命令，交换机和路由器的配置，以及基本网络的规划设计和配置。在数据链路层，插入交换机和路由器的基本连接、CDP等基本命令，以及交换机的基本配置；在网络层中，插入IP地址、RIP、OSPF、BGP和VLAN相关的配置实验；在传输层插入NAT和PAT的配置实验；在应用层，插入Sniffer网络抓包实验，基于多种标准的应用层协议，查看应用层中数据包的头部和内容。　　2.2 师资培训　　在师资培训方面，我们和广州腾科网络技术有限公司合作，基于CISCO的培训体系，开展CISCO认证培训。广州腾科网络技术有限公司紧跟网络技术的前沿，具有大量的网络工程实践项目经历，同时在CISCO培训方面具有多年的经验。至今为止，我校已有10名教师通过了CCNP的认证，1名教师通过了CCIE Security的认证，还有3名教师分别在接受CCIE路由与交换、CCIE安全和CCIE网络服务提供商的培训。在培训过程中，教师可以通过真实的实验，对网络的理论知识有了更深刻的理解与认识；通过对CCIE的网络的规划与配置，可以增加教师在网络某一个方面的知识体系，使得网络知识更加全面和丰富；同时教师在培训过程中，通过参与腾科公司的工程项目，也积累了大量的一线工程实践经验，这些知识反馈到计算机网络课程的教学中，可以营造更加生动活泼的课堂，具体例子可以随手拈来，而且可以更加通俗易懂的讲解书上的协议，可以很好的做到深入浅出。   　　2.3 教学实验　　在实验组织上，我们设计了基础实验、阶段性实验和综合性实验等三阶段的实验体系。其中基础实验包括：1.通过console口访问路由器；2.通过telnet访问路由器；3.配置终端访问路由器；4.路由器几种配置模式；5.路由器IOS配置基本命令；6.IOS系统的备份与恢复；7.CDP基本配置；8.交换机基本配置；9.交换机IOS备份与恢复。阶段性实验包括：1.IP地址配置；2.静态路由配置；3.默认路由配置；4.RIP路由配置；5.RIP子网汇总；6.RIP认证；7.单区域点到点链路OSPF；8.单区域广播链路OSPF；9.OSPF认证；10.多区域OSPF配置；11.BGP基本配置；12.VLAN划分；13.TRUNK配置；14.单臂路由实现VLAN路由；15.三层交换机实现VLAN间路由；16.DHCP基本配置；17.DHCP中继；18.静态NAT配置；19.静态NAT配置；20.PAT配置。综合实验阶段包括：多校区校园网网络规划与配置。在综合实验中，构造一个包含大型的校园网络，在要求中，涵盖了多种路由协议、VLAN、DHCP、NAT和PAT等多方面的要求。学生通过完成综合实验，基本可以掌握计算机网络课程中网络路由交换相关实践内容。　　2.4 实验平台　　在计算机网络课程的实验教学中，我们建立的虚拟实验环境和真机实验环境等两类实验平台。虚拟实验环境基于Packet Trace建立，Cisco Packet Tracer 是由Cisco公司发布的一个辅助学习工具，为学习思科网络课程的初学者去设计、配置、排除网络故障提供了网络模拟环境。用户可以在软件的图形用户界面上直接使用拖曳方法建立网络拓扑，并可提供数据包在网络中行进的详细处理过程，观察网络实时运行情况。可以学习IOS的配置、锻炼故障排查能力。　　除了虚拟网络平台外，我校还购置了CISCO的硬件设备，搭建了CISCO网络实验室，其中包括8组路由和交换设备和4套安全设备，分别都可以满足CCNP以上级别考试要求。通过具体的硬件设备，学生可以构建相应的网络，配置IP地址、子网掩码、网管、多种路由协议、VLAN、NAT、DHCP、DNS、多种通信冗余协议、多种VPN，访问控制、PKI、防火墙和入侵检测等网络相关技术。学生通过真实的网络环境，接触真机，解决网络中出现的各种问题，可以很好的提高计算机网络课程的学习效果。　　3 结论　　通过和广州腾科网络技术有限公司合作，我校在计算机网络课程教学上多个方面进行了改革和探索，实践现实，校企合作的教学效果很好，学生普遍反映很好的掌握了计算机网络的知识，在理论和实践能力上都有了很好的提高。下一步，我们将在网络协议分析、网络安全和网络应用软件设计等方面开展校企合作，以更好的培养学生。"}
