{"title": "计算机网络课程中的项目式实验教学思路分析", "url": "https://www.lunwendata.com/thesis/2019/156409.html", "time": ["2019-02-23"], "info": "　　中图分类号：TP393 文献标识码：A 文章编号：1009-3044（2016）25-0100-03　　随着计算机网络技术快速发展，计算机已经成为现今人们办公生活必不可少的工具。为了提高学生社会适应能力，培养更加符合社会职业需求的高职业素质人才。然而将计算机网络技术全面普及到各高校基础教学中去是不可能的，受限于课时及教学资源等各类因素，其他非计算机专业学生往往只能学习基础的计算网络知识，而基础的计算机网络知识已经不能满足学生未来职业岗位需求。因此计算机网络课程教学的改革刻不容缓，教师在有限的课时内应当将教学重点放在实践性、创新性与职业性。项目式实验教学突破传统的填鸭式计算机网络教学，让学生带着项目任务主动学习计算机技术，项目任务设计与学生职业技术需求密切相关，加强了计算机网络教学的实践性与职业性。　　1 项目式实验教学在计算机网络课程中的应用目的　　计算机网络课程是将信息技术与计算机技术相结合的一门重要的基础技能课程，需要大量的实践操作来保证学生对计算机网络技术的熟练掌握情况。通过计算机网络课程的一系列的系统理论教学与实践操作训练，提高学生对计算机网络知识的理解，加强理论知识与实践操作的联系，进而达到解决计算机网络实际问题的目的。传统的计算机网络课程教学方法在培养学生实际操作能力时存在诸多缺陷。不同学生对计算机网络知识的知识基础不同，有些同学对计算机及其操作知识了解较多，相对这类同学计算机课程难度较小，浪费学生的学习时间，同时使学生对计算机网络课程的学习兴趣降低。而一些同学对计算机网络知识了解甚少，往往不能一下子跟上教师的讲课进度，导致这类学生对计算机网络课程的学习产生畏惧，降低了学生计算机网络技术学习的信心。另外，传统的计算机网络课程教学模式虽然将理论知识与技术实践分开教学，但是仍然不能够将两板块独立教学作用发挥出来，且往往在实践教学中不能够将两板块知识灵活融合，导致学生对计算机网络课程丧失学习兴趣，产生计算机网络课程无用的想法，再加上教师在教学中缺乏创新与活力，导致计算机网络课程死气沉沉，大大降低其教学效率。项目式教学法是让学生将计算机网络技术学习与项目任务相结合的一种教学方法，其是指将教师的教学过程与学生的学习过程相结合，以完成一个或多个项目任务为教学载体，通过设立目标、克服困难、完成目标的方式来达到教学目的。教师在教学中更多地是充当指导角色，改变以往被动教学模式，让学生能够注重参与到计算机网络教学中，进而全面提高学生的综合能力，达到学以致用的目的。　　面对日新月异的计算机网络技术，网络课程实验教学环节必须不断的调整与更新。项目式教学法的提出无疑为计算机网络教学带来了新的契机，改变传统计算机教学中以教师为主体的填鸭式教学，弥补了传统教学实践上的不足。项目式教学使得计算机网络课程的实用性更强，在整个教学过程中不仅能够更加熟练地掌握计算机实践技术，还能够对计算机网络项目制作过程有一个大致了解，增强学生的学习兴趣与热情。项目式教学是一种任务强迫式教学，能够激发学生的学习潜力，使学生能够将已学的理论知识与任务所需技术结合在一起。项目式教学教学成果能够在短时期内显现出来，便于教师及时改正实践教学中存在的不足，并积累教学经验，为今后的计算机网络教学提供参考资料，进而促进计算机网络课程的进一步改革与发展。项目式教学法应用在计算机网络教学中还能够促使学生形成合作共赢意识，提高学生的合作能力，同时还能够让学生在项目合作过程中发现自身的不足并自主地弥补不足、丰富自己，有意识地提高自己的计算机技术实践能力，进而完成学习目标。　　2 计算机网络课程中项目式实验教学的必然性　　随着现代计算机网络技术的飞速发展，社会对人才计算机网络技术的要求也越来越高，尤其是在实践上的技术应用能力，对此传统的计算机网络教学已经不能够满足社会对人才计算机技术的需求，有碍于人才未来职业发展，因此计算机网络教学必须改革创新，更加侧重其在技术实践上的教学应用，提高学生的综合实践能力。项目式实验教学本身就是将计算机网络课程与学生专业对应职业相结合，以学生未来职业岗位技术项目作为教学载体，进而带着较强实践性与职业有利性来进行的计算机网络技术教学，将计算机理论知识切实地与实践技术相结合，教师引导学生去提前适应未来职业岗位所遇到的计算机网络技术难题，由此学生对所学知识印象也更为深刻、更为扎实，该方法培养出的职业人才也更加能够胜任职业岗位所需。另外，现今计算机网络课程不只是计算机专业人才需要掌握的一门必须课程，也是其他专业人才所需的基础课程。计算机网络技术在社会发展过程中也坚定了其越来越重要的技术地位，这也让项目式实验教学的计算机网络课程在教学实践过程中获得了更好地顺应性。学生们在学习过程中渴望自己的职业必须技术能够得到提高，具备职业竞争优势，因此将计算机网络技术与项目相结合更加易于学生接受所学知识，使学生更加配合教师授课，同时尽早地让学生形成职业计算机技术思想，能够全方位、多角度地思考在项目中所遇难题，发挥个人创新思想，加强团队的协作，达成项目目标。　　3 计算机网络课程项目式实验教学的教学模式　　计算机网络课程的根本教学目的是使学生了解并掌握计算机网络技术的理论知识，能够将理论知识灵活运用到实践操作中，能够满足职业需求的计算机技术。计算机网络课程的教学难点就在于如何能够让学生将计算机网络技术的理论知识灵活运用到实践操作。项目式实验教学需要学生拥有一定的理论知识，因此教师也不可以忽略理论知识的教学，同时需要提高学生科学文化相关知识技能，为学生的计算机网络教学打下基础知识基础。在形成项目式实验教学模式时首先要明确计算机网络课程项目式实验教学的教学方向以及大体思路，再结合不同专业学生未来职业岗位对计算机技术的需求，制定好教学大体目标，再整理明确课程结构，设计安排计算机网络教学的每一个环节，进而形成以理论为基础，以项目式实践为教学主体的系统教学模式。另外，对于多重点的知识章节，可以设立多个重点知识项目任务，对应不同知识点在小组内成立子任务，达到多项目高效率的计算机网络课程教学模式。为使计算机网络课程项目式实验教学更加系统科学，可将课程内容设计与系统工程知识结合，从设计、分配、实践、评估等方面来综合考虑教学模式的形成与改进，进而逐渐完善计算机网络课程教学的教学系统，使计算机网络教学跟上社会时代的发展、满足学生职业需求，进而达到计算机网络课程的教学目标。   　　4 计算机网络课程项目式实验教学的实践分析　　4.1 课程的内容与环节设计　　为了增强计算机网络课程的实用性，使计算机网络课程内容与学生未来职业联系更加紧密，对计算机网络课程内容的设计上需要参考不同专业学生的职业特性，设计适合不同专业学生的理论课侧重点与实践项目。由于专业多样，教师不可能为各个不同专业学生设计各不相同的课程内容，因此教师可将不同专业大致分类，将职业性质相似归为一类，这样能够大大减少课程设计上花费的人力物力，同时也能达到因材施教的效果。另外，需要项目式实验教学是教学重点，因此教师要注重项目的选取设计以及教学情景的设计于模拟，根据知识重点多提项目，多举案例，进而形成多项目多模块的综合计算机网络课程。　　进行计算机网络课程内容设计首先要确定教学目标，即教会学生对计算机的基础操作及各个基础软件的功能使用，重点培养与学生未来职业需求相关的计算机操作技能。通过对学生计算机基本技能的教学，使学生能够在未来的职业岗位上使用计算机工作交流的能力，提高学生计算机操作职业素质。明确教学目标后根据目标明确计算机网络课程的教学大纲，确定课程结构，增强课时间关联性，进而保障教学目标。根据教学大纲确定教学模块，根据教学模块的特点设计教学项目。教师可以根据设计的教学项目制作教学程序，便于学生进一步操作学习，对学生项目完成起到指导作用。教学程序可包括项目目标、需要掌握的知识点以及项目完成步骤、重点内容的操作指导以及学习参考资源、课后练习项目以及项目评分要求。总之，课程内容与环节的设计是需要结合学生未来职业实际需求的，以项目实践的方式对理论知识进行再次的熟悉深化并灵活运用于实际操作，进而实现教学目的。　　4.2 教学内容的选取　　教学内容的选取一定要重视知识的实用性与难易性。不同专业学生未来职业对学生计算机网络知识掌握侧重点不同，教学内容的选取必须遵循实用、适用且符合时代发展。教材建设是教学内容的主要体现部分，教材能够计算机网络课程的理论知识与实践项目相统一便于学生课上快速掌握完成项目任务、课后复习练习。另外，由于现今办公离不开计算机与各种办公设备，在课程内容的选取上，可增加一部分与时俱进的计算机专业知识（如电子商务技术等）以及一些电脑相关机器的使用、安装与维修（如打印机、扫描机等），使计算机网络课程内容能够紧跟社会发展，提高学生的职业素质。另外，教材内容的安排应遵循由易到难的原则，每个章节知识的项目要设计多个，按照前后顺序由易到难排版，便于教师与学生在课堂上选择，使各个章节的项目训练丰富、选择性高。　　4.3 教学方式与评价方式的设计　　在实际的计算机网络课程中可以增添教学方式，丰富课程，进而增强学生的学习热情，加深学生对各类知识的印象。通过实践发现，计算机网络课程的理论与实践课分开授课能够让学生明确学习任务，能够明确项目的实践方法与目标，但理论与实践课绝对不是独立的，是对彼此的补充，知识的相互渗透。如金融财会等专业学生需要熟练掌握Word、Excel等基础软件的使用；而一些特殊专业的学生还要根据其未来职业需求培养其他计算机网络技术，如广电专业学生还要掌握动画制作、DV制作等。根据学生专业的不同在传授学生通用的计算机网络技术的同时还要有所侧重地对学生专业计算机技术进行提高培训。项目式实验教学是要求学生带着任务主动学习知识，加强对理论知识的理解，提高计算机网络知识的实践应用技术。在教学中，教师应以项目实训为教学主体，将理论知识的重点再次在项目实训中强调，加深学生印象，同时也增强了学生对理论知识的掌握情况，为今后更加高难度的项目完成打下基础。另外，在计算机网络课程的理论课和实践课上加入多媒体演示，能够提高学生的学习兴趣，同时也能更加直观地向学生展示操作技巧，同时也能够启发学生在自己小组项目完成中创新操作。为了方便教学，教师应当建立本校的教学课程外站，提供平台将学生课堂上所需要掌握的知识点以及项目要求指南等整理成不同小节，学生可以再平台上直接完成项目任务并提交，提高教学效率，为学生创造良好的操作平台与学习环境。另外，加大学生平时成绩的比重能够提高学生项目参与度与完成度，提高学科的学习效率。对于学生平时成绩的设计应调高学生上机项目完成情况所占成绩，对此项目任务完成快、质量高的学生额外加分能够提高学生实践学习的积极性。　　5 结语　　传统的教学方法只注重知识的传授，不能提高学生的实践动手能力和解决实际问题的能力，培养的学生职业能力欠缺直接影响就业。 项目式实验教学的开展大大提高了计算机网络课程的教学效率，同时也为社会培养了大批具有更高计算机职业素质的人才。在项目式实验教学的开展中，教师除了要注意课程内容及环节的设计、教学内容、教学方式与评价方式的设计之外，其对教师自身素质也提出了更高的要求。教师需要根据学生专业以及学生自身情况的特点设计教学方案，使课程更加系统科学，选择合适的项目，达到因材施教的目的。项目式实验教学的开展加深学生对理论知识的认识，加强学生对所学知识的实际应用以及合作完成任务的能力，提高学生职业素质。教师在项目式实验教学的开展过程中需注重对项目教学的效果进行评价分析，反省不足，改进教学方案，进而完善项目式实验教学在计算机网络课程中的应用。"}
