{"title": "在职工程硕士高级计算机网络教学组织与建设", "url": "https://www.lunwendata.com/thesis/2019/154317.html", "time": ["2019-02-01"], "info": "　　文章编号：1672-5913（2017）05-0121-04　　中图分类号：G642　　1 背 景　　随着计算机技术和计算机网络技术的发展，使得信息快速传播。“互联网+”是创新2.0下的互联网发展的新业态，是知识社会创新2.0推动下的互联网形态演进及其催生的经济社会发展新形态。“互联网+”是互联网思维的进一步实践成果，推动经济形态不断地发生演变，从而激发社会经济实体的生命力，为改革、创新、发展提供广阔的网络平台[1]，而这种“互联网+”的思想应用于教育教学上，则可以具体对应上MOOC[2]（Massive Open Online Course，慕课）和SPOC[3]（Small Private Online Course，小规模限制性在线课程）。在教学教法上，将具体网络应用和网络资源结合起来充分利用，可以提升教学效率和效果，目前也有一些基于MOOC和SPOC的教学教法研究[4]。　　而研究生教学，特别是在职研究生教学，则更适合应用这种“互联网+”的教育教学模式。通过“互联网+”的方式完善专业学位研究生教学模式，让学生完成学校的教育之后能够在实际工作和科研工作中快速上手，对培养学生动手能力和理?结合实践能力有着巨大的意义。通过理论学习和实际环境的操作，还可以激发学生的科研创新能力，进一步提升研究生培养质量。　　2 “互联网+”模式下的课程组织模式　　对于研究生课程设置来说，有不少基础课程都和本科生本专业的课程内容有重合。以大连理工大学软件学院的工程硕士课程为例，“高级计算机网络”“高级数据库”“高级软件工程”“算法导论”“高级操作系统”就同本科生软件工程专业的“计算机网络”“数据库系统”“软件工程”“数据结构与算法”“操作系统”在内容上有重合。有些基础内容是本科阶段已经讲授过的，导致学生会觉得奇怪，研究生的课程和本科生课程到底有什么区别，这些课程和本科一样？以“高级计算机网络”为例，在脱产的双证研究生班上课时，就有学生在问“高级计算机网络高级在哪里”。在这种情况下就需要教师合理组织课程内容，既要抓住课程的核心知识点，又要从更深层次的角度进行导引。　　2.1 脱产硕士生的课程组织研究　　网络课程中的主体内容是重复的，特别是网络中的一些基础概念和协议，在各个网络课程中都要讲到，且有大量的重复性教学。重复的教学不能得到较好的学习效果。就如同之前我们曾提到过的[5]，研究生的“高级计算机网络”教学可以考虑从技术发展的主线来整理。例如应用层各个协议的发展，HTTP协议从non-persistant HTTP到persistant HTTP，从只支持单对象到支持多个对象；从FTP的PORT传输模式到PASS模式的改变，Email客户端从POP3协议的普及使用到IMAP4协议的普及使用。应用层每一个技术的发展都是从具体应用需求提出的，启发学生思考Killer Application促进技术发展的重要性。　　对于其他偏向于协议改进的层次，如传输层来讲，除了TCP和UDP的基本理论，还可以介绍TCPng-SCTP[6]、TCP拥塞控制的具体各种改进协议，针对UDP协议的拥塞控制协议DCCP[7]等。对网络层则从IP地址不足的角度介绍分类别IP地址、VLSM、CIDR、NAT、IPv5、IPv6、IPv7等，当然对于下一代的IP协议还是以IPv6协议作为重点介绍，说明IPv6同IPv4相比增加或减少的功能及原因；数据链路层则可以从CSMA系列展开，如CSMA/CD、CSMA/CA、CSMA/CN[8]、CSMA/CP[9]等。　　以上的内容都需要学生利用课下时间通过Internet找相关的文章和素材，提前准备，方便课上介绍和讨论等。至于其他的网络新技术，如无线网络、网络安全、网络管理、光网、量子通信网络等，则更是需要利用Internet查阅相应的材料。探索网络课程体系中网络资源的系统化、网络教学模式，利用网络资源进行教学模式的创新，完善网络课程组织方案。　　但是这些组织方法只适合于本专业、本科学过“计算机网络”及相关计算机科学技术系课程的研究生，对于在职的工程硕士，则无法直接从系列技术的分析和技术的延展进行组织，需要其他的组织方案。　　2.2 在职工程硕士的课程组织研究　　在职工程硕士来自于不同的专业，不同的班级又是不同的情况。以笔者今年上半年上的3门在职工程硕士的高级计算机网络为例，大连半脱产2016级，56人，每周二、四、五上课，每周7学时，上3周半；大连在职2016级班，50人，每周六晚上上课，每次4学时，上8周；营口在职2016级（AS）班，74人，周四至周日上课，每天4―12学时，4天上课。3个班不同的人数，不同的上课强度，不同的基础。其中，大连半脱产2016级的学生虽然不是全日制学生，但是上课的时间集中，同全国统考的硕士生上课形式类似，且周末也会集中上课，2年的研究生课程会在一年以内完成，所以本文还是把这类班级归到在职工程硕士一类。　　基本每个班有一半或一半以上的学生曾经是其他专业的，包括英语、化学、材料、会计等，质量参差不齐，没有办法以上一小节的内容组织教学内容，需要新的教学方法。　　除了让学生课后找相关资料外，在这种类型的班级里笔者采用了问题驱动的方法，在3个班级里都获得了一定的效果。　　（1）举一个曾经用过的“计算机网络”试卷，提前通过网站、QQ群、微信圈子等方法分发给学生。要求每位学生在课上回答一个问题，以完成课程参与度的分数（一般为20%），在学生回答题目的基础上做知识点的展开。让学生自己或通过班级QQ群、微信圈子里找其他人询问、讨论，是一种自学或学生互相之间讨论的方式。特别是学生互相之间讨论的方式，可以激发学生以P2P的方式询问和解答问题，解决教师作为“服务器”的瓶颈问题，加快讨论速度和效果。   　　（2）以课件的outline页为引导，鼓励学生自己论述某个技术，在某位学生说过后，再进行必要的补充，由学生选择所在某一层次的技术讲解的先后顺序。这种对某个技术的论述，也可以作为参与度分数的评判标准。　　（3）在主体内容完成后，提出问题让大家讨论，给有基础的学生更高的讨论。当然讨论的问题也可以用于脱产的研究生课程上，这种问题除了细节外，还会多一些分析或思考。　　① UDP头、IPv4头、IPv6头中都有total length或payload length字段，但是在 TCP头中为什么没有相应表示segment长度的相应length字段？　　② UDP头、IPv4头、TCP头中都有Internet Checksum字段， 但为什么IPv6没有校验和字段？　　③ 在常见的头中，都是源地址在前、目的地址在后，如TCP头和UDP头中都是源Port在前，目的Port在后；IPv4头和IPv6头中都是源IP地址在前，谜底IP地址在后；但在Ethernet帧或802.3帧结构中却是目标MAC地址在前，源MAC地址在后。　　④ token ring的效率理论上要比CSMA/CD高得多，为什么没有使用token ring？为什么WLAN中的MAC地址会多于两个？　　其他的一些常见的讨论，如为何IP地址和MAC地址可以共存，CSMA/CD为什么不能在无线网络中使用，TCP在有线网络中的拥塞控制方法为什么在无线网络中不适用等。　　在本次3门在职工程硕士的“高级计算机网络”课程中，通过这些方法的使用，明显感觉学生的参与度要好，课上及课间的参与度大大提高，特别是在课下与教师的交流和探讨问题的频率和次数要大大增多。还有学生因为出差错过了一次课程，在考试结束后，还专门约时间单独补上错过的课程内容。　　整体来说，这种组织方法提升了在职研究生培养质量，利用Internet环境和资源，进行科研与教学相融合的人才培养模式研究与资源实践的探索，为以后进一步优化教学组织方法、培养研究生教学模式提供参考。　　2.3 实验课程材料的组织　　理论和实践结合，一方面要求对于实际问题能够进行整体把握、进行系统分析，另一方面要求学生对于实际问题能够通过实验建立相关的概念模型、数学模型或解决方案等，以准确描述具体的实际问题。课堂教学与实验教学是分离的，课堂教学处于主导地位，实验处于辅助地位。课堂教学具有非常鲜明的灌输特点，不太强调学习者的内在条件，学生只是接受者的角色，长期下去，学生很难学会学习。理想的学习方法应强调学习者的主导作用，在计算机教育实践中，要求将课堂教学与实验教学合二为一，互为补充。强调教师的责任是为学生提供丰富的学习环境，其显著特征是基于问题的学习和训练学生的批判思维，利用各种工具辅助教学，这些工具将和各个抽象层次的可视化支持结合起来。在实际教学过程中，给定一个编程任务，提供学习环境和背景知识；将课堂教学和实验有机地结合起来，要求教师把主要的精力放在学习环境的构建上，将学习的主动权还给学生。特别是对于在职工程硕士来说，很少有机会做配套的实验，只能从原理和步骤及他人视频上做一些了解，这就需要学生通过Internet使用优质的教育资源，不再单纯地依赖授课老师去学习知识。研究生在宿舍或者课余时间就能完成知识的学习，课堂变成了老师与研究生之间和研究生与研究生之间互动的场所，包括答疑解惑、知识运用等，从而达到更好的教育效果。进行实验的远程模拟部署和录像演示并可以远程访问，以此让对课程感兴趣的研究生随时随地进行远程学习。　　3 分类教学网站的设计和实现　　对于教学网站的设计，课件分享和组卷、自动评分系统都已有一些研究，比如在林桂亚等[10]的工作中，根据学生频繁使用手机这一趋势，结合教学环境和教学改革情况，建立了基于WAP的课程教学网站。吴巧玲等[11]研究了主观题自动评分系统的实现，系统采用自然语言理解，并依据CNKI的“知识库”来作为自动评分的依据，实现了分类教学网站的设计。　　网站的基本功能如图1所示。网站的访问者分为两种，一种是游客，另一种是注册用户。游客与注册用户共有的功能是搜索与观看视频，注册用户有修改个人信息、评论以及查看评论等功能。网站的维护者是管理员，管理员负责推荐信息管理、视频管理、评论管理以及账户管理等。网站的核心功能在于视频管理和评论管理，学生可以作为访问者观看网站视频，并可以用提交评论的方式与其他网站访问者交流或分享学习心得。网站用JSP和MySQL数据库等相关技术进行了实现，目前已经在教育网内部进行了使用。　　4 教学效果和总结　　以考试成绩为统计的教学效果见表1，其中2016级3个班是使用了在线视频网站的，而之前2个2015级的班级并没有使用该系统。特别要说明的是，2016级大连半脱产和16级大连在职的两个班的开卷形式是“一本书开卷”，即学生只能带纸版的参考材料；而2015级的三个班及2016级营口在职班的考试形式是“全网开卷”，即学生可以用电子版和纸版的参考材料。　　从成绩上可以看出，2016级大连半脱产和2016级大连在职在实行改进教学方法后平均分都有了很明显的提高，同时80分以上优秀的学生比例也提高了。即使他们面?Φ牟慰甲柿现皇侵街实牟牧希?没有电子材料的快速查找功能，他们的成绩相对来说也与之前的对应班级有比较大的提升。而与此相比，营口2016级的成绩则变化不大，由于2016级营口班级上课时间比较短，上课期间也没有办法严格要求学生在线学习，同时留给学生网上学习的时间也比较少，造成只有少数学生认真使用了学习系统，所以在总体成绩与往年没有大的提高。但从2016级2个大连班的情况看，成绩比2015级的3个班级，特别是比2015级的大连脱产和在职班的成绩有提高很多。统计结果说明，经过改进的教学方法确实提高了学生的学习热情和效率。   　　随着互联网技术的快速发展，“互联网+”等技术活跃地应用在教育教学方面，并体现出良好的效果。笔者将“互联网+”教育教学模式应用于在职研究生教学中，提出了3种不同的在职工程硕士的课程组织模式，具体分析了每一种组织模式下“互联网+”教学模式的具体实现方式。最后提出了一种分类教学网站设计和实现的方案，给定了网站设计的目标和网站的基本功能，并实现了诸如视频管理、评论管理、用户个人信息管理等大部分核心功能，并在教育网内部进行使用和测试，获得学生的广泛认可，加强师生之间的互动，提高学生的学习热情，收到良好的效果。下一步工作是继续完善分类教学网站更多的功能，并在互联网上推广使用。同时，我们也需要注意到，仅仅是新技术的使用并不能提高教学效果和学生成绩，课程时间持续跨度、留给学生消化理解的时间也是一个很重要的因素，如何平衡在职工程硕士的上课时间和学生本职工作时间，也是一个需要解决的问题。"}
