{"title": "和谐师生关系在高职计算机基础信息化有效教学中的作用探析", "url": "https://www.lunwendata.com/thesis/2019/154720.html", "time": ["2019-02-05"], "info": "　　0 概述　　“和谐”是亘古不变的主题，人们对“和谐”的追求从未间断。理所当然，和谐也存在于师生之间。师生关系作为校园内存在的最基本也是最主要的关系，决定了教师与学生之间必然存在着的管理关系等，从长远看，其实质是一种促进与发展的关系。高职计算机基础信息化教学加深了师生之间的交流与联系，借助于信息化教学手段，促进了计算机基础教学效益最大化。　　（1）和谐师生关系的判断　　本文从以下两方面判断师生关系在高职计算机基础信息化有效教学研究领域的应用。　　第一，从教育事实上判断和谐师生关系。所谓和谐师生关系，它指的是师生作为一个整体，教学过程中的文化氛围和谐，教师地位、教育作用、接受信息和创新思维等活动协调进行，且如果师生关系出现问题，将会有符合客观规律的协调机制进行制约。　　第二，从实现价值上判断和谐师生关系。现代高职计算机基础教学，我们强调的是有效教学，师生关系是否和谐，主要看两个方面：一方面是抽象层面，考察师生之间、师生与外界之间的协调情况；另一方面是状态展示，表现出来的教学结果是否积极。　　（2）高职计算机基础信息化有效教学的涵义、特征和现状　　有效的教学活动实质是指教师和学生能够遵循客观教学规律，促进学生的知识和技能、学习过程和方法、学习态度和价值观等协调可持续的发展，高效地实现预期的教学目标，满足社会和个人的教育需求[1]。借助信息化教学手段，计算机应用基础课程实现了教师与学生的线上线下互动。改变传统的教学观念，充分运用微课，云课堂等。现在的学生人人使用智能手机，学习和交流方便快捷。信息化背景下，对教师也提出了高要求，适时调整教学策略和方法，因材施教，促进学生的实践能力和创新能力得到全面的发展。　　1 高职计算机基础信息化有效教学的影响因素　　1.1 师生关系　　作为计算机应用基础信息化课堂教学的主体，教师和学生在高职院校的计算机基础信息化教学中分别承担着自身不可替代的角色。教师的教学理念、责任心、教学设计和策略等都会直接或间接影响师生关系；学生对该课程的学习兴趣以及预习效果也会影响师生关系，这些都直接影响了高职计算机基础教学的有效性。因此，从这个角度上来说，师生关系成为了计算机基础信息化有效教学的关键因素。　　1.2 环境因素　　因为学习本身是社会性的，也就是说，学习活动总是在特定的社会环境中进行的。计算机基础课程一般在实训机房授课，虽然学生的学习过程是最主要的行为，但学习效果并不完全依赖于主体，机房安装各种应用软件，学生的学习受到其周围同学的学习态度、学习环境和教师对课堂管理程度等的影响。因此，教师与学生之间的和谐关系成为影响高职院校计算机基础信息化教学的一种社会环境因素。　　1.3 个体因素　　除了以上提到的两个因素外，信息化有效教学的因素还包括师生的心态、具体知识点对学生的吸引程度等因素。因此，有效教学要克服外在的影响力，对参与课堂教学的主体提出了更高的要求，师生加强交流，对于计算机的基础理论知识采取现代信息化教学手段授课，避免枯燥乏味，从而提高高职计算机基础课堂教学效率[2]。　　2 和谐师生关系对信息化有效教学的意义　　2.1 有利于高职计算机基础信息化教学目标的实现　　首先，高职计算机基础教学目标规定这是一门集知识、技能和实践于一体的课程。通过课程学习培养同学使用计算机的能力，培养同学自主学习的能力，帮助他们建立团队合作的意识；使学生掌握计算机的基础知识，形成全面的计算机应用能力；培养学生的创新精神，在各专业领域应用好计算机，为他们的终身学习和发展奠定良好的基础，与此同时，计算机基础课程作为一种工具，可以为各专业的信息化应用提供必要的支撑。　　2.2 有利于师生平等对话的发展　　教师与学生之间的和谐关系，可以促进师生平等对话，共同成长，正所谓教学相长。能够更好地促进高职计算机基础信息化教学的发展。信息化课堂良好的氛围是建立在和谐师生关系基础上的和谐课堂氛围。每个人都有被理解和尊重、支持和被认可的需要。师生之间的这些需求主要来自于对方，而和谐的师生关系正好满足了师生需要。因此，在和谐的师生关系中，教师和学生互相尊重和理解，教?W过程顺其自然地变成了良性循环，促进双方心理健康。　　教师与学生之间的和谐关系有利于教师热爱工作，提高工作效率。除了教师本身，高职院校计算机基础教师的专业态度和工作效率，更受其所教学生的影响。教师的教学效果主要由学生的学习效果体现，因此学生的学习状态直接影响着教师的成就感。在高职院校计算机基础信息化教学中，教师与学生之间的和谐关系可以让学生感受到平等与关爱，从而放下思想包袱和心理压力，将真实的想法告诉给老师。　　2.3 有利于提高学生学习效率，促进学生全面发展　　教师与学生的关系是否和谐直接影响到学生的学习效率。学生在不和谐的师生关系课堂氛围中，普遍感到紧张，甚至会反感，课堂上睡觉，玩手机等现象频繁。而在和谐的师生关系氛围中，学生会感到轻松愉快，思想活跃，考虑问题往往充满灵感。出于对任课老师的尊重，学生往往也会克服不专心的想法，主动接受知识，提高课堂学习效率。因此，在高职计算机基础信息化教学中，我们要全面关注学生的思想，创造满足学生基本学习和认知需求的学习氛围。当他们切身体会到自己的能力被老师认可，他们会积极乐观地面对学习过程中遇到的各种问题，面对问题的态度改善了，获得成功的几率就大了。   　　3 构建和谐师生关系促进高职计算机基础信息化有效教学　　3.1 构建和谐师生关系的思考　　3.1.1 坚持以人为本的原则，因材施教　　新的时代背景下，计算机基础课程教学的基本出发点是针对学生的特点，促进学生的全面发展，这也是高职教育最重要的理念。坚持“以人为本”的理念，我们可以分析每届学生的特点，过去接触计算机的多少，地区差异，年龄特点等，充分发挥学生的潜能，全面提高学生的素质，使学生的自我价值最大化。　　3.1.2 坚持关爱与民主的原则　　关爱与民主是密不可分的，在高职院校的计算机基础教学活动中，教师要关心、尊重、理解、信任和宽容学生。做到关心和民主，感染学生，教育和促进学生思想和身心全面发展。教育心理学表明，情感具有迁移功能，建立良好的师生关系， 学生喜欢教师，迁移到教师教学内容，也能提高学生对知识的偏好。从人文关怀的角度看，这样不仅增进了彼此间的相互理解和信任，更有利于和谐师生关系的形成，有利于促进高职计算机基础信息化有效教学。　　3.1.3 坚持双主体原则　　教学是师生互动的一种双边活动，是一种双向的反馈过程，教学对教师和学生都有好处。学生是学习活动的主体，其学习效果好坏不仅取决于老师的讲课，更取决于其本身的自觉程度。教师在教学过程注重学生主体地位的凸显，鼓励学生主动学习，创造思维，主宰学习。坚持“主体性原则”体现了教师对学生的尊重、理解和信任，这种民主、平等的氛围在不知不觉中就形成了。　　3.2 促进信息化有效教学的策略　　3.2.1 教师为促进有效教学做努力　　教师在提高高职院校计算机基础教学中发挥着重要作用。因此，从教师自身方面做出努力十分必要。　　（1）向学习型教师转变。新的课程改革主张教师要帮助学生建立新的学习能力，尽快建立适应学生自我学习的习惯。实现这一目标，并不容易，课程改革让我们认识到自己的缺点和学习的必要性。教师学习了，引导学生的方法必然会增加，从而提高学生的提问能力和解决问题的能力，练就学生寻找到适合自己的学习体系。　　（2）做一位创新型教师。将创新的思想转化为教育过程中的具体行为，潜移默化地影响着学生，从而培养学生的创新能力。高职院校的计算机基础课程作为个专业的公共基础课程，将成为各行业使用的工具。这就要求高等职业计算机基础课程的教师具有创造性，适应时代要求。　　（3）此外，教师应不断提高自身的教育研究能力。高职计算机基础教师应成为具有创新意识适合高职教育发展的育人专家，必须不断提高教师自身的教育研究能力。教师的科研能力应从教学研究能力出发，把提高教师的能力、教学改革的和研究探索中遇到的问题相结合，不断总结自身的教学经验，表达自己的见解。[3]　　3.2.2 引导学生改进思想　　学生既是师生关系的客体，也是课堂学习的主体。引导学生改进思想对建立和谐师生关系，实现信息化教学良好发展有着重要作用。　　（1）引导学生改变学习观念。从教育教学的总体目标看，学生不仅仅是学具体知识，更多的是学会学习的方法。这就要求学生改变传统的学习观念，全方位学习，并在学习的过程中练就合作的意识。　　（2）让学生领会学习动机。对于每个具体问题，让学生了解学完后的作用。用现实生活中的具体案例，激发学生的学习动机，引导其主动思考。通过有效的教学和指导，帮助学生解决实际问题的教学要求，完成技能型人才的培养任务，学生在此过程中会收获成就感，从而增强他们的动力和信心[4]。　　3.2.3 对教学过程提出了高要求　　在高职教育中，尝试创建每一个生动有趣的计算机基础案例教学环境。实践表明，生动而有吸引力的教学可以激发学生的积极性，达到理想的教学效果。生动有趣的课堂教学环境与教学过程中教师的灵活应变能力和教学活动有关。教师对教学内容的熟练程度和投入精力等，均对教学过程中学生的情绪有重要影响。因此，高职院校的基础计算机教师使用表达性的语言教学，用信息化的手段，可以提高教学的吸引力，吸引学生参与课堂教学，极大地提高教学的效果。　　3.2.4 完善合理的教学评价探析　　高职计算机基础信息化教学的教学评价，可以进一步提高高职院校计算机基础教学的教学质量，培养学生在民主与平等和谐的学习氛围中学习，进而提高高职计算机基础教学的教学效率。为此，我们可以从以下两个方面进行探究。　　（1）高职计算机基础信息化有效教学评价应鼓励师生共同参与，促进教学效益最大化。高职计算机基础教学的评价应该注重对学生的学习过程的评价，对学生实践能力、解决实际问题的能力等方面的评价。这种评价通常情况下需要教师在实践教学的过程中对学生考核、这有利于实现教师和学生共同参与教学评价，提高教学评价的效果和学生对于学习过程的认知[5]。　　（2）高职院校计算机基础信息化有效教学，应使学生既是教学评价的主体，也是被评价的主体。在高职院校计算机基础信息化教学的评价过程中，学生应从过去的被动评价转变为主动参与评价。要求学生评估自己的?W习态度是否端正、策略和方法是否合理、效果是否明显，并且评估其他同学对学习的态度、学习策略和方法以及他们的学习成果。做到知己知彼，从而促进有效教学。　　4 小结　　在高职计算机基础信息化教学中，我发现一系列影响高职计算机基础信息化有效教学的问题，其中课堂中的师生关系是不容忽视的问题，直接影响了高职计算机基础信息化有效教学的效果。在教学实践中我不断探索和总结反思，找到了一些原因，仍然不够全面。经过不断的教学实践，事实证明，和谐的师生关系能够很好地促进高职计算机基础信息化有效教学，取得了良好的教学效果。"}
