{"title": "以实践性为导向的计算机教学改革思考", "url": "https://www.lunwendata.com/thesis/2019/155831.html", "time": ["2019-02-17"], "info": " 　　摘要：随着现代信息社会的不断发展，计算机技术在社会生活的各个方面扮演着越来越重要的角色，对于计算机信息技术人才培养的重要性也就越来越突出。要切实促进我国信息技术的发展，必须着力培养具有较强实践能力的新型人才，在教学活动中就必须更加突出实践环节，真正增强学生的专业化技能。　　关键词：计算机技术；教学改革；人才培养；实践性　　中图分类号：TP3-4 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-02　　一、当前计算机教学工作中存在的问题　　在目前的信息社会高速发展的背景下，对于计算机的熟练操作能力已经成为高素质人才的一项必备特征，也几乎成为现代人类生存的一项基本技能。所以，对于计算机操作能力的培养必须得到重视。虽然近年来，我国计算机教学工作已经取得了相当卓著的成效，教学成果也是有目共睹的，但在当前的计算机教学工作中却仍存在着一些这样那样的问题，不利于实践型计算机人才的培养。　　（一）对于计算机教育的认识程度不够　　在计算机技术不断深入发展的同时，仍然存在着对于计算机教育认识程度的欠缺问题，导致教育管理环节的疏忽和软弱，对于新型计算机人才的培养仍是一个大大的隐患。我国长期以来受到应试教育理念的影响，一时之间难以真正拜托其束缚，很多老师和学生对于计算机教育的认识仍有欠缺，并没有把计算机技术作为一项基础的教学科目来对待，重视程度明显不够，这就直接导致了某些学校计算机基础知识的普及工作不到位，相关的规章制度也松懈散漫，不能对计算机教学工作提供切实可循的依据。甚至有些学校将计算机技术当作一门可有可无的课程，应有的课时得不到满足，教学质量也就不可能提高。　　另外，大多数学生对于计算机课程的重视程度也还远远不够，甚至有学生觉得计算机课就等于简单地打字、玩游戏，潜意识里没有把它当作掌握知识和获取技能的途径，而是其他文化课程紧张学习之余的放松，在这样的思想下学习计算机技术，教学工作当然不会受到好的成效。　　（二）教学模式生硬僵化　　很多教师的专业技能并未达到规定标准便已上岗教学，未经过规范的职业技能培训，所掌握的知识以及能力都不能满足现阶段的计算机技术教学工作，而且教学手段也做不到多样化和灵活性，在教学方法和教学模式的研究与应用方面自然也就做不到得心应手，很大程度上都是在敷衍了事。另外，对于计算机课程的疏忽也就必然会出现教学投资的严重欠缺，一些学校的多媒体配套设施极其简陋，某些教学活动根本无法实施。这样一来，缺乏高素质的强大的师资队伍，计算机教学工作的效果也就变得难以达到应有的程度。　　同时，教学模式存在很大的问题。在我国的教育教学工作中，计算机技术同其它普通的文化学科一样，存在着教学体制的僵化问题，大多采取“满堂灌”式的授课模式，大多数时间是老师在进行教学，而学生的参与程度相当低，可计算机技术又有着不同于其它课程的特点，它集知识性、技术性、实践性于一身，其中对于实践性的要求尤为突出，而在这样的模式下，学生不可能得到实际的锻炼。　　二、实践性为导向的计算机教学模式的提出　　在信息社会的大背景下，计算机技术的重要性在我们的工作和生活的各个方面都随时可以得到彰显，我们已经很难与网络和计算机技术相脱离，计算机操作能力已经成为衡量一个人的素质高低的一项重要指标。而我国当前的计算机教学工作中，大多数时候都以理论知识的传授作为教学内容的主要方面，忽略了本该作为核心的实际操作能力的培养，导致很多毕业生在走上工作岗位之后，却对于专业技能的应用感到茫然无措，进而企业就需要对他们进行额外的上岗之前的职业技能培训，这就使得工作成本进一步提高，对于高校毕业生的就业也会造成一定的影响。某些时候一些学生也会因培训方面的额外支出而放弃自己所学专业，这样，就是对于前期投入的教学资源的一种极大的浪费，不管从哪个方面来说，这样的结果都对经济社会的可持续发展有着不容忽视的不良影响。　　相应地，从学生毕业之后的各个环节所反映出来的问题，就产生了对于教育工作的极大质疑，那么，为了解决当前计算机技术教学工作中存在的各种矛盾，培养一批具有切实的操作能力的新型计算机人才，“以实践性为导向的计算机教学改革战略”也就应运而生了。　　三、如何培养实用型的计算机技术人才　　在综合分析过当前的计算机技术的发展现状，以及教育教学工作中存在的一系列问题之后，我们可以从以下几个方面入手，全力解决各种矛盾，培养出一批能够熟练操作和运用计算机硬件、软件的实用型高素质人才。　　（一）强化对计算机技术重要性的普及宣传工作　　国家及政府有关部门可以在计算机技术的教育教学工作上施加一定的压力，使其充分认识到计算机技术的重要意义，同时要尽快建立和完善相关的规范，使得计算机教学方面的工作有理可循，这是一个很重要的前提。　　另外，各大高校在开设计算机技术课程之前，要对该项课程的重要性作必要的普及宣传工作，使学生树立正确的学习理念。计算机信心技术不管是在日常办公还是在企业的运营管理方面都发挥着不可替代的重要作用，这些都与学生未来的工作领域息息相关，要让学生充分意识到这一点。　　（二）强化师资队伍建设，改善教学模式　　可以在计算机技术方面深入挖掘新的专业，不断完善基础教学的内容。当前计算机技术的发展已经渗透到各行各业，例如，广告设计、电子商务，这些领域都可以成为引发学生兴趣的很好的专业。　　教师作为教学工作中的一个重要角色，其专业素质有着非常重大的影响。鉴于目前计算机教学领域教师素质普遍不高的现象，可以进行分批次的、有规模的专业技能培训，增强教师本身的计算机网络操作能力，这样才能使其在教育教学工作中发挥应有的作用。　　同其它各种课程一样，计算机的教学工作也要花大力气摆脱旧的教学模式的束缚，创造活跃的课堂气氛，增强学生的参与程度，激发其学习兴趣。在授课模式的革新方面，就要求教师这一群体的共同努力，找到一条切实可行的素质教学之路。   　　另外，校方要加大对于计算机课程的经费投入，完善教学工作中必不可少的多媒体配套设备，大力提升实践教学的软硬件环境，为教师的授课和学生的学校创造尽可能优越的条件，提高教学工作的质量。　　（三）激发学生兴趣，培养动手能力　　计算机技术作为一个更显换代速度极快的领域，掌握其运作的原理知识固然重要，可是实际操作能力却是最后的落脚点，一切基础知识的学习都是为最终的运用能力来铺垫和服务的。因此，在教学工作中，应十分重视学生自身操作技能的培养，可以采用一定程度的激励机制来培养学生的主动性和创造性。例如，教师可适当地分配给学生一些课后任务，如软件程序的设计与开发方面，在各个学生之间形成适当程度的竞争机制，提高其主动探究的兴趣。　　在课堂上，教师应积极地与学生进行互动，培养学生自觉参与课堂教学活动的习惯，学生之间的小组协作也是一个很好的教学体验，可以培养其团结合作的精神。另外，也可以通过上机实践与外出实习相互结合来提高学生在实际网络平台上的应用能力和实际操作水平。而理论课时间，便是解答学生在实际操作中遇到的各种难题的很好的机会。将理论和实训教学有效地统筹结合，同时突出实际操作能力的培养，这样的教学模式一定会产生事半功倍的成效。　　（四）加强计算机教学领域的信息流通　　要培养新型的实用型人才，在教学工作中就必不可少地要运用多种教学案例的分析，来传达给学生符合实际的专业知识。例如在学习网络内容时，教师就可以利用某个公司的网络管理案例进行教学，一步一步地传授给学生。那么这就要求教学工作者要时刻掌握计算机技术领域的最新发展动态，以便及时地对当前技术发展现状作出正确的反应，和对未来技术发展方向作出一定的预测。　　学校也应该加强与某些企业的合作，实现订单式人才培养，这样，不仅可以解决了学生将来的就业问题，也能够在平时的教学工作中更加有针对性，对于教育教学资源的节约与合理利用有着非常大的益处。　　四、结束语　　综合以上的分析，计算机技术的教学工作当前还存在着很多问题，而要切实促进我国计算机软硬件技术的健康发展，解决这些问题和矛盾便是首要工作。现代社会是不断进步的，计算机技术的发展更是日新月异，我们必须加大努力，改变当前教学工作与经济社会发展状况不相适应的落后局面，通过对教育基础设施的完善、教学模式的创新等方面的工作，开创符合实际的教学前景，在教育教学工作上迈出更辉煌的一步。　　参考文献：　　[1]王明福,徐人凤.高职软件专业技术课程的改革与探索[J].职教论坛,2004（3）　　[2]李海伦,唐全.“程序设计”课程教学改革的研究与实践――加强算法设计教学，提高学生编程能力[J].计算机教育,2005（2）　　[作者简介]孙向群（1971-），男，山东昌乐人，硕士，山东省农业管理干部学院计算机系讲师，主要研究方向为管理科学与工程、软件技术。赵阳（1978-），男，山东微山人，本科，山东省农业管理干部学院计算机系讲师，主要研究方向为电子商务、网络信息技术。 "}
