{"title": "学校计算机教学中培养实用型人才初探", "url": "https://www.lunwendata.com/thesis/2019/159871.html", "time": ["2019-04-02"], "info": "　　1、前言　　信息化时代的到来，计算机教学也不断成为我国各个学校的重点考试科目。但是就目前来看，我国计算机教学的考核方式以理论考试为主，忽略了学生的动手操作能力，学生缺乏实际经验，因此并不能满足社会发展需要。本文将以培养实用型人才为目标，通过对计算机教学中所存在的问题进行分析，并且针对这些问题提出相对应的解决措施。　　2、计算机教学中出现的问题　　2.1学校不重视计算机教学导致学生实践不够　　学校对计算机教学的不重视导致了计算机专业课程设置并不合理。目前我国很多学校领导对计算机教学并没有很好地予以重视，这间接导致学校老师在计算机教学期间不尽职，甚至可能让计算机课程直接变成自习课，这导致了学生在计算机课程上并不能学到任何有用的技巧。随着计算机技术的不断发展，学校对计算机教学的忽视，导致了学生不能很好地将理论和实践相联系，不利于实用型人才的培养。对于一些计算机基础比较差的同学，对计算机课程提不起兴趣，加上学校和老师的忽视，更容易导致学生的计算机技术不过关。　　2.2教材内容不合理，缺乏时代性，影响学生的创新能力　　随着网络技术的不断发展，计算机教学中已经不能完全采用原来的理论教材。旧版计算机教材理论知识偏重，忽视了实际操作的重要性。除此之外，旧版计算机教材内容缺乏时代性，导致学生除了能学习理论基础知识外，并不能了解其他技术要领，这并不利于学生对计算机专业知识的学习，从而影响了学生创新能力的发展，这并不利于学生的全面发展。因此学校需要采用最新的教材对学生进行指导，配备有专门的设备，为学生提供学习的机会，以提高学生学习的积极性和主动性。　　2.3考核方式单一，缺乏特色，影响学生的实践水平　　目前我国各个学校对计算机教学的考核方式以理论为主，实践为辅，这在一定程度上影响了学生自主学习的积极性。理论知识以识记为主，因此大部分学生通常只在考试前几天对课本内容进行记忆，并不加以理解和操作，这导致学生的计算机操作水平普遍低下，连最基本的操作也不一定能够达到熟练水平。因此学校需要创新考核方式，不能仅仅以理论知识来对学生的学习状态进行考核，更应该着重对学生的操作水平进行评价，确保每一名学生能够有最基本的计算机操作水平，能够灵活运用各种办公软件和学习软件。学校可以采取相互评测的方式对学生的学习成绩进行考核，或者自行评价，着重对其操作水平给出分数，以方便学生之间相互学习和监督。　　3、学校计算机教学中实用型人才的培养措施　　3.1提高重视程度，加强对学生计算机实践技术的培养　　学校需要加强对学生计算机实践技术的培养，确保他们能够跟随时代的发展。同时学校也应该加强对计算机教学的重视，确保理论和实践能够同步进行，督促计算机教师对学生进行良好的指导，同时对学生在课后的实践中做出相对应的规定，确保每个星期学生都应该对所学的技术进行反复操作，以达到熟练水平。这对学生的未来发展有着很重要的影响。同时老师也应该加强与学生之间的交流，这样有利于老师对学生学习状态的了解，及时根据学生的问题调整自身的教学方式，更有利于学生的学习。　　3.2提高学生的综合文化素质，培养学生的创新能力　　提高学生的综合文化素质，能够加强学生的逻辑性和推理能力，提高学生的文化修养。例如，加强对数学的学习能够帮助学生在计算机操作过程中能够灵活运用公式，为学生节省时间。文化素质的提高不仅能够加强学生的逻辑性，还能够提高学生的综合能力，确保学生在学习过程中能够举一反三，有利于学生学习的进步。除此之外，学生综合文化素质的提高也能够帮助学生理解计算机知识，更容易操作，提高实践水平。培养学生的创新能力，激发学生对计算机教学的兴趣，确保他们能够达到教学目标。创新能力的培养能够帮助学生选择最合适最直接的策略对学习和操作中的问题进行解决，提高他们的思维能力，同时能够培养他们多维方式的思考模式，为学生学习提供良好的保障。　　3.3加强对计算机知识的职业应用指导，学与用并重　　随着计算机技术的不断发展，计算机网络已经渗透了各个工作岗位，如果不能对计算机进行熟练操作，那么势必影响学生的就业。因此学校可以加强对计算机知识的职业应用指导，确保每一名学生都能够了解掌握计算机技术的重要性，并且提高学生对计算机能力的认识，确保他们有足够的计算机技术来应对未来的就业压力。在学习中应用，能够提高学生应对问题的能力，帮助他们在学习过程中了解问题，提高自身的能力，为他们的职业生涯做好准备。　　3.4改变单一的考核方式，提高学生自我评价能力　　改变原有的单一的考核方式，学校应该加强对学生自我评价能力的培养。这样也能够培养学生在职业生涯中遇到问题时能够进行自我反思，有利于学生的全面发展。利用自我评价和互相评价，加强学生之间的互相督促和学习，这样既能为老师节省考核时间，也能够更客观地对每一个学生的学习状态做出评价。自我评价和自我反思在学习中有重要的作用，能够促进学生在学习过程中更完整地了解自身的不足，从提高自身的综合素质。　　4、小结　　随着计算机技术的不断发展，学校需要加强对学生计算机技术的培养，提高学生的操作能力，确保他们能够很好地掌握计算机技术，以减少职业生涯中所遭受的压力。同时，学校也应该从整体上提高学生的综合文化水平，提高学生的综合素质，培养学生的创新能力，这样才能确保他们能够适应社会的发展，成为实用型人才，为社会主义现代化建设作出贡献。"}
