{"title": "农村中小学计算机教学模式的新尝试", "url": "https://www.lunwendata.com/thesis/2019/152809.html", "time": ["2019-01-15"], "info": "　　一、前言　　自从计算机教育在中小学开始普及，取得的成绩在一些经济水平和教育水平比较高的地方确实显而易见，但是在经济和教育水平相对落后的农村，中小学计算机教学实践中还有很多需要高度重视的问题。教学内容现代化，教学方法、课堂结构高效化，教学手段多样化，学法指导经常化，能力培养始终化是新时期给我们农村计算机教师提出的新要求、新任务。　　二、目前农村计算机教学模式建设存在的问题　　1.农村中小学各方面对信息技术的本身关注不够　　学校管理者对其重要性认识不够，而致使信息化建设不能提到应有的高度，在全面建设上存在许多困难：学科教师缺乏对信息技术的内容、基础知识及基本技能的了解和掌握，把计算机教育视为神秘遂敬而远之。学习不够、掌握不多，就谈不上应用技术进行学科辅助教学及学科间的整合；在校学生对信息技术认识不足，仅将计算机作为一种简单的学习工具（学习机）或娱乐机器，不会科学使用从而不能达到掌握信息技术。　　2.农村中小学资金投入不足　　特别是农村贫困地区中小学在按国家规划进行信息化建设上。因地方财政困难资金不足、学校财力有限，自力更生筹措资金更是难上加难.加之信息技术设备更新换代快，大多数学校囊中羞涩。面对应接不暇的新产品.其信息化建设一塌糊涂。　　3.农村中小学学生个性化学习要求得不到满足　　虽然多媒体为课堂提供了大容量的教学内容和声像俱佳的视听效果。但其交互性与个性化教学的优势在教学过程中还没有完全体现出来。部分教师运用现代手段教学显得机械、呆板，缺少必要的师生互动交流和生生互助学习。时间一长.学生容易产生厌烦情绪，这样不能很好地激发学生的积极性和创造性。　　三、农村中小学计算机教学模式的新尝试　　1.愉快式教学法　　作为一项一朝学会终身受益的基本技能，不学又不行，如何进行教学才能激发学生的学习兴趣呢？创设一种愉快的环境，让学生在玩中学、在练中学不失为一种好方法。首先对照实物让学生认识键盘.并利用大屏幕投影仪讲解键位及指法要求，通过游戏分工，让学生分别扮演字母、手指，让他们按指法、键位、字母的相互关系去交朋友、找朋友，通过几次游戏，学生很快就能记住指法与键位。在开始阶段，不要求速度，只要求准确，在采用的训练软件中增加背景音乐和动画效果，力争将枯燥的训练变得形象而生动。　　2.分解任务法　　中小学生年龄较小，自控能力较差，教师的授课时间一长，往往注意力就分散了。为此，在备课时，可将课程分解成若干个模块，每一个模块再分解成若干个知识点，每次课讲解一个模块的一个知识点马上动手进行训练，以增强趣味性，保证教学任务的完成。　　3.任务驱动法　　把教学内容设计在一个个实际任务中，教师带领学生在计算机上完成实际任务，让学生在完成任务的过程中掌握新的知识。对于软件使用的过程中，不能单纯地讲解菜单和命令的使用，采用任务驱动教学法后，可以把学生的角色从“让我学”变成了“我要学”。例如，在学习软件flash的使用中，先让学生欣赏一段用flash软件制作的动画小视频、并添加优美的乐曲，让学生在优美的乐曲声中，欣赏一下flash动画的精美图像，让大家满心期待的通过自己的手，跟随老师的步伐带动大家运用软件制作、修改、换色、添音等，在制作的同时熟练软件操作。最后，再比一比，看谁制作的好。好奇心促使学生兴致勃勃，争先恐后地练、比、听，很快一节课就过去了。只要选择合适的任务作为驱动，教学效果是很显著的。　　4.分层施教和适时奖励法　　现代教育承认个体的差异，对不同水平的孩子实施分层教学就显得尤为重要。为此，以每一个学生的现有水平为起点，制定不同的目标，对程度高的同学设立较高的标准；而对程度差的同学，则降低标准要求，指导他们单项训练。强调不管是谁，只要能达到目标，次次有进步就给予一定的肯定。对于进步较大的同学，适时给予在机房开放时间内玩益智游戏的奖励，用玩这个手段，达到促进练的目的，使多数同学都能在各自不同的基础上有提高，促进了全体学生整体水平的提高。　　5.实践能力培养法　　在计算机教学中激发学生的创新意识，培养学生的创新思维，提高学生的创新能力，促进学生个性的发展，是教师义不容辞的责任。创新能力的培养是创新教育的核心，实践是创新的源泉，为培养学生的实践能力，可以从以下几个方面进行尝试教学。　　（1）单元综合应用训练。?⒚坎糠值慕萄?内容分成几个单元，每讲完一个单元搞一次综合应用训练，例如.在学完Excel后进行口算卡、成绩表的制作的综合训练。学完power point后进行单词学习卡、主题班会演讲文稿的制作的综合训练。　　（2）通过实践活动配合教学让学生在实践中学习。例如，在进行word单元综合训练时，选取宣传画的设计作为单元训练内容，上课前先组织学生进行实践活动，观察学校中的各种活动的宣传画、到商店观看各种商品促销广告，然后再回到学习中来。请学生们讲解他们所归纳出的宣传画的创作方法及思路，教师给予补充及总结。再布置设计主题，请学生回去收集素材.接下来再进行创作，对作品进行讲评，激发学生的学习兴趣，提高学生创新的积极性，让学生享受快乐学习的机会。　　四、结语　　总之，农村中小学计算机教学是一项系统的工程.需要不断地实践探索和研究，及时的解决工作中遇到的问题，并不断地加以完善。这样才能让同在一片蓝天下的农村学校师生平等感受、体验、享用丰富、优质的教育资源，同时推动学校教育信息化与现代化进程。"}
