{"title": "计算机教学中存在的一些问题及其对策", "url": "https://www.lunwendata.com/thesis/2019/157341.html", "time": ["2019-03-05"], "info": "　　中图分类号：G630 文献标识码：A 文章编号：1003-9082（2015）09-0226-01　　引言　　随着科学技术的不断发展，计算机已经不在是那么的陌生，在我们国家的计算机使用人口数量每年都在呈递增的趋势，加上互联网时代的到来。如今，随着这两项科技的广泛使用，人们的工作与生活方式都发生了很多的改变，给人们的生活创造了更多的便捷的同时，也应该更多的去关注一下计算机在教育中存在的一些问题。因为，这将关系到未来计算机方面的人才的在社会上所产生的影响。因此，作为培养计算机优秀人才的中职应肩负起这个使命，通过对目前计算机在教学中产生的问题进行分析与研究，并最终寻找到解决的办法，从而为社会输送更多的计算机人才，为我国的计算机事业贡献出一份力量。　　一、目前中职计算机教学存在的部分问题　　1.学生素质参差不齐　　现在的中职学生中很多都是来不同的地方，我国疆域辽阔，民族众多，风土人情差别巨大，加上教育资源分布的不平衡，就使得中职的学生的个方面素质会在一定程度上出现不同。比如一些山区的学生由于当地的教育十分的落后，来到大学之后才第一次见到了计算机，所以对计算机比较的陌生。可是一些来自发达城市的学生对计算机早已经非常熟悉，良好的学习计算机的条件加上兴趣使然，这部分学生的计算机水平都已经非常的高级，这就给中职的计算机在教学上带来了很大的困难。还有一些生活在经济条件一般的城市或乡村的地方的学生在高中时肯定也接触过计算机的课程教育，可是在现在的很多高中学校还是在以应试教育为主，即使开设了这门课程也只是做做样子，高中教育里对计算机教学的重视程度对学生将来的计算机学习能力会产生非常重要的影响。这些就是造成中职学生在计算机能力方面参差 不齐的原因，对中职计算机教学过程中课程的安排会起到一定的影响[1]。　　2.理论知识与实践无法接轨　　目前，在大多数的中职中，对待计算机的教学仍然注重的是理论知识的教育，并不是每一节计算机课程都会去微机房去上，这就使得理论知识与实践没办法相结合。还有就是，大多数的中职在一个学期结束后对计算机的课程进行考核时，很多时候都是以书面形式来进行的。所以，现在的中职在对待计算机的教学观念上依然是非常的守旧，只光注重理论知识的学习，反而忽视了计算机的实践教学目的。殊不知计算机是一门实践性非常强的课程，学生在学习计算机时若不能做到学以致用，如此的教学只能使计算机的教学效率更加的低下。　　3.教学方式上缺乏创新　　在当代的中职教学过程中，教师交给学生的很大一部分知识都是以后用不上的，和生活没有任何联系的知识。比如数据库、编程等等，对于复杂的计算与程序单词记忆学生会很容易产生厌倦的心理，一旦这种心理产生将很难消除，进而对学生今后学习计算机产生负面影响，对以后的计算机教学非常的不利。　　二、中职计算机改变教学方式的策略　　1.层次教学　　针对中职学生在计算机方面的能离开参差不齐的问题，可以采用层次教学法来解决。所谓的层次教学法指的是，教师在教学的过程中根据学生个人能力的不同来制定相应的教学计划。如此一来，就可以保证每一位同学在学习计算机的时候得到其应有的教育。层次教学还有另一个名字叫做分级教学，就是教师在教学之前对班上的学生进行一次摸底小测试，然后分析学生在计算机学习方面的能力，根据分析的结果将学生分为高低不同的层次，在学生自愿的情况下进行小组分组教学。这样就不会出现在课堂上教学内容太浅显计算机能力较好的学生不听课而白白浪费时间，或者是教学内容太深奥计算机能力太差的学生听不懂的情况。因此，将该教学方式运用到中职计算机的教学中去是再好不过了，如此可以大大的提高中职计算机的教学效率，这也是当今中职计算机教学发展的必然趋势。　　2.加强理论知识与实践相结合　　计算机课程是一门实践性很强的学科，所以，在日常的中职计算机教学过程中，应多注意将理论知识与实践相结合，让学生们强烈的感觉到学以致用的奥妙，如此才能大大提高中职学生学习计算机的兴趣，否则学习那么多的理论知识也将一无是处。因此，在这一方面，中职在安排计算机课程时要科学合理，努力做到将计算机的理论知识与实践相结合，尽可能的让学生到微机房里去上课，让学生所学的知识可以马上在计算机上去得到实践。这种理论联系实际的方式，可以让学生在学习的过程中及时发现自己不懂的的地方，从而使得不懂的知识点不会得到积压，当天就能找到解决的答案。如果学生在接受计算机的教育时只能在普通教室上课，教师只是单方面给学生传输理论知识，根本不管学生有没有听进去。加上学生缺乏动手实践的机会，就算在课堂上学到的理论知识也会在短时内给忘掉，考试的时候也只能是临时抱佛脚。这样的学习方法不能很好的提高学生学习计算机的能力，教师也很难掌握学生真正的实力。所以，为了提高中职学生在计算机方面的学习效率，教师应该要努力克服困难，确保学生能每节计算机课都在微机房内进行，并且改变原来的考试模式，理论知识固然重要，但是也要将实践操作的能力也加入到学生的考核中去。然后对学生的理论知识的掌握程度与实践操作的能力两项作为考核的项目，并且还可以采取阶段性的考核来提高学生在实践操作中的熟练程度，从另一方面讲也可以加强计算机理论知识的实际运用[2]。　　3.丰富教学内容　　如今计算机网络的发展十分的快速，计算机在教学中时也应能紧跟上它的发展才是。所以，教师在教授学生计算机课程的时候在教学内容上不能太死板，可以根据学生的需求而做进一步的调整。比如按照学生的兴趣、目前计算机的发展步伐等来安排教学内容，教学内容很多时候在一定程度上决定了学生在此方面的学习兴趣，比如一些编程类的知识，学生可能很难学进去，教师可以将这类知识变成为学生感兴趣的知识，或者是与学生专业知识有关的内容。比如，如果该学生主修的是艺术，那么就难免会在其他课程学习中用到画图软件，或者在自拍时用到美图软件等，如果是统计专业的学生就会经常用到统计软件或者数据库的相关知识。所以，教师可以更具这些学生的不同需求来安排日程的计算机课程内容。让学生第一时间学习并掌握目前市面上最流行的软件操作，这样会给学生的专业能力带来提升，同时还可以提升学生的计算机水平。具体可以采用以下几种方法：（1）开设选修课程。学生可以根据自己喜欢的知识内容来选择所要学习的有关计算机内容，这样学生的选择就更多，教师也可以参所开的课程出勤的人数来判断知识点的受欢迎程度，同时也等于是做了一项调查，可以给今后教师在安排课程内容是提高借鉴。（2）加强课程内容与学生专业的联系力度！。在教师的带领下让学生学习一些新开发出的与自己所学专业相关的趣味性软件，从而加大学生的学习兴趣。　　三、结语　　如今，随着现代化教育的不断深入，教师应该努力做到改变陈旧的教学观念，加大对教学手段与教学模式的创新研究，将计算机课程变为加强学生专业能力的课程之一，最终以学生计算机能力的提高为目标，改变教学内容等，从而达到提高中职计算机教学质量的目的。"}
