{"title": "微课在高校计算机教学中的应用探讨", "url": "https://www.lunwendata.com/thesis/2019/154721.html", "time": ["2019-02-05"], "info": "　　中图分类号：G434 文献标识码：A 文章编号：1672-3791（2017）04（a）-0173-02　　在科技不断发展的今天，计算机教学是教育极其重要的组成部分，计算机应用水平与能力也日益成为评判人才能力的主要指标。为了提升学习效率、教学实效，不少高校都主动将微课应用于高校计算机教学中，这种教学模式打破了传统教学模式的束缚，广泛学生的喜爱与支持。由此可见，微课在高校计算机教学中的应用尤为重要。　　1 高校计算机教学现状　　高校计算机教学具备较强的创造性与开发性，且深受信息化手段、社会环境、学习氛围的影响，所以，高校计算机教学不可拘泥于固有模式，墨守成规，只有在科学的基础上积极创新教学模式，才能促进计算机教学的健康发展，使之顺应时代潮流，满足时代发展需求。在新知识、技术不断更新的今天，无论是社会环境还是教学都不断发生着变化，加之知识、技术的发展速度较快，所以传统的计算机教学模式已经不能完全适应现代教学需求及社会发展需求。然而，现阶段的高校计算机教学过于注重教师地位，即教师教授、学生聆听与练习，这种教学模式没有与时俱进，在面对新知识时，学生往往显得不知所措，即使教师花费再多的时间与精力进行教育与引导，也难以满足学生实实际发展需求，长期以往，教师与学生都感到力不从心，学生丧失了学习计算机的兴趣，计算机学习效率较低，无法选择与自身兴趣特征相适应的学习方式；教师在课堂教学中也无法集中学生注意力，满足学生需求。　　传统教学模式背景下，教师在没有考虑学生学习成绩、接受能力、兴趣爱好的基础上直接采取同一个教学模式进行教学，这无疑轻视了学生差异，现代化教学手段的应用，所以高校计算机教学枯燥无味，学生学习效率不高，而且这种教学模式仅能呈现课本内容，缺乏计算机领域的新知识与新技能，最终导致计算机教学内容难以跟随社会发展步伐，满足学生个性需求，由此可见，高校计算机教学实效性有待提升。　　2 微课在高校计算机教学中的应用及其意义　　2.1 应用　　微课在高校计算机教学中的应用领域较为广泛，基于微课的应用，既可以较为全面的覆盖高校计算机教学内容，又可以灵活简便的展示高校?算机所有知识点，促进计算机教学实效的提升，其应用具体涉及以下几方面：（1）利用微课自我介绍，在计算机教学开始之前。基本上每一位教师都要进行自我介绍，以增加学生对自身的认识与了解，而利用手段新颖的微课方式进行介绍，可以为师生和谐关系的创建奠定良好的基础，又可以丰富课本内容，提升学生学习兴趣，这无疑为教师课堂教学的成功开展有着积极影响，为学生计算机学习积极性与主动性的提升有着积极影响，所以，教师需要重视利用手段新颖的微课方式进行介绍。（2）利用微课导入课前知识。教师需要在充分了解与掌握新课知识点与学生知识能力掌握情况的基础上进行问题设计及微课制作，在制作完微课微课后，可以在班级群共享文件之中放入课程资源，以便学生在线观看或者下载离线观看，在此基础上再结合自身实况制定合理学习计划，并可以在群内共同分析与探讨相关问题。这样一来，学生能够集中注意力，更好地学习与理解新课。（3）利用微课讲解与巩固知识点，在实际教学过程中，不少教师都会选取课件授课，并依据所学知识将相关视频穿插于课件之中，基于视频讲解教学内容，可以激发学生的学习热情，提高计算机教学质量。其实，高校计算机教师需要认识到利用视频进行计算机教学的重要性，广受学生欢迎，教师需要尝试将微课应用于高校计算机教学中，视微课教学为课堂常态，尤其需要将微课积极应用于知识点灌输环节与巩固环节，从而促进高校计算机教学质量与实效的提升。为了更好地发挥微课授课的积极作用，教师首先需要具备良好的信息素质，可以合理利用新技术收集与整理教学信息，并利用信息技术进行教学；其次需要不断充实自己，丰富自身专业知识，提升自身认知与专业水平；最后需要主动学习与掌握微课视频制作方法及微课讲解技巧，从而更好地在高校计算机教学中应用微课，活跃课堂教学气氛，提升高校计算机教学实效。基于线上学习模式丰富学生的学习机会，这不仅是提高学生学习自主性的主要途径，而且是提高高校计算机教学的主要方式。（4）利用微课吸收课后知识。微课在高校计算机教学中的应用还有利于帮助学生更好地吸收与转化所学知识，在完成每一阶段的教学后，教师可以依据学习实况制作相应微课视频，以帮助学生归纳与巩固知识，设计与学生特征爱好相适应的习题，有效联系计算机知识结构，这对于计算机基础较差或者学习能力较弱的学生而言，有利于促进完备知识体系的形成；对于计算机基础较好或者学习能力较强的学生而言，有利于加深所学知识印象。　　2.2 意义　　（1）丰富了教学内容，发挥了学生主体作用，尽管微课教学方式时间不长，但内容较为丰富，现代信息化手段的应用活跃了课堂教学氛围。微课在高校计算机教学中的应用同样取得了良好的成绩，如创新了教学模式，发挥了学生主体作用，为课堂教学注入了新的活力，学生学习不再拘泥于固有模式，可以结合自身特征与兴趣爱好选取适宜自己的方式与内容，这无疑充分尊重了学生差异，提升了学生学习效率。（2）满足了学生个性化学习需求，激发了学生学习积极性，微课在高校计算机教学中的应用可以顺应学生学习需求，学生可以自主学习或有针对性学习，选取自己所需或者感兴趣的微课实施学习，此种教学模式背景下，学生自主学习权利较大，学习积极性较高，所以，微课教学模式为学生个性化需求的满足提供了良好的空间。（3）明确了教学目标，提高了学生学习效率，微课教学方式在丰富了教学内容的同时还明确了教学目标，基于对计算机教学活动的开展，学生可以进一步认识与了解某知识点，明确教学重难点，加之微课教学方式具备针对性特征，所以学生可以更深入的认识与掌握计算机知识内容，减少疑惑，科学分配课堂学习时间与课后学习内容，从而提升学生的学习能力与学习效率。（4）制作了合理主题，提升了学生自学能力，微课视频制作在一定程度上取决于相关主题，教师需要不断充实教学资源库，以便于学生选取自己所需或感兴趣的微课程，加深对知识的了解程度与掌握程度，在实际学习过程中，学生可以自由选取时间巩固旧知识、预习新知识，从而促进学生自学能力的提升，促进教学实效、学习质量的提升。　　3 结语　　总而言之，微课除了是计算机教学的辅助手段，还是教学方式，将微课应用于高校计算机教学中有着极其重要的意义，即教师可以丰富自身专业知识，拉近与学生之间的距离；学生可以提升自身学习能力，实现学习目的。但当前微课在高校计算机教学中的应用还存在一些不足，但随着课程的积极探索与创新，这种新型教学模式自然会逐渐完善，从而在未来教学中更好地发挥自身作用。"}
