{"title": "试论高校计算机教学与学生创新能力的培养", "url": "https://www.lunwendata.com/thesis/2019/157770.html", "time": ["2019-03-09"], "info": "　　目前，我国高校计算机的教学中还普遍存在着理论脱离实践，教学内容滞后的传统教学方法，但当今的社会要求中，已不能满足高等教育的要求。而现在社会对于人才的要求是不但要在理论知识上的过硬掌握，同时还要对操作技能及经验上的要求越来越高。所以在我国的高校教育中，应面对这一根本趋势在教学方法上进行改革和创新，培养出能够适应社会要求的高素质人才。本文将就高校计算机与学生创新能力的培养进行可行性的探讨，并就问题提出可行的解决措施。　　一、目前我国高校计算机教学存在的问题　　（一）理论与实践的脱节。目前，我国高校的计算机教学中普遍存在着理论和实践严重脱节的现象，只重视理论考试，对实践操作能力的忽略，这在教学中严重背离了创新的理念。　　（二）教学内容滞后，对知识的更新不及时。因高校在教学上只注重教学理论考试的原因，造成了在教学中教学的内容一成不变，与实践操作课比例严重失调，在这样的教学方式下很难培养出具有创新思维的学生。　　（三）教学方式落后，注重考分和理论，忽略实践能力的培养。由于在我国高校计算机的科目考试中，实践操作在整个计算机考试中占据的比例小，而理论成绩则是考试的重点，这造成了对于学生创新精神的培养非常不力，并且对一些赋予创新思维的，操作能力强的，不擅长记忆的学生产生了很大的不公现象。　　（四）专业课程实质缺乏科学性和时代性。在高校计算机教学课程中采用的教学模式为传统的“三段式”，并没有根据学校的特色，针对高校学生知识更新快的特征，教学课程没有跟上时代进行适当的改变，此外教师对于理论知识教学的过度偏重，进而无法培养出具有较强创新能力的计算机人才。　　（五）双师型教师的缺乏。高校在对于计算机创新人才的培养中，教师的素质和技能是起到至关重要的作用。但现阶段高校计算机专业的教师由于知识结构及技术能力上与社会要求的存在着明显的差距。此外，由于高校计算机教师因常年处在封闭的学校教学场所，缺乏实践的经验，更加无法与IT开发人员相提并论。在这样的背景下也无法培养出创新性计算机人才。　　二、在高校计算机教学中培养学生创新能力的对策和建议　　（一）加强专业课程的更新。知识的获取和技能的掌握主要是通过课堂教学上教师的传授，成为了对学生独立思考和创新精神的主要手段。教师可以通过对学生强烈求知欲或变化无穷的画面设计情景问题，对学生创新思维及能力的激发起到重要的作用。　　（二）改变传统教学模式，注重学生创新能力的培养。自主能力学习及创新能力对于学生的发展具有重要意义，在计算机的学习中学生需要将学习方式又被动向主动转变，根据实际的问题运用掌握的学习方法进行解决问题。由于计算机知识很复杂，学生可以利用自主学习和创新能力进行对计算机知识体系系统的掌握，老师可以通过结合现阶段我国对计算机人才的需求，以指导者的身份，对在校的学生进行素质教育和专业知识的培训。　　（三）提高教学能力和专业素质。近年来，对于高校扩招给高校造成了学生管理和教学内容困难增加，使教师在教学信心上产生了倍受打击的心理，这需要教师提高教学能力和专业素质及自身的修养，内心承受能力。同时还要对学生的观念及教育的培养，树立信心，用于承担起振兴民族的希望、教育希望的重任。　　（四）建立合理的考试评价机制。对于学生创新能力的提升，合理的考试评价机制是必不可少的教学手段，将考试评价机制与培养有效的结合可以发挥极大的效果。这针对当前绝大多数高校还存在着传统的教学考试机制，在无形中会给学生造成自信心上的打击，因此采用多种考评的新型考核评价机制具有重要的现实意义。　　（五）营造良好的创新教育环境。学生创新能力的培养，良好的创新环境起到了关键的作用。教师应结合计算机教学环境使学生逐步培养起创新的意识，给学生更多的发言表达自己观点的机会，鼓励学生间进行交流和沟通，大胆质疑，并帮助身边的同学解决问题，使学生逐步培养起创新的意识及迈向成功。高校计算机教师应重视教学目标的导向作用，不仅要有计算机学习的认知目标，更重要的是要有培养创新精神及创造性思维和创造能力的目标。　　三、结语　　综上所述，对于对我国当前高校计算机的现状进行了分析，学生的创新能力十分欠缺。虽然我国教育行业对于创新能力在我国高校计算机教育中具有重要作用有了明显的认识，但教育现状在短时间内不可能完全改变，教师可以根据教材对课堂结构进行改革，运用先进的教学理论对教学思路进行全新的展示，利用计算机教学中创造的教育因素，对学生进行创造能力的培养及挖掘，让学生自由的发挥，从而使学生的个性及创造性思维得以进一步的提高，对于学生的素质起到全面性的提高，在教学上必须要把重心由知识上转移到实践应用能力及创新能力的培养上，同时还要在教学观念上进行改革，培养出能够适应社会要求的高素质人才，这对于我国高校计算机教学中学生创新能力的培养具有十分重要意义，为缓解我国计算机人才需求贡献力量。"}
