{"title": "成果导向理念下《大学计算机》课程教学改革与实践", "url": "https://www.lunwendata.com/thesis/2019/156562.html", "time": ["2019-02-25"], "info": "　　中图分类号：G64 文献标识码：A 文章编号：1009-3044（2018）12-0139-02　　Abstract：Achievement oriented education is an advanced， scientific and reasonable educational concept. It is of great practical significance to improve students' computer skills by applying it to the reform of computer courses. Based on the elaboration of the connotation of achievement oriented education， taking the course of university computer as an example， this paper puts forward curriculum reform and practice methods from revising course content， constructing platform suitable for independent learning and collaborative learning， reconstructing curriculum teaching， learning， examination and evaluation.　　Key words：Achievement oriented Education；Curriculumreform；Modular teaching； platform　　成果导向教育（OBE）理念发展于20世纪90年代，其教育理念得到广泛的重视与应用，至今被认为是卓越工程教育的正确方向。因此用成果导向教育理念指导计算机类课程改革具有重要的现实意义。　　1成果导向教育的内涵　　成果导向教育（OBE）称为基于学习产出的教育模式，是一种先进的、科学合理的教学理念。OBE指教学设计和教学实施的目标是学生通过教育过程最后取得的学习成果[1]。其强调对学生行为结果的测量，注重学生学完之后能真正做什么，而不是学了什么。美国学者SpadyW.D在其著作中对OBE的概念进行了界定，即“对资源和系统的调整，使之清晰聚焦于促使学生在未来生活中获得成功的实质性经验”。在成果导向教育下，成果决定过程，课程设置以最终成果为导向，在学习结束之后，?W生应当展示自己所学到的知识，它注重课程内容、教学方法、教学策略与教学评估之间的高度匹配[2]。成果导向教育强调4个问题：1、学生取得的学习成果是什么？2、为什么要让学生取得这样的学习成果？3、如何有效地帮助学生取得这些学习成果？4、如何知道学生已经取得了这些学习成果？　　成果导向教育理念中的学习成果是学习者在顺利完成某阶段学习过程后所应知道、理解和掌握的方面。作为描述学生在某时间段结束后能被检验的学业成绩，学习成果是具体的、可检测的，可用于描述任何有效的学习形式。而学习成果的具体性指的是学习成果最终的表现形态，可以是知识、技能、素质等方面具体形态或其一系列组合。　　可见，OBE强调成果导向、重视学生学习成效、明确确定毕业生能力，其教学质量的评估侧重于教育的产出，即能力和成果、成绩和效果上。因此在课程教学中应明确学习的成果，配合多元弹性的个性化学习要求，让学生通过学习过程完成自我实现的挑战[1]。　　2 成果导向教育理念下的课程教学改革与实践　　以成果导向教育（OBE）理念贯穿到《大学计算机》课程教学全过程，提升课程对毕业要求达成评价的支撑度，实现教、学、考、评的有效衔接。在整个教学过程中，加强学生自主学习能力培养，在完成学生基本的学习需求上，培养学生利用课堂知识来解决在行业上的问题，满足学生未来可能的需求。因此结合学校专业人才培养目标、学生的情况及计算机公共基础课程的特点等方面因素，从以下几个方面进行课程的改革与实践。　　2.1修订课程教学内容　　成果导向教学理念打破传统的以教师为中心的教学模式，强调学生的主体地位，指出课程教学的目标是让学生具备相应的能力，教师所从事的一切教学活动都是为达到教学目标而采取的手段。因此课程改革的首要任务就是打破思维定式，彻底转变思想，认真反思过去的教学工作，明确高校计算机类课程人才培养要求，课程教学目标，重新整合课程教学内容，修订课程考核方案。《大学计算机》是高等学校计算机公共基础课程中的核心课程，是非计算机专业开设的第一门计算机公共课程。课程内容涉及计算机基础知识、网络与多媒体技术基础、办公自动化、程序设计与数据库技术基础等方面，突出实践性与人文性，注重前沿知识的介绍。在《大学计算机》课程改革中根据不同专业需求，修订课程大纲，以此更好实施课程面向专业、面向学生的教学目标。如下表1所示为化工专业《大学计算机》课程的教学安排表，课程教学内容共包含五个模块。　　其中，“拓展知识”模块作为动态内容模块，提供学科前沿知识与进行新的应用技术推广。　　2.3 建设适合自主学习和协作学习的平台　　成果导向教育要求学校和教师不应以同样的方式在同一时间给所有学生提供相同的学习机会，而应以更加弹性的方式来配合学生的个性化学习要求。因此要求课程的学习资源要具有指导性及全面性。因此在《大学计算机》课程中采用混合式教学方式，把课程中涉及的教学资源进行数字化改造，并且结合课程网站、教学平台与实验测评三大平台辅助开展课程的教与学。   　　1）课程资源的数字化改造　　A、基本资源：反映课程教学思想、教学内容、教学方法、教学过程的核心资源，包括课程介绍、教学大纲、教学日历、教案或演示文稿、重点难点指导、作业、参考资料目录和课程教学视频等反映教学活动必需的资源。　　B、拓展资源：应用于各教学与学习环节、支持课程教学和学习过程的多样性、交互性资源。如：案例库、优秀学生作品、素材库、在线自测、考试系统、课程学习网站链接、文献规范档案资料库。　　C、在线学习资源：对课程内容进行MOOC化改造，即把每一章的知识点进行分块处理，制作成10分钟左右的微视频，供学生在线学习与巩固。　　2）构建课程教学平台　　成果导向教育理念构建的关键点在于通过整合各类教学资源、协调教学过程的各环节，构成一个在教学质量上能够实现自我约束、自我激励、自我改进以及自我发展的有效运行机制。因此在课程的实施中以课程网站、计算机实验系统、网络教学系统、课程QQ群等平台为依托构建学生在线自主学习、交流协作、自我测试的环境，让学生在此环境中达到“乐学”、“会学”、“学会”。以下图为《大学计算机》课程网站。　　2.3 重构课程教、学、考、评　　成果导向教学要求以?W生为中心，以成果为导向，重视学生在取得成果的过程。因此需重构课程教、学、考、评内容，以此提升学生的学习能力、创新能力、沟通能力与团队合作能力。在《大学计算机》课程中进行了如下的教学处理：　　1）模块化教学　　课程实施模块化教学，即进行课程内容、教学过程、课程考核、课程评价的模块化，注重学习过程与实践能力培养。　　2）模块化考核　　在模块化教学中，当某模块教学结束后即利用考试系统对该模块进行考核，这样不但可以降低学生学习的压力，提高教与学的效率，同时不同模块可根据其具体目标要求，内容制定各自的考核策略，进行不同形式的考核、灵活性好、针对性强。　　3）模块化评价方法　　成果导向教育理念下的教学评价是把以“教”为中心的评价转换到以“学”为中心，在整个评价中体现出学生参与度、教师实时跟踪、师生及学生间的合作交流。因此在课程中采用模块化的评价方式，把各个模块的考核成绩及课程平台记录的学生学习状态数据，按课程评价策略进行最后的评定，课程评价模块化改变过去所沿用的期末考试“一刀切”的做法，注重学习过程与实际技能，科学、全面、公平及人性化。评价公式如下：课程总评100%=学习状态30%+模块考核70%，其中：学习状态=考勤30%+作业30%+技能30%+状态10%；模块考核=基本模块考核80%+拓展模块考核20%。　　3 结语　　成果导向教育作为一种先进的、科学合理的教育理念，在全世界已经得到广泛的应用，实践证明以成果导向教育指导下的计算机基础课程改革是实施“应用型人才培养”、“卓越工程师培养计划”的重要举措，为了更好推进人才的培养需要我们在成果导向教育理念的引导下积极推进教学改革，在教、学、考、评方面加大改革力度。"}
