{"title": "职业院校计算机应用基础课程教学改革探讨", "url": "https://www.lunwendata.com/thesis/2019/156424.html", "time": ["2019-02-23"], "info": "　　中图分类号：G424 文献标识码：A 文章编号：1009-3044（2018）14-0159-03　　不管是在职业院校还是在本科院校，计算机应用基这门课程对于计算机应用专业的学生来说，都是一门最基础而且必须要掌握的公共基础课程。这门计算机应用基础课程是计算机应用专业学生的入门课程，它引领计算机应用专业的学生走入计算机领域的大门。由此可见，计算机应用基础课程的重要性就不言而喻了。通过计算机应用基础课程的学习，学生们首先需要了解这门课程的基础知识和概念，然后要学会一些基本的计算机操作技能。在网络信息时代的大背景下，对计算机应用基础课程的教学提出了更高的要求。这门课程的教学任务是什么？学生们要通过这门课程学会什么？怎样才能很好地掌握这些基础知识？课程应该怎样安排才合理？任课老师要怎样讲授这门课程？如何才能吸引学生们对这门课程的兴趣？这些问题必须要引起我们的深思。由此，对计算机应用基础课程的教学改革迫在眉睫。　　1 当前教学方式的现状和存在的问题　　计算机应用基础课程是计算机应用专业的基础，计算机应用专业的学生要具备信息处理的能力，这是该专业的基本要求。新时期新阶段，对计算机应用专业的学生的要求又提高了。计算机应用专业的学生们要了解并且熟练掌握本专业的基础理论知识，知道本专业将来是做什么的、怎么做等一些基本问题，不能是一问三不知的状态。除了对基础知识的掌握，计算机应用专业的学生还要具备较高的职业技能。这种职业技能是计算机应用专业的学生在社会上获得面包的饭碗。培养计算机应用专业的人才需要确保学校管理者对该专业的课程考核是合理科学的。　　在应试教育的长期束缚下，当前的教育方式漏洞百出。深入研究发现，当前教育方式存在的问题具体可分为以下几个方面。　　1）学生的计算机水平参差不齐　　经济的发展促进了人们的消费水平。现如今，哪个家庭没有台计算机。人们都认识到了使用计算机所带来的巨大方便，计算机的普及程度越来越高。原先，家里有一台计算机的都是经济水平很好的家庭，而且那时候中小学也没有开设计算机相关的课程，计算机还属于稀有物件。很多学生小的时候都没有接触过计算机。在职业院校的计算机应用专业中，学生们的计算机水平差异特别大。入学成绩也是悬殊很大。有的学生在高中的时候很少接触计算机甚至是没有接触；有的学生在高中的时候学过一些与计算机相关的课程，但是了解不够深入；有的学生就比较幸运了，他们对计算机的接触比较多，对一些基本操作研究也比较深入。计算机水平的差异就会导致学生们对计算机应用基础课程的兴趣不一。学生们普遍有这种思想：我感兴趣的课程我就多学点，不感兴趣的课程就少学点。长此以往，学生们的差距会越来越大，逐渐形成恶性循环。　　2）授课形式单一　　虽然现在计算机应用专业是热门专业，但是在绝大多数的高校和职业院校中，学校对计算机应用基础课程的重视程度还远远不够。许多任课老师讲课的时候就像是完任务一样，讲完了就万事大吉了。上课时间到了，老师就开始讲课本上的理论知识，讲完后让学生们做简单的练习就下课了。学生们还没能够很好地了解、消化、吸收这节课所学的内容，下节课就开始学习新的内容了。学生们每天学的全都是理论知识，枯燥乏味。动手实践能力没能够得到重视，这就使得学生们即使学会了理论知识，也不知道怎么去应用这些理论知识。试想一下，长此以往，能有几个学生始终对这门课程保持高度的热情。最终的结果可想而知。　　3）教学方法落后　　在职业院校计算机应用基础课程的教学中，方法落后，形式单一，老师们在课堂上只通过板书来教学，这样并不利于提高学生的积极性。随着我国教育体制的不断深化改革，原先传统的板书教学方法已经不能满足当前教学发展的需求了。我们急需一种新型的教学方法来提高教育教学水平和质量。因此，多媒体教学就应运而生。多媒体技术就是计算机应用技术的一个重要应用。多媒体教学能够为学生们展示更多更全面的知识，可以拓宽学生的眼界和知识面。现在，越来越多的学校都在使用多媒体教学方式。通过多媒体，学生们能够更加直观的接受信息，结合老师所讲的知识，学生们能够轻而易举地就理解并且吸收这些知识。除此之外，计算机技术在教学上的另一个应用就是阅卷的方式发生了变革。传统的阅卷方式是老师们人工阅卷，这种方式非常累，准确率还没有特别高。现在，各学校一般采用电脑阅卷。电脑阅卷不仅节省了人力准确率还非常高，除非系统发生故障，否则想出现阅卷失误都很难。　　4）教学方法呆板不灵活　　第一点我们已经说过，学生们的计算机水平参差不齐，对计算机的相关知识的掌握情况是存在差异的。来自城市地区的学生很明显对计算机的知识掌握的要好，计算机基础好。然而来自农村等偏远地区的学生对计算机了解甚少，不能很好的应用计算机。在学生基础存在差异的情况下，上课的内容却是一样的。实际的教学并没有考虑到学生的不同。这种情况下，就导致了基础好的学生学习的积极主动行高，而基础差的学生很明显对计算机应用基础课程提不起兴趣。老师们并没有照顾到所有的学生。长此以往，计算机基础差的学生在学习上更加吃力，甚至是非常努力地学习却还是学不会。   　　5）考核方式不能很好地体现学生对知识的掌握情况　　在中国国情的大背景下，应试教育一直是各高校考核的主流，甚至是唯一的考核方式。这种传统的教育模式，仅仅考虑课程结束后的最终考核，一般就是以试卷的考试成?作为评价的依据。考考考，老师的法宝；分分分，学生的命根。这句话，十分生动地诠释了这种传统的考试方式的弊端。教师教学是为了最终的考试，学生学习是为了最终考试成绩。这种评价体系非常死板，不灵活。它考核的是学生们的记忆能力，即对基础知识的掌握，却严重忽视了学生们的创新思维和综合能力。学生们仅仅知道学的是什么，却不知道如何运用自己所学的知识。那么，构建一个合理并且科学的考核评价方式就变得极为重要和迫切需要。长期以来，我校计算机应用专业普遍采用的传统考核方式是理论考试和实际操作相结合。这样来看，这种考核方式还不算太糟糕，最起码它没有只注重理论考试而忽视了学生的动手操作能力。但是，我校计算机应用专业的考核内容都出自教学课本，所有的考核内容在课本上都能够找到，这样学生们的学习就只依靠课本教材，没有课外知识的拓展，长此以往，这种考核方式会使学生们的眼界过于狭隘，对知识的掌握不全面，学生们对学习就会出现逆反心理，会出现不想学习、得过且过的心态。这种考核评价方式会阻碍学生们的全面发展。　　2 教学改革的具体措施　　1）因学制宜，培养学生们的兴趣　　当前教学方法的问题之一就是学生们的计算机水平参差不齐，对计算机应用基础课程的兴趣不浓厚。针对学生们对计算机基础知识的掌握水平参差不齐这一问题，在教学改革中可以采取分班制度，即根据学生们的计算机水平，把学生们分成A、B两个班级。A班的进度快一些，教授的内容多一些，深度上也有区别于B班。对B班的学生，老师要适当放慢讲课的速度，尽量先让B班的学生们掌握好基础知识。俗话说得好“兴趣是最好的教师”。正因为如此，教学改革的另一个分成重要的举措就是提高学生们对计算机应用基础课程的兴趣。只有当学生们对计算机应用基础这门课程有了兴趣之后，才能最大限度地调动学生们的学习积极性。有了学习积极性，学生们对计算机应用基础这门课程的兴趣会更好，如此，便形成了一个良性的循环机制。这样，就达到了教学改革的目的了。像计算机应用基础课程这样的公共基础课程，它的任务不在于让学生们掌握这门课程的多少知识，而是要培养学生们对计算机应用的兴趣。　　2）大刀阔斧地调整教学方法　　要想对计算机应用基础课程的教学进行彻底有效的改革，就必须对原有弊端重重的传统教学方法进行大刀阔斧地改革，培养学生们的学习积极性和动手操作能力。老师在讲课的时候，不能总是进行理论的教学，要增加学生们动手操作的时间。　　3）构建形成性考核体系　　在计算机应用专业形成性考核评价体系中，学生是占主体地位的。最终的考核是通过阶段性评价和终结性评价相结合的方式。根据计算机应用专业的课程的不同，形成性评价体系应该有所不同。在形成性考核中，要加强过程考核所占的比例。比如说，在某个课程中，对学生的出勤率要有所要求，不来上课的同学不给或者是少给过程考核成绩。老师上课提问问题，回答正确的学生可以获得过程考核成绩加分的机会，回答错误的学生不扣考核成绩。通过这种方式，可以是学生们上课的时候集中注意力，认真听讲，努力学习知识。　　既然计算机应用专业形成性考核体系具有传统考核方式所不具备的各种优势，那么为什么形成性考核评价体系的应用却不是那么广为人知呢？这就涉及了课程的多样性。前面我们已经说到，不同的课程，需要建立不一样的形成性考核评价体系。不同的课程的体系构建是不能互用的。这就要求我们针对不同的学科所构建的形成性考核评价体系是各种各样的。可想而知，这项工作是非常浩大的一项工程。要想完成它，绝非一朝一夕就可以的。而且，我们在形成性考核评价体系中还没有很好的积累经验，可以说，这条道路完全是摸着石头过河，需要我们不断探索发现。　　3 结束语　　当前传统的教学方法存在太多的弊端，对计算机应用基础课程进行教学方法的改革是势在必行的。这也是社会对职业院校提出的要求和任务。科技在进步，我们必须对计算机应用基础课程时刻进行改革，才不会被时代的浪潮拍倒，才能在就业竞争中获得一席地位。"}
