{"title": "浅谈银行计算机网络系统的安全防范", "url": "https://www.lunwendata.com/thesis/2019/155956.html", "time": ["2019-02-18"], "info": " 　　摘 要 随着计算机和网络的高速发展，在银行系统中的运用也越来越广泛，但是随着近几年来金融犯罪数量的增多，计算机网络系统成为了犯罪份子获取利益最主要的渠道，加强银行计算机网络系统的安全是银行最基本的工作，本文主要是对银行计算机网络系统的完全防范做了简要分析。　　关键词 计算机网络　安全防范　管理　　　　一、银行系统面临的网络安全问题　　银行系统面临的网络完全问题，既有外在的因素，也有内在的因素，外面的人员利用黑客软件等破坏计算机网络系统，或者给银行网络传播某些病毒，从而造成网络灾害性的后果，另外是银行的内部人员，利用工作之便，利用网络实施金融犯罪，我们只有了解银行系统面临的网络安全问题，才能从根本上预防这些问题。　　（一）遭受各类黑客的侵犯和破坏　　存储和运行在银行计算机网络系统中的信息、数据，不仅本质上代表着资金的运动，而且从微观上能反映某些企业的经济活动，从宏观上能折射出国家的经济运行情况。因此，更多的黑客对银行网络系统更加的感兴趣，他们利用一定的技术，监控银行网络系统的数据，从事一些秘密的间谍等工作。有些黑客甚至修改银行网络的系统内数据，盗取客户的资金，有的甚至恶意破坏银行的计算机系统，造成网络堵塞，甚至系统奔溃。在我国的电子商务中，很多出现的问题是因为黑客的攻击所造成的。　　（二）计算机网络系统的设备遭到破坏　　在计算机网路中的关键设备，包括各类计算机（工作站、服务器等）、存放数据的媒体（光盘、磁带机、磁盘机等）、网络通信设备（交换机、路由器、调制解调器、集线器、加密机等）、供配电系统、传输线路、抗电磁干扰系统等遭受破坏，从而导致整个银行计算机网路系统出现问题，这类问题一部分是人为因素引起的，操作不当，另一方面是设备老化等问题引起的。　　（三）内部人员利用网络实施金融犯罪　　据有关数据分析，在破获的利用计算机网络进行金融犯罪的人员中，银行内部人员占了很大的比重，他们利用工作之便，修改内部数据，盗取各种资料，挪用公款。甚至一些网络设计人员，早就预留好系统漏洞，给银行业的计算机网络带来了很大的安全隐患。　　（四）面临名目繁多的计算机病毒的威胁　　各类计算机病毒，时刻威胁着银行的计算机网络，计算机病毒可导致计算机系统出现瘫痪，网络的效果减低，甚至数据被监控，出现某些功能不能正常的运行，带来的后果是非常的严重。但是病毒确无处不在，要做好计算机网络不被病毒所侵犯，是个艰巨的任务。　　二、银行计算机网络系统的安全防范工作　　笔者认为，银行计算机网络系统的安全防范工作是一个极为复杂的系统工程，是人防和技防相结合的工程方案。在目前法律法规尚不完善的情况下，首先是各级领导的重视，加强工作人员的责任心和防范意识，自觉执行各项安全制度，在此基础上，再采用一些先进的技术和产品，构造全方位的防御机制，使系统在理想的状态下运行。　　（一）加强安全制度的建立和落实工作　　安全制度的建立是非常重要的。一定要根据本单位的实际情况和所采用的技术条件，参照有关的条例、法规和其他单位的版本，制定出切实可行又比较全面的各类安全管理制度。主要有：场地与实施安全管理制度、操作安全管理制度、设备安全管理制度、计算机网络安全管理制度、操作系统和数据库安全管理制度、密钥安全管理制度、软件安全管理制度、计算机病毒防治管理制度等。　　制度的建立切不能流于形式，重要的是落实和监督。尤其是在一些细小的环节上更要注意。如系统管理员应定期及时审查系统日志和记录。重要岗位人员调离时，应进行注销，并更换业务系统的口令和密钥，移交全部技术资料，但不少人往往忽视执行这一措施的及时性。还有防病毒制度规定，要使用国家有关主管部门批准的正版杀毒软件及时进行查毒杀毒，而不少人使用盗版杀毒软件，使计算机又染上了其他病毒。　　另外，要对工作人员进行定期的法制教育和安全教育，让他们能认识到计算机系统安全的重要性，提高了工作人员的素质和法律意识，才能有效的防止内部人员利用计算机网络安全进行犯罪，安全工作是个长期的过程，需要所有工作人员长期不懈的努力，及时发现问题，不断解决问题。　　（二）采用先进的计算机杀毒软件　　杀毒软件的不断更新，并且采用世界上先进的，针对银行系统计算机网络的杀毒软件，是抵制病毒攻击最有效的手段，才能从根本上预防无处不在的计算机病毒的影响。杀毒软件在有新的病毒库发布后，就要立即进行更新，拥有新的病毒库才能抵抗新型的病毒。　　（三）重视软件的开发　　银行系统除了拥有常用的杀毒软件外，还应该有适合自己的安全防范软件，重视应用软件的开发研制工作。软件的开发应该与银行自身的特性相适应，得经过多方的论证，严密周全的考虑，编程过程要对数据进行加密，确保网络和数据的保密性。软件要经过多次试验和测试后，若发现了缺陷应该及时进行修正，待没有其他问题后方可投入到银行的计算机网络系统中。　　（四）重视硬件设备的改善和更新　　银行内计算机的硬件设备要定期的进行检查，定期检测机房周围的磁场强度对应计算机系统的硬件设备，必要的时候应该积极的进行设备的更新，比如采用增加运作的内存，储存容量的硬盘等等，而且对应硬件所处的环境也要进行改善，防止计算机收到其他的干扰，如电磁，电波辐射等，影响计算机系统的正常运行。　　三、结束语　　在高科技发展的现代社会，计算机给大家带来方便的同时，也会隐藏着很大的安全隐患，在安全级别要求很高的银行网络中，只有做好各项预防工作，从内因，外因等多方面进行分析，清楚哪些地方是计算机网络安全的薄弱点，采取先进的方法，重视软件的开发，配备较好的杀毒软件，加强银行内部的管理，只有引起所有的人员的重视，才能确保计算机网络系统的安全。　　参考文献：　　[1]邓长春.浅谈网络信息安全面临的问题和对策[J].电脑与电信,2007,(03)．　　[2]顾红波.浅谈计算机网络安全防御策略[J].林业资源管理,2004,(05). "}
