{"title": "民办技工学校《计算机应用基础》课程教学的研究与探索", "url": "https://www.lunwendata.com/thesis/2019/159027.html", "time": ["2019-03-24"], "info": "　　我国民办技工学校从20世纪80年代初期至今已接近30个年头，民办技工学校的办学特点要求民办技校学生在校学习期间更加注重社会的需求，专业学习更加要以社会适应型、应用型、职业型为目标，充分了解社会所需，民办技工学校的毕业生才能突出自身对社会适应性强， 自身定位好，专业知识和技术对路，且一专多能的特点。　　二、课程的介绍　　《计算机应用基础》涵盖了计算机基本应用的多个方面，主要包括计算机基础知识、Windows操作系统、office办公软件（word文档、Excel表格、PowerPoint演示文稿）、Internet的应用等几个方面的内容，其中计算机基础知识和windows操作系统是知识型和技能型的内容为主，而后面几个方面的内容虽说是知识型为主，但更多的是操作型的内容。因此，这一部分也是教师讲授内容的重中之重。　　三、《计算机应用基础》课程教学的现状和存在的问题　　（一）学生的基础不一样，导致了基础教学难度的增加。相对于发达地区的学生很多在小学时就已经接触过办公自动化软件的使用了，但是相对于其他地区的学生，有些到了高中里面还没有接触到计算机。这些情况导致学生在计算机知识水平差别很大，加大了教学难度。如若教师按照教材从头开始讲，那会有较多的学生会不感兴趣，不想听，玩游戏、上网，教师就无法维持课堂秩序，若要照顾会的学生，则基础差的学生无法跟上，教学进度难于把握。　　（二）教学模式和教学方法手段陈旧，忽视了学生是学习的主体。目前计算机应用基础课教学手段很多都是多媒体机房。在大屏幕上投影教学内容时间长后容易造成学生视觉疲劳，出现打瞌睡、玩游戏等影响课堂秩序的情况出现。　　四、教学模式　　（一）采用多媒体机房教学模式。计算机应用基础这门课程理论知识涉及面比较广的课程，这门课程在教学过程中主要以多媒体课件和案例讲授为主，以实物展示、图片演示、师生问答和课堂练习等方法为辅来提高教学效果。任课教师根据教学大纲要求，针对课程的重难点，制作多媒体课件，将相应的教学内容以图片、文字解释的形式表现出来，这样可以调动学生的学习兴趣。因多媒体机房使用多媒体课件进行授课，所以任课教师在教学时要注意留给学生一定的独立思考、探索的空间和授课进度的合理安排，使学生不至于对这门课程失去学习的兴趣。在本课程中这种教学模式适应于讲授计算机发展史、计算机硬件的只是和组成、计算机网络的基础知识等理论内容。例如在讲授“计算机发展史”这一内容时，任课教师通过利用多媒体课件展示了微型计算机的各个组件来讲解冯.诺依曼思想的框图，让大家对计算机的组成有一个整体的了解以后，展示各组成部分的实物并简要说明其作用，使学生进一步加深对各组成部件的认识，最后通过对计算机各个组件的概括来推出冯.诺依曼思想，这样下来学生既掌握了计算机的组成也了解了相关的计算机硬件配置和安装常识，达到了学以致用的目的。　　（二）采用以上机操作为主的学习模式。计算机应用基础是一门操作性熟练性要求都比较强的课程，学生只有通过上机操作才能更好的熟悉相应的计算机应用操作能力，例如：windows操作系统、word文档、Excel表格等，对这些内容应采用以上机操作为主的练习模式。采用这种模式应注意：教学应以上机练习为主，精讲多练：“精讲”是指教师授课要将课程教学内容的重点、难点和基本的操作要点为主；“多练”是指让学生在课堂中有足够的上机操作练习的时间，结合一级考证的知识点，进行有目标、有重点的上机操作练习。一般来说，Windows操作系统、Word文档、Excel表格、PowerPoint演示文稿等内容，需要上机边讲边练。这样，学生的思路才能始终跟着老师的授课内容，既可以吸引学生的注意力，并且也能够调动学生的上课积极性，减少学生上课开小差等情况，便于老师及时发现学生在上机操作中出现的问题和及时解决学生在上机操作中出现的问题。　　五、教学方法　　（一）案例教学法。在讲Word的表格制作时，可以先让学生看一些简单的简历表格，然后介绍表格的基本制作方法，引导学生制作一张自己求职的简历表格，让学生对制作表格的知识和可能出现的问题有一个初步的认识，接下来老师再根据一级考试的大纲要求，结合一级考试的样题，对表格制作的属性设置、公式使用等知识点进行重点讲解；最后让学生上机练习并通过练习找出其规律性的东西，达到既熟练掌握所学内容又学会学习方法的目的。　　（二）问题式教学法。在学习Excel表格时，我们可以通过提问学生、任课教师协助解答的互动授课方式来解决学生觉得学习Excel表格难学习的厌恶心态。例如，在介绍If函数的使用方法时，任课教师可以通过提问学生“If”的英文意思来引入对这个函数的使用方法，针对这个函数的用法，给学生一张班级期末成绩表，然后，要求学生通过使用函数将期末成绩表中“及格”和“不及格”的学生分出来，引导学生积极动手操作，然后由教师组织学生根据要求来进行解答，最后由教师进行总结，并提出下一个内容的问题，这样子能很好解决学生在听课中出现开小差、只听讲不动手和学习没有积极性等情况。　　（三）竞赛教学法。在讲解PowerPoint演示文稿时，因学习了word文档的知识，学生所需掌握的新知识点就相对较少，所需学习的重点转移到了综合运用和个性设计能力上。经过分组竞赛的方法，要求每个小组独立完成一个作品的制作，完成后对各个作品进行统一的评讲和评价。通过这种授课方法，让学生不仅能更快地掌握新知识，并且能提高学生的学习积极性、学习的主动性和创造性，增强了学生的团队合作意识和人际交往能力。　　六、考核方式　　计算机应用基础的最终目的是让学生都学会能熟练使用并掌握计算机的一些基本知识和基本原理，所以最佳考试方式就是无纸化考试。对此，学校通过让学生参加南宁职业技术学院成人大专计算机水平考试的方式作为计算机应用基础课程的考核方式，通过这种方式来提高学生学习计算机应用能力的积极性。改革考试方式后，学生学习时更加注重动手能力，实践能力有了普遍的提高。　　七、结束语　　课程教学的改革关键在任课教师，它要求教师必须不断提高自身的教学水平，必须不断的加强理论只是的学习、改革教学的方法和优化考试的方式。计算机应用基础教学涉及到各方面的内容较多，需要任课教师不断地研究、探索新的教学方法和教学模式，激发学生学习该课程的兴趣，使学生不但掌握课本上的知识，还懂得使用office软件解决现实问题的能力，从而达到民办高校人才培养的目标。"}
