{"title": "小议高职学生计算机学习兴趣的培养", "url": "https://www.lunwendata.com/thesis/2019/153896.html", "time": ["2019-01-27"], "info": "　　有一个学者曾说：“任何科学研究，最重要的是看对于自己所从事的工作有没有兴趣，也就是说，有没有事业心，这不能有丝毫的强迫。学习兴趣指一个人对学习的一种积极性的认识倾向和情绪状态。兴趣可以推动人们去探索新的知识，发展新的能力，它带有感性色彩。”所以，在教学过程中，教师应该想方设法地调动学生的积极性，培养学生的兴趣，让每一个学生都主动参与，给学生以充分的学习空间，让学生主动参与到知识的形成过程中，激发学生的学习兴趣，提高学习的自觉性，从而达到事半功倍的教学效果。　　一、以“以人为本”的教学理念为指导　　“以人为本”的教学理念，要求教师尊重学生的课堂主体地位。在高职院校计算机教学的过程中，教师虽然尽职尽责并把计算机理论讲的有理有据，但是却枯燥无味，致使出现教师虽然很用心教学但是学生却存在严重的厌学心理的局面的产生。因此，教师要想教好计算机课，首先要对学生的学习心理进行转化，而最好的方法就是对学生的学习兴趣进行培养，使兴趣成为学生开启计算机科学的金钥匙。高职计算机教师在进行课堂教学的过程中，要把学生作为教学的出发点与最终归宿，并以自己积极乐观的态度对学生进行正面的影响。教师课堂上对学生的尊重与关怀，会使学生与教师之间的心理距离拉近，学生对教师产生好感，愿意上老师的课，进而喜欢上计算机课。同时教师以学生为课堂的主体，使学生有课堂主人翁的体验，学生会感到课堂是属于自己的，而学好计算机是自己的责任，学生产生了计算机学习的激情与欲望，从而使学生更好的进行计算机学习。　　二、以用促学，活学活用　　新课程强调要“加强课程内容与学生生活以及现代社会和科技发展的联系，关注学生的学习兴趣和经验”。在实际教学中，只有学有所用，学生才会学得认真；也只有学以致用，学生才学得深透。在学习Photoshop的案例教程时，笔者发现很多学生对图片处理比较感兴趣，想使用photoshop把照片处理得更加漂亮。笔者就把教材中的素材换成了学生的照片，把案例换成了《我和明星的合影》，让学生把自己的照片和喜欢的明星照片进行合成，达成学生和明星合影的愿望。此类的案例还有很多，比如让学生利用蒙板知识，做出像影楼里一样的婚纱照效果等。　　三、适当开展各种形式的学科知识竞赛，激发学生学习的积极性　　经常采取多种形式，开展一些学科知识竞赛，以竞赛为激励手段，可以使学生以不同于考试的形式，一方面系统掌握了该学科知识，另一方面也满足了学生的荣誉感和自我提高的需要，从而在一定程度上提高学习积极性，促进良好的学习风气的形成。比如开展网页设计大赛，不仅可以促进学生对网页设计软件的熟练掌握，同时还可提高学生的审美意识、创新意识以及集体合作意识等等。再如还可进行文字录入竞赛、图像处理竞赛、程序设计比赛等等。　　四、构建自主互动探究的课堂氛围　　新课程理念下的职业中学计算机教学，要积极倡导学生自主学习，积极探究。我们在教学中应当改变过去一贯的“填鸭式”的教学方法，平时上课时只传授课程的基本概念和经常用到的一些操作，以及遇到问题时解决问题的思路。教师在教学过程中，仅仅起到引导的作用，而把大量的时间留给学生自己去学习、思考、体会，培养学生在使用计算机的过程中遇到问题，能够自己通过该软件的帮助系统来解决问题的能力，教师用不多的时间演示令学生感兴趣的实例，激发他们的学习兴趣的同时让学生学会自己摸索，学习使用这个软件去完成实例。 营造民主、和谐、愉快的学习氛围，是新课改的一个重要理念，它是促进学生自主学习、自主探究的关键所在。因此我们在职业中学计算机教学过程中，必须创设和谐的教学情境，让课堂能够活起来，让学生也能够在和谐的氛围中体验到学习的乐趣。课堂上的师生合作、生生合作、平等讨论、相互补充的气氛极浓，给学生提供充分展示自己的机会。教师的平等参与不仅加大了师生间的亲和度，而且对学习重点有效地进行点拨和引导，增加了学生的学习深度和广度。　　五、注重上机操作实践，增强能力培养，保持浓厚兴趣　　计算机学科与其他学科的最大的不同类就在于其具有较强的实践性，因此，我们只有多上机，边实践边讲解，方能达到最好的效果。但目前我们许多学生喜欢上机，还仅仅局限于好玩这个层面上，有的甚至是玩点小游戏，这不仅不能保持兴趣，学到真本领，反而会降低学习热情，最终丧失学习兴趣。因此，在上机过程中要求教师要根据教学目标，合理地设置疑难 问题，让学生带着问题去上机、去思考、去探究，同时给学生充分的“主动发展”的空间，让其自己在上机过程中不断发现问题、解决问题，从而增强兴趣，掌握技能。如在讲解文件、文件夹的基本操作时， 教师可以先围绕教学目标出几道练习题，?学生带着问题操作预习， 然后教师再总结学生的学习情况。　　总之，在新的社会和时代背景下，高职院校要为社会培养符合社会需求的复合型人才，尤其是在现代社会已经进入信息时代的大环境下，要求这些人才必须具备基础计算机技术和知识。这就需要高职院校努力探索如何培养学生学习计算机的兴趣，积极提高学生的主动性和积极性，从而提高课堂教学质量，进而提高人才培养质量。"}
