{"title": "基于可扩展的计算机网络管理系统技术分析", "url": "https://www.lunwendata.com/thesis/2019/160545.html", "time": ["2019-07-31"], "info": "　　计算机网络技术与人们日常生产生活之间的关系日益密切。计算机网络不仅改变人们获取信息的方式，也实现了信息共享。虽然计算机网络技术日新月异，但是随着其发展，一些潜在的安全问题开始显现。这些问题严重影响了网络环境的建设，也阻碍了计算机网络管理水平的发展。因此，研究基于可扩展的计算机网络管理技术势在必行。　　一、计算机网络管理系统安全问题分析　　当前，计算机网路管理系统安全问题主要有以下几点：其一，网络本身问题。计算机与计算机之间的相互联系构成网络;计算机通过网络相互连接。这就意味着倘若某个计算机受到破坏，整体计算机管理系统就会受到或多或少的破坏，严重时，很有可能会造成系统崩溃。而且，一些企事业单位以及非事业单位在经营管理过程中忽视了对企业计算机网络的管理，从而导致一些管理问题的产生，如重要数据丢失且难以修复、商业机密被窃取等。其二，软件问题。计算机网络软件由程序、数据结构以及文档构成。而程序主要来源于编程，编程过程中难免会存在程序测试问题。而且，为了方便修改程序，编程人员一般都会在软件中设计“入口”。当“入口”被打开时，软件就会出现漏洞。其三，网络协议问题。网络协议是计算机网络稳定运行的重要保障。但是，由于部分计算机网络协议并不完善，所以软件内部的程序运行就会受到影响，从而影响整个管理系统的运行，导致出现数据传输错误等问题。其四，用户问题。多数计算机网络用户并不清楚自己的权限范围。因此，很容易发生越权操作，从而导致恶意操作以及数据丢失等问题。此外，用户安全配置不当也会造成权限问题的产生。其五，外部环境问题。极端天气会影响计算机网络管理系统的安全运行。此外，消极的计算机网络环境也会影响计算机管理系统的安全运行。　　二、基于可扩展的计算机网络管理系统技术分析　　1.防火墙技术　　所谓防火墙技术，就是一种在内网与外网、专网与公网之间建立屏障以保护内网、专网不受外界非法入侵的隔离屏障技术。在网络通信时，只有被允许的数据或者程序才可进入内网或者专网，不被允许的数据或者程序则会被拒绝。因此，应用防火墙技术可有效防止外界程序或者软件篡改、破坏以及复制内网或者专网的数据信息与程序。在应用防火墙技术建设基于网络安全的物联网实验室时，需要提供DHCP服务，给实验室的每台计算机动态配置内网地址。利用防火墙隔离实验室网络和学校的校园网，建设实验室局域网，保证只能使用实验室内部计算机访问校园网，保证只有实验室内部计算机才可访问实验室局域网。同时，在防火墙背后建设实验室内部服务器，并向校园网开放，保证校园网用户可通过校园网存取实验室资料。此外，只开放常用数据端口，以防止病毒的入侵;根据实验室需要，控制实验室局域网访问权限。　　2.身份认证技术　　所谓身份认证技术，就是一种认证计算机网络操作者所输入的数据信息是否与存入计算机网络的数据信息相一致的密码技术。当计算机网络操作者登录计算机网络管理系统时，只有其输入的数据信息与存入计算机网络的数据信息相一致，操作者才会被允许进入计算机网络管理系统。在应用身份认证技术建设基于网络安全的物联网实验室时，需要建设鉴别机制，以实现权限的分配。将系统结构分为系统管理员、教师以及学生三个模块，把每个模块对应的数据信息抽象出来，以供其他模块重复调用，從而提高系统的拓展性;确定每个模块的用户只能访问对应模块内的数据以及资源，确定三个模块都可通过在浏览器输入数据信息进入实验室管理系统。　　3.加密技术　　所谓加密技术，就是一种将数据信息与密钥结合使之成为不可解的数据信息、再用密钥对不可解的数据信息进行解密的密码技术。加密方法分为两种，一种是对称加密，另一种是不对称加密。对称加密指加密与解密使用相同的密钥;不对称加密指加密与解密使用不同的密钥。在应用加密技术建设基于网络安全的物联网实验室时，需要同时使用对称加密与不对称加密两种加密方法。实验室局域网对校园网用户开放，当用户被允许进入校园网时，用户可直接通过校园网查看实验室局域网覆盖下的、已经使用公有密钥加密的数据信息。此时，用户的校园网登陆密码为私有密钥。在用户分享数据信息时，使用密钥对其进行加密。只有知道密钥的其他用户才可获知此数据信息。　　4.Web服务器技术　　所谓Web服务器技术，就是基于环球信息网的提供网上信息查询服务的服务器技术。通过环球信息网，人们只需输入所需数据的关键词，就可获得与所需数据相关的大量数据信息。在应用Web服务器建设基于网络安全的物联网实验室，需要注意Web服务器的选择，充分考虑实验室系统的运行环境，根据实验室运行环境以及组网需求选择网络拓扑结构;根据计算机硬件环境选择合适的算机系统连接互联网并实现Web服务。将系统分为用户层、应用逻辑层以及数据库三层：用户层主要通过Web浏览器来实现;应用逻辑层建立B/S结构的网络应用;数据库层建立不同的接入方式，保障系统管理员、教师以及学生可采取不同的方式进入实验室系统。　　结语　　从上论述中可知，当前计算机网络安全问题主要包括网络本身问题、软件问题、网络协议问题、用户问题以及外部环境问题;基于可拓展的计算机网络管理系统分析主要包括防火墙技术、身份认证技术、加密技术以及Web服务器技术等。为了保护信息安全，创造良好网络环境，需要将计算机网络系统管理技术应用到实际当中，以解决计算机网络安全问题。现阶段，我国虽然在计算机领域取得了显著的进步，但是对计算机网络管理系统建设并不完善。建设计算机网络管理系统需要社会各界的共同努力，从而促进计算机网络的发展。本文的研究尚存在不足之处，还望各位予以指正。"}
