{"title": "基于高校计算机图形图像应用教学的研究", "url": "https://www.lunwendata.com/thesis/2019/156265.html", "time": ["2019-02-21"], "info": "　　中图分类号： TP391.41-4；G712 文献标识码： A 文章编号： 1673-1069（2016）35-133-2　　0 引言　　近年来，计算机技术的不断发展衍生出很多新兴技术，其中计算机图形图像技术就是主要的技术之一，计算机图形图像技术的出现，使得图形的处理和编辑工作变得格外简便，得到人们的高度重视，同时也使得计算机图形图像以课程的形式出现在高校中。然而由于我国计算机图形图像技术的发展时间较短，使得高校教学中还存在一系列的问题需要解决。因此，如何有效解决高校计算机图形图像课程存在的问题，成为相关教育工作人员需要完成的首要任务。本文就高校计算机图形图像课程存在的问题进行了深入的研究和分析，希望为相关教育工作人员提供一些建议和思路。　　1 计算机图形图像发展现状　　计算机图形图像技术主要包括计算机中相关图形的表示和处理两部分，这是计算机技术中的一项重要的操作技术，随着信息化时代的来临，计算机图形图像技术在人们生活和工作中的各个领域得到较为广泛的应用，这也成为了高校计算机专业重点教学内容之一。然而目前我国高校计算机图形图像应用教学效果不太理想，存在诸多的问题，这在一定程度上制约了高校计算机专业的发展，从而阻碍了计算机技术的进一步发展。因此，高校计算机图形图像应用教学的研究成为现阶段高校计算机教育工作者所面临的首要任务，只有对高校计算机图形图像应用教学中存在的问题进行科学、有效地处理，才能促进高校计算机专业的发展。　　2 高校计算机图形图像应用教学中存在的问题　　2.1 课程内容方面存在问题　　计算机图形图像课程涉及的内容较多，并且相关的软件操作较为复杂，学生很难在有限的时间内全部掌握。这就要求教师在教授内容时，要有选择性、有针对性地进行教学，让学生在有限的时间内掌握到最根本、最核心的东西。然而目前高校计算机教师在图形图像课程内容上没有进行针对性地选择和过滤，只是根据课本内容进行机械式的教授，这样就导致学生必须在有限的时间内掌握所有相关知识，极大地降低了学生的学习效率，对于图形图像教学的发展十分不利。　　2.2 教学手段过于传统　　目前，高校计算机专业图形图像课程的教学手段太过于传统化，依然采用传统的理论教学手段进行图形图像课程的教学，使得图形图像课程存在严重的问题。众所周知，计算机课程是一门注重操作的课程，单纯的理论知识的灌输是没有办法让学生理解和掌握相关要点的，并且图形图像课程是计算机课程中较为抽象的课程，更需要实际操作辅助教学。如果教师只是一味地灌输理论知识，不但会使学生难以理解和掌握相关的图形图像操作技能，还会导致一些有创新思维的学生得不到培养，从而被埋没。　　2.3 图形图像设计作品缺乏创新　　计算机图形图像课程要求学生利用相关的图形图像软件进行相关作品的设计，在设计作品时，不仅要求学生具备专业知识，更多的是创新思维的运用。然而，目前高校计算机图形图像课程教学缺乏实践，导致学生视野较低，没有很好的创新意识，只是一贯地按照教师的要求进行作品的设计，这对于学生创新意识的培养十分不利，同时也使得学生很难学好计算机图形图像这门课程。因此，高校计算机图形图像教学必须注重学生创新意识的培养，只有这样，才能培养出更加优秀的计算机人才，从而为社会创造更高的价值。　　2.4 图形图像相关软件操作不够灵活　　计算机图形图像技术涉及的软件相对较多，学生要想学好这门课程，必须熟练掌握这些软件并且操作灵活，这也是学好这门课程的最基本要求。如果学生对这些软件操作不够灵活，那就会使得图形图像设计时的效率严重降低。另外，有一部分学生在掌握一种软件操作后，很难将其应用到其他的作品设计上，缺少分析和知识运用的能力。总而言之，要想学好图形图像这门计算机课程，最重要的是必须能熟练运用相关的操作软件，这是学好这门课程的重要条件。　　2.5 缺少团队合作能力培养　　计算机图形图像课程的最终目的是培养图形图像专业设计人才，从而更好地服务于社会，而在这项技术的实际应用中会涉及团队合作，这就要求高校对图形图像课程教学中要注重学生团队意识的培养，从而提高学生之间的合作能力。然而目前高校计算机图形图像课程中缺少对学生团队合作能力的培养，有些学生只是追求自身的能力培养，忽视团队意识的培养，这些学生即便有很好的专业素养，在走出校门之后，由于缺少团队合作意识，也不会有很好的发展空间。由此可见，团队合作能力的培养对于计算机图形图像这门课程来说十分关键，无论学校还学生自身都要加以重视。　　3 高校计算机图形图像应用教学方法的研究　　3.1 激发学生的学习兴趣　　任何一门课程，最重要的前提就是对学生学习兴趣的培养，学生只有对这门课程有了兴趣，他们才能更好地对这门课程相关知识进行学习。因此，高校教师在教授图形图像这门课程时，要把激发学生的学习兴趣放在首位，例如，教师可以在第一次上课时，给学生展示出优秀的作品或者给学生播放相关的视频，从而激发学生对这门学科的兴趣，从而更好地学习这门课程。　　3.2 加强学生创新意识的培养　　创新意识的培养是学好图形图像这门课程的关键所在，只有拥有创新意识，才能在图形图像课程中设计出优秀的作品。因此，高校应当加强学生创新意识的培养。首先，教师要利用课堂时间给学生展示优秀的设计作品，开拓学生的视野，从而提高学生的创新思维能力。然而，课堂时间是有限的，教师还要以布置作业的方式，让学生观察生活中的案例，例如杂志的封面、饭店的站牌等，这些案例观察的多了，学生自然就有了创作灵感，这样就可以创新出优秀的作品。   　　3.3 重视实践教学　　相比于传统的理论教学，实践教学更能提高学生对专业知识的掌握，而且对于计算机图形图像这种重操作的课程，如果只是一味地采用理论教学，是不会有任何效果的。因此，高校必须重视图形图像课程的实践教学，从而提高学生的图形图像相关技能的掌握程度。但是需要注意一点，重视实践教学并不是完全避开理论教学，而是在理论教学的指导下进行实践教学，是理论教学和实践教学相结合，从而提高学生的专业素养，以达到高校专业人才培养的目的。　　3.4 培养学生的团队合作能力　　学生团队合作能力的培养对于学生日后的发展十分重要，因此必须加以重视。教师要在图形图像课程教材的基础上，增加模拟操作课程，并且让学生以小组为单位进行作品的设计，这不但培养了学生团队合作能力，对于培养学生的沟通能力也起到了重要的促进作用。　　4 结束语　　综上所述，计算机图形图像技术对高校计算机教学的发展具有重要的作用，必须给予高度的重视。由于计算机图形图像技术在我国发展时间较短，使得在高校教学应用中存在较多的问题。因此，高校相关教育工作者需要根据自身的实际情况，对图形图像教学工作中存在的问题进行分析和研究，探究出科学、有效的教学方法，从而提高高校图形图像课程的教学水平，为社会输送高素质的计算机人才，也为我国计算机事业的发展奠定坚实的基础。"}
