{"title": "计算机科学与技术专业应用型实践教学体系的构建与实施", "url": "https://www.lunwendata.com/thesis/2019/156430.html", "time": ["2019-02-23"], "info": "　　中图分类号：TP3 文献标识码：A 文章编号：1009-3044（2018）14-0131-02　　要想培养出实践性与应用性兼备的高素质复合型计算机专业人才，就必须要构建起一套完善的应用型实践教学体系作为教学活动开展的依据与指导。近些年来，随着应用型教育理念的提出与传播，计算机科学与技术专业也正在经历着一系列深刻的变化，而在这些变化中又以应用型教学实践活动的开展最为突出。　　1 构建计算机科学与技术专业实践教学体系的必要性　　正确的认识是正确的实践的基础和前提，我们只有充分认识到构建计算机科学与技术专业实践教学体系的必要性，才能切实体会到其重要作用与效用。　　（1）传统理论教学的不足与缺陷需要实践教学来弥补　　在传统计算机科学与技术专业的教学过程中，教师往往过分关注学生的理论掌握程度与计算机知识水平，而忽略了培养学生应用计算机知识解决实际问题的能力，导致学生在参加工作之后很难将在学校学到的知识灵活运用到实践中去，很容易出现学校学习与社会实践之间的断层现象。因此，实践性教学是对传统理论教学的必要补充，不仅能够培养学生的知识运用能力，还能够有效地将课堂与社会衔接起来，为学生在结束校园生活走向社会之后能够更好地满足社会需求而奠定良好的基础。我们应当认识到，在一个完整的计算机科学与技术教学活动中理论教学与实践教学之间的关系可以总结为：共同开展、交替进行、互为补充。　　（2）计算机科学与技术专业发展的大势所趋　　脱离实践的学习是不切实际的，是不可能具有长久生命力与强大竞争力的。在我国高等教育的改革浪潮之下，计算机科学与技术专业向着应用与实践方向转型已经成为大势所趋。其实践性主要由计算机科学与技术专业的专业定位所决定。计算机科学与技术专业的任务是为社会培养能够熟练地掌握计算机软硬件，能够灵活运用计算机知识解决实际问题的高级技术人才。由此可见，实践教学是计算机科学与技术专业教学活动的重点与中心，也是提升专业教学质量的必经之路与关键因素。　　2 构建应用型实践教学体系所必须坚持的原则　　提高计算机科学与技术专业实践性的关键在于构建起一套合理完善的应用型实践教学体系。此外，大量专家学者与高校教师的实践与研究已经证明，应用型实践体系的构建必须坚持以下几点原则。　　（1）以学生为主体，以社会需求为导向　　学生是教学活动的主体，是计算机科学与技术教学活动的最终目标，实践教学体系的构建必须紧紧围绕着学生成长与发展需求，以切实提升学生的动手操作能力与运用计算机知识解决实际问题的能力为最终目标。除此之外，实践教学体系的构建还必须以社会实际需求为导向，积极主动的将专业教学活动与社会行业结合起来，可以展开与计算机企业之间的信息沟通，实时接收行业需求信息，开展“走出校园，走进企业”活动，以培养能够适应企业一线岗位的专业人才为主要宗旨，构建专业应用型实践教学体系。　　（2）增强体系科学性与系统性　　任何一个完善的体系的内部都是具有很强的科学性的，其内部各部分之间相互配合，相互联系，共同发挥作用。同理，计算机科学与技术专业应用实践教学体系的构建必定要以科学性与系统性为首要前提。实践教学体系的科学性与系统主要表现为实践教学体系之中各个教学环节之间相互连接，实现和谐与统一；实践性教学贯穿整个计算机科学与技术专业教学活动的始终，并与理论性教学互相渗透，形成一个统一的教学整体。　　3 计算机科学与技术专业应用型实践教学体系的具体实施方略　　实践教学体系作为指导整个专业教学活动过程的中心机制，其教学设计必须丰富多样，能够适应不同教学阶段的多种需求。　　（1）注重课程实验的构建与开展　　在日常教学活动中，必须以课程实验作为实践教学体系的基本教学设计。课程实验，顾名思义，是在教学活动中组织学生自主操作计算机，利用计算机理论知识进行自主实验探索。课程实验作为学生理论与实际结合的第一步，是实践性教学的基本原则和首要前提。所以，作为计算机科学与技术专业相关教育工作者，在日常教学活动中必须将课程实验的课时比例增多，提升?n程实验成绩在学生总成绩中的占比，以此来提升学生对于课程实践重要性的认识和计算机理论知识的应用能力。　　（2）“产学研”有机结合，深入开展校企合作　　构建计算机科学与技术专业应用型实践教学体系的一个重要任务就是将企业实践项目引进教学活动，深入开展学校与企业之间的合作工作。目前，在整个高等教育界已经兴起了一股“产学研相结合”的浪潮，很多高校主动引进校外企业的实践项目，旨在引导学生在完成当下最具代表性的实践项目中来提升自身的思考能力与动手实践能力。　　引进企业实践项目的方式是多种多样的，例如，可以开展校企合作，一方面，学校可以承担企业的项目实践，帮助企业更好地进行计算机技术研究；另一方面，企业也可以承担对于人才实践性培养工作，促进实践性教学质量与效率的提升。除此之外，企业实践项目进校园还能够有效的解决计算机科学与技术专业课堂教学与社会所需严重脱节的问题，从而真正达到实践性教学体系构建的目的。　　（3）加大校外实习在实践教学体系中的比重　　在构建实践教学体系时必须注重校外实习的重要作用。在传统的计算机科学与技术专业教学活动中，受到传统教学理念的限制，校外实习活动的开展一直处于不受重视的状态，导致学生的实践应用能力提升程度不足。因此，我们在构建实践教学体系时，必须要注重加强校外实习的时效性，不能流于形式。　　例如，教师可以安排学生到校外的相关企业、各个实习基地以及各种科研机构进行一次较长时间的实习工作，建立起学生实习评价机制，引导学生对实习中的收获进行总结，使学生切实体验到将来所要面对的问题与挑战。　　由此可见，实践教学体系中必须建立起丰富的教学设计体系，以满足学生在不同学习阶段的实践需求，真正培养出实行社会现实的应用型计算机人才。　　4 结语　　计算机科学与技术专业肩负着为社会输送专业人才，支持我国计算机信息技术行业健康发展的重要任务。作为计算机专业相关教育工作者，我们必须认识到现有教学体制的缺陷与不足，认识到专业教学与社会需求之间的矛盾，认识到培养学生计算机知识实践能力的重要性，并应该结合自身教学与科研实际，积极探索出一条构建实践教学体系的道路，为培养高素质应用型实践教学人才而努力奋斗。"}
