{"title": "试析提高中学计算机教学的有效方法与途径", "url": "https://www.lunwendata.com/thesis/2019/156560.html", "time": ["2019-02-25"], "info": "　　中图分类号：G64 文献标识码：A 文章编号：1009-3044（2018）12-0150-02　　1 激发学生学习兴趣　　兴趣是最好的老师，在所有的学习中学习兴趣都是最重要的，中学计算机教学也不例外。而且中学生的自控力比较差，想要保证学生认真学习十分困难，但是中学生好奇心比较重，所以在实际的教学过程中利用学生的好奇心激发学生的学习兴趣就能够时刻吸引学生的注意力，保证学生认真学习。具体来说，中学计算机教师在实际的教学过程中可以根据具体的教学内容，结合学生的性格特点，将比较枯燥的计算机理论知识转化为有趣的动画流程，如：在幻灯片的制作教学中，教师可以利用多媒体技术播放教学视频，让学生了解幻灯片的制作流程，这样不仅能够吸引学生的注意力，让学生对幻灯片的制作产生兴趣，还能够改变以往纯理论的教学方式，让学生更加直观的了解幻灯片的制作过程，能够在一定程度上提升教学效果。除此之外，教师还可以利用多媒体技术，播放一些简单的程序设计、实现操作案例幻灯片，让学生欣赏被人制作的幻灯片，并且学习别人做得好的地方，以此提升学生学习的积极性和效果。　　另外，还可以通过增加计算机课程趣味性的方式激发学生的学习兴趣。中学计算机课程实践操作性较强，课程本身具有一定的趣味性，但是在实际教学过程中教师并没有将计算机课程的趣味性体现出来，甚至在一定程度上让计算机教学变得枯燥。从而导致学生对计算机课程的学习缺乏兴趣，甚至在一定程度上打击了学生的学习积极性。针对这一情况，中学计算机教师要采取有效措施提升计算机教学的趣味性。如：采用游戏教学法开展计算机教学，在中学计算机打字教学中，教师可以在打字练习中添加一些小游戏，常见的打字游戏有：金山打字中的青蛙过河游戏等。这些游戏能够将枯燥的打字练习过程变得有趣味性，这样不仅能够激发学生的打字兴趣，提升打字练习的教学，还能够在一定程度上创新教学方式，促进中学计算机教学的创新和发展。　　2 重视学生实践操作能力的培养　　计算机课程的实践操作性非常强，在中学计算机教学中实践教学非常重要。但是在实际的中学计算机教学中，很多教师都不重视计算机实践教学，甚至没有让学生到计算机机房进行学习，这样就无法落实计算机实践教学，学生不能掌握计算机操作技术，最终无法达成教学目标。因此，中学计算机教师要改变教学理念，认识到计算机实践教学的重要性，科学地进行课程设置，将理论教学与实践教学相结合。具体来说，中学计算机教师在实际教学时应该带领学生到计算机机房开展教学，为学生提供实践操作的机会。另外，在实际教学过程中教师不能一味的讲解理论知识，要在课堂上留一定的时间让学生进行时间实践操作。如：在Wrod的基础教学中，教师先向学生讲解怎样打开Wrod，怎样调整字体、字号、字体颜色以及段落设置等基础知识。然后让学生在自己的计算机上面打开Wrod根据教师刚才的讲解执行相应操作。这样能够让学生通过实践操作轻松地掌握相关理论知识，同时还能够十分有效的锻炼学生的实践操作能力。　　在中学计算机教学中除了要教师要重视计算机实践操作外，学生也要认识到计算机操作的重要性。现阶段，在中学计算机教学中很多中学生都认为计算机实践操作没有什么用，大部分学生认为计算机最大的作用就是大网络游戏，这是一种非常错误的认识，不仅会影响学生的计算机课程学习，还会在一定程度上影响学生的健康成长。因此，中学计算机教师要加强与学生的沟通，让学生认识到计算机学习的目的以及作用，同时让学生认识到实践操作的重要性。中学计算机教师可以在实际中向学生介绍编程技术等计算机技术，拓展学生的对计算机的认识，从而让学端正学习态度。　　3 采用多样化的教学方式进行教学　　在中学计算机教学中教师应该根据具体的教学内容，结合学生的实际学习情况创新教学方式，采用多样化的方式进行教学，以此提升计算机教学的有效性。如：采用分组教学方式进行教学，具体来说就是在实际的教学中将学生分成若干个小组，让学生以小组为单位完成教学任务，这样能够培养学生的合作能力，同时还能活跃课堂气氛，从而提升计算机教学的有效性。教师在分组的过程中，不能盲目地对学生进行分组，根据学生的实际学习情况以及计算机操作能力进行合理的分组，在分配任务时让小组内的每一个同学各负责一个小任务，这样就兼顾了学生之间的差异性，能够满足不同学生的学习需求。　　举例来说：在计算机网页制作课程教学中，教师按照学生的学习能力将学生分为若干个小组，3人为一组。3名小组成员中包括：学习能力较强能够对计算机课程进行深入探究的学生；学习能力一般能够按照教师要去完成学习任务的学生以及学习能力较差，无法跟上教学进度的学生。分组完成之后，教师向大家布置任务，要求学生根据所学知识模仿优秀的网站完成网页制作，小组中学习能力较差的学生负责收集资料，通过网络寻找优秀网站作为模板；其中学习能力一般的同学根据所学知识完成网页架构；学习能力较强的学生细化网页内容并且对网页构架进行优化。学生在完成任务的过程中教师要在一旁指导，及时解答学生问题，帮助学生完成网页制作。这样的教学方式能够让学生在合作中锻炼自己的实践操作能力，并且通过合作的方式取长补短，从而提升教学效果。　　4 对学生的学习成果进行科学评价　　在中学计算机教学中对学生的学习成果进行评价非常重要，另外科学的学习评价还能够在一定程度上提升学生的学习积极性。在以往的中学计算机教学中通常采用考试的方式对学生的学习成果进行评价，而考试通常都是以试卷的方式进行，这样只能考查学生对计算机理论知识的掌握，无法评价学生的计算机实践操作能力。另外，中学计算机教师在采用试卷评价的方式对学生的学习成果进行评价时，没有根据学生的实际情况设置试卷，这就会在一定程度上影响试卷的科学性和合理性，从而影响评价结果。而且，试卷评价的方式会在一定程度上增加了中学计算机教师的工作量，因为教师需要批改试卷。　　因此，是中学计算机教师必须改变传统考试评价方式，采用计算机上机实践方式对学生的学习成果评价。这就需要中学计算机教师根据教学内容、教学目标以及学生的实际学习情况设置上机内容。如：让学生制作一个幻灯片、让学生按照要求调整Word格式等。这样的评价方式能够直接考察学生对计算机知识的掌握情况，同时还能够了解学生的实践操作能力。总之，科学的评价方式能够让教师掌握学生的学习情况，并且根据学生的实际学习情况对教学方式以及教学内容进行适当的调整，以此提升中学计算机教学质量。　　5 总结　　综上所述，随着计算机技术的不断发展，计算课程在中学教学中越来越受重视，如何提升计算机教学效果已经成为初中教学中研究的重点。本文从激发学生学习兴趣；重视学生实践操作能力的培养；采用多样化的教学方式进行教学以及对学生的教学成果进行科学评价等四个方面研究了提高中学计算机教学的有效方法与途径，希望通过以上分析能够有效地提升中学计算机教学水平，让学生更好地掌握计算机知识。"}
