{"title": "探析计算机辅助教学的常见方法", "url": "https://www.lunwendata.com/thesis/2019/155830.html", "time": ["2019-02-17"], "info": " 　　摘要：自从进入21世纪以来，计算机无论是在人们的生活上还是工作上都得到了越来越广泛的应用，而且为了满足当代课堂教学的改革的需求，计算机辅助教学逐渐也逐渐走进各大高校。然而大家需要辩证地看待计算机在教学中的应用，因为计算机辅助教学就犹如一把双刃剑，只有教师把握得好，教学效率才能够提升到更高水平，一旦计算机在教学中得不到很好的利用，就会导致资源的大量浪费。笔者通过结合自身多年的教学经验，针对当前各大高校在利用计算机进行辅助教学时出现的问题，阐述了几点建议，并且对如何利用好计算机辅助教学这把双刃剑进行了探讨。　　关键词：计算机；辅助教学；优势；问题；方法　　中图分类号：TP39 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-02　　一、引言　　随着科学技术的高速发展，以及教育部提供给高校的资金的提升，并且为了满足当代课堂教学的改革的需求，计算机辅助教学在各大高校应用的应用越来越广泛。然而大家需要辩证地看待计算机在教学中的应用，因为计算机辅助教学就犹如一把双刃剑，只有教师把握得好，教学效率才能够提升到更高水平，一旦计算机在教学中得不到很好的利用，就会导致资源的大量浪费。笔者通过结合自身多年的教学经验，针对当前各大高校在利用计算机进行辅助教学时出现的问题，阐述了几点建议，并且对如何利用好计算机辅助教学这把双刃剑进行了探讨。　　二、计算机辅助教学的具体优势　　与传统的黑板粉笔的教学模式相比，计算机辅助教学具有以下几点优势。　　（一）图文并茂，生动逼真　　计算机可以将普通的粉笔无法描绘出的图画、动画、声音等在课堂上为学生们生动逼真地表现出来，无论是在视觉上还是在听觉上都给予学生们一个全新的展示。通过设置链接、快捷键等，教师可以将课本上无法表达出的演绎以及推算过程形象地展示给学生，这样很大程度地加深了授课内容在学生脑海中的印象，有利于学生们更加容易地接受和领会教师的教学内容。　　（二）充分调动学生们上课的兴趣和注意力　　兴趣是学生们学习最好的老师。有了学习的兴趣，学生就可以在学习中变被动为主动，积极主动地去学习新知识，去发现并想办法解决学习中遇到的新问题，教师不用再以填鸭式的教学方式督促学生们被迫地接受知识。计算机将课本上的死板知识通过生动的图像，动听的音频以及活泼的动画表现出来，课堂上学生们学习的过程仿佛变成了看电影一般享受，因此在计算机的帮助之下，学生们学习的兴趣就会油然而生，而且也慢慢地养成自主学习的好习惯。而且计算机辅助教学也使那些在课堂上只要一听到老师以同一个频率读课本就容易瞌睡的学生和那些只要一看课本就头疼的学生，以及那些上课注意力无法集中，不是看小说就是传纸条或者睡觉的学生渐渐地很少出现。　　（三）节省教师时间　　计算机辅助教学很大程度地节省了教师们的教学时间。有了计算机多媒体这个大帮手，语文教师不用再在黑板上逐字逐句地写板书，数学老师不用再一遍遍地演绎结论的推算过程，生物老师也不用再费神费力地在黑板上画出细胞结构等。同时，教师们在学术交流会上交流起教学方法来也更加方便、生动。教师们利用节省下来的时间可以解决学生们在课上或是刻下遇到的问题，或者是更深入地批改学生们的作业，学习与教学相关的更前沿、更专业的知识，以期提高自身的教学水平，也可以腾出时间来设计适合自己学生的教学课件。而且，有了多媒体，老师们可以少“吃”很多粉笔灰，从而使教师们的职业病相比以往也减轻了不少。可以说，计算机辅助教学在一定程度上给课堂上的传统教师们带来了福音。　　三、计算机辅助教学中存在的主要问题　　尽管，综上可知计算机辅助教学的优势不胜可数，但是到目前为止，其仍然存在着一些不容小觑的问题亟待改善。　　（一）忽略学生的主体性，成为“机灌”　　有了计算机多媒体的帮助，教师不再局限于整节课站在讲台上讲解课本知识，而是可以简单地移动鼠标就可以完成教学任务。但是从目前计算机辅助教学的情况来看，很多教师在讲课时只是一味地播放教学课件，不仅忽略了学生们对教学内容的接受能力，而且忽视了和学生之间进行积极的互动。而且如果教学课件播放速度过快的话，学生们就不能够及时地记下课堂笔记，对课件中的知识点只是一扫而过。俗话说，好记性不如烂笔头。长时间下来，学生记录下来的只是残缺的知识点，有很多重要、关键的内容都没有得到及时的记录。不但如此，学生们观看课件时的记忆也渐渐地变模糊，导致学生的考试成绩直线下降。另外，在课堂上，很多教师仅仅变身成为多媒体的播放者，教师和学生们之间缺乏必要的互动，教学模式由往日的“人灌”变为今日高科技下的“机灌”。　　（二）课件不够简约，附加效果太多　　为了使教学课件变得更为生动形象，许多课件制作者在课件里添加了许多效果，比如在文字弹出时添加各种声音，以及弹跳、缩放、浮动、飞旋等特殊效果；或者是在课件的配色方案上过于华丽，导致重点文字颜色不够突出；除此之外，很多课件还存在排版不合理等问题。这些额外多余的特殊效果，使得教学课件的主次重点区别不够明显，而且过多的课件设计效果还会分散学生们的注意力，使他们将注意力过多地集中在这些特殊效果上，而不是应该掌握领会的知识点上。长此已久，学生们对知识的掌握力度还是难以得到应有的提高。　　（三）使用购买课件　　自从计算机辅助教学得到各大高校的广泛认可并投入使用之后，很多商家看准了这个新的商机，使得市面上涌现出了大量的各式各样的教学课件。有些教师为了贪图便利，或者是不能根据自己学生的特点以及自己的学科结构制作属于自己授课的专门课件，而是随意购买市面上的课件。购买来的这些课件往往比较粗糙，而且还存在着一些其他比较明显的问题，比如：第一，随意性很强，没有结合学生们具体的特点；第二，课件的内容结构框架不够完善，知识点堆砌性较强，并且实用性较差；第三，不够生动逼真，或者一味追求生动，图文并茂，而导致知识点主次不够突出，导致学生接受起来较难。   　　四、针对计算机辅助教学的缺陷提出的改善措施　　教师应针对自己的教学课件中存在的缺陷，及时进行改正和调整，从而使教学效果达到更高水平。以下将详细地探讨如何利用好计算机辅助教学这把双刃剑，使其能够更好地为教师和学生们服务。　　（一）教师在计算机辅助教学中应加强和学生间的互动　　某些教师在利用计算机多媒体进行教学时比较容易犯忽略学生的主体作用的错误，没有在讲解知识的过程中及时与学生们进行必要的互动，以能了解学生们接受知识的程度，从而不可避免地导致了课堂教学效率的降低。作为一名合格的教师，应当明白，自己肩负着教育后代的重要责任，在有了计算机这个高科技产品的帮助之下，应该充分结合计算机辅助教学的种种优势，积极调动学生们的学习的积极性，让学生真正参与到教学中来，让学生真正学到知识。利用计算机表达知识点生动逼真的特点，使学生们对知识点的记忆更加深刻和牢固。教师在教学中不应只是简单地点击鼠标、播放课件，而应该适时地提出一些问题，将课本和课件进行有机的结合，使课堂教学效率达到最高。除此之外，教师还应根据学生们的接受能力，以适宜的速度播放幻灯片，让学生们能够记下关键性的课堂笔记，并留出适当的空余时间，使学生们能够自己思考和消化课堂内容，并且教师也可以利用这些空余时间为学生们解疑答难。而且教师甚至可以通过一定的输入设备，使学生和计算机进行互动。　　（二）简洁化课件　　为了避免过多的动画、图片、颜色以及声音等附加效果分散学生们的注意力，教师应适当地将课件进行适当的简洁化。做到课件主次突出，字体大小与线条粗细合适，颜色配置柔和等。以上措施不仅可以起到使课件生动、有趣，带动学生们上课的兴趣的作用，还有利于学生们将注意力将更多的注意力放到课件本身上，强化学生们对知识点的吸收。　　（三）制作适合自己学生的课件　　在高科技迅猛发展的今天，教师最好能够自己参加培训班，学习计算机软件、编程等，从而可以自主制作适合自己学生课件。教师之于学生，犹如家长之于孩子，只有教师才最了解自己的学生，所以也只有自己的老师才能制作出最适合自己学生的课件。购买的课件兼顾大片地区的学生，形式过于单一化，知识点涵盖过多，不适合具体使用。所以，教师应当参加计算机培训，或是在教师之间的交流会上请教其他教师，以期能够提高自身利用计算机进行教学的水平。在制作课件时，教师可以融入自己的创造力，根据自己对学生接受知识点的了解，为学生们量身定做，制作出最适合自己学生的课件。　　五、总结　　综上可知，计算机辅助教学无疑是一种方便、快捷而且有效的教学方法。但是，它也犹如一把双刃剑，每位教师在应用计算机进行教学的过程中都应当取其精华，充分利用和挖掘计算机辅助教学的优势，教好学生，完成国家赋予自己的神圣使命。　　参考文献：　　[1]缪亮,付邦道.多媒体课件制作使用教程[M].北京:清华大学出版社,2008,3　　[2]任燕.浅谈师范类院校《计算机辅助教学技术》课程的教学改革[J].遵义师范学院院报,2008,10(1)　　[3]殷锋社.个性化计算机辅助教学系统研究与实现[J].电子设计工程,2010,(9)　　[4]孙中红.个性化智能网络教学系统中学生模型的研究[J].中国电化教育,2009,(10)　　[5]卫小伟．基于ＲＤＦＳ的教学资源库的分析与设计[J].现代电子技术,2009,(19) "}
