{"title": "计算机多媒体辅助教学", "url": "https://www.lunwendata.com/thesis/2019/159112.html", "time": ["2019-03-25"], "info": "　　媒体（Media），信息科技发展的产物，是承载科技信息实现人与人之间交互信息的媒介。多媒体（Multimedia），就是结合了两种或两种以上媒体的人机交互式的综合媒体技术，是数字化时代下视频技术和计算机结合发展的产物；它通过硬件和软件的组合，依靠先进的数字技术，可以把文字、图像、图形、声音、动画等一切用户需要的信息生动地展示出来。多媒体辅助教学，就是通过计算机多媒体，把以多媒体、智能化、网络化为特征的信息技术，加入到教学系统中，结合传统教学方法，实现声情并茂的全新教学模式。　　传统教学模式的利弊。“学-思-习-行”是中国的传统教学模式，它由以孔子为代表的儒家学派提出。传统的教学模式讲求“讲授-接受”主旨，以教师和教材为中心，通过教师口头传授、板书，学生耳听、笔记完成教学工作。不可否认，传统教学模式是中国几千年文化和智慧的结晶，是古人遗留给我们的宝贵经验和财富。在这种教学模式下，教师能够轻松地通过学生学生在课堂的表现，了解到学生对所学知识通透程度，从而“因地制宜”调整教学方法，以达到预期的教学目的。然而，在知识信息多元化的今天，学生仅仅只学习课本上的知识已不满足当今社会日益激烈的竞争要求，传统的教学模式开始出现疲软状态。传统的教学模式以教师为绝对主导地位，教师的言传身教在知识的传授过程中起着不可替代的作用。但是正是由于这一特性，教师的一切都深深的影响着学生；本身的自我修养、教学水平甚至是生活习惯都能够影响着学生的品性。不同的教师，教学的效果也大相径庭，这极易导致学生出现两极分化。而古板的教学也容易使学生厌烦，产生抵抗情绪，这也能间接导致学生青春期叛逆行为的滋生。计算机多媒体技术应用于教学是科技发展的必然。在信息时代，信息和知识飞速发展的脚步已经不可阻挡，现代的教学已经不是一本课本就能解决的，传统的文字交流已经被飞速的语言交流所替代。只有与时俱进，才能更上时代发展的步伐，这就要求必须改变观念、不断学习，才能满足社会对新时代学生的要求。多媒体技术的渗入，正好可以拓展学生学习的知识面，开阔学生眼界，这打破了原有的传统教学理念，使现代教学真正的具有了时代气息，把教育事业推向了一个新的高度。计算机多媒体技术在教学中的作用。计算机多媒体技术因它特有的性质，在教学中发挥出了不可或缺的作用。主要体现在以下几个方面：1.多种器官的共同参与，激发学生学习兴趣。兴趣是认识和了解新事物最大的动力和最好的老师，而学生学习的兴趣大多来自于自己感官接收到的信息。传统的教学模式下，有些教师因循守旧，甚至是照本宣科的教学方法并不少见，这造成了课堂过于死气，导致学生反感老师，以至于抵触学习。多媒体技术因其自身千变万化、富有动感的特性，可以用声音、图像、动画等学生乐于接受的形式代替繁琐古板的教学内容，用声像并茂的方式带动学生的耳、眼、鼻、手、脑的活动，把学生的积极性充分的调动起来，使得原本枯燥乏味的教学课堂变成生机盎然、充满活力的知识海洋，以富有感染力和表现力的形式给学生传递多渠道的信息，从而让学生产生自主想象力，营造了良好的学习氛围，激发了学生自主学习的兴趣，最终达到事半功倍的教学效果。2.多元化的信息知识，开阔学生眼界。传统的教学模式下，一本书就是所有，学生的全部所得都来源于课本和老师，通过其他途径获得的知识信息少之又少，这限制了学生本身的发展，学生未免有点井底之蛙之嫌。在多媒体辅助教学的全新教学模式下，学生不仅可以全部吸收教师在教学课件中对于教学课本的总结，还可以利用多媒体强大的交互性和计算机的网络功能，在原有的知识层面上进行拓展，接触到自己不曾接触过的新鲜事物，着实开阔了学生的眼界，不用“行万里路”，便可轻松获得超过“读万卷书”的效果。3.形象化重点难点，提高教学效率。每个学科总有相对比较抽象的内容，而传统教学手段往往在解决此类内容的时候显得有所局限，这就是所谓的难点重点。而重点难点是学生在学习过程中必须了解掌握的。鉴于传统教学手段的局限性，计算机多媒体运用自身的优势，通过视觉反馈和听觉反馈，把抽象的重点难点问题形象化，使某些抽象的概念通过图文并茂的方式具体化，使问题直观、动态的展示出来，利用这一特性可以解决其他教学过程中出现的重点难点问题，大大提高了课堂的教学效率。这在某种程度上弥补了传统教学手段在解决重点难点问题上的不足。多媒体辅助教学的局限。教学是一种对新事物认知的过程，现代教学模式是在传统教学模式下融入新的教学理念。多媒体辅助教学是运用计算机强大的处理能力，以及多媒体技术超强的交互性来模拟和完成教师的的某些教学行为。计算机多媒体辅助教学不局限于传统教学课本，也不受限于时间和空间。但是，计算机多媒体辅助教育作为一种教学手段，在教学系统中，它仅仅是起到辅助教学的作用，并不能取代传统教学体系中教师或者学生的角色，因为教学是教师的言传身教和学生自主学习的整合，必须有师生双方的共同参与才能实现的过程。教学过程中，只有及时了解到学生的学习状态和进度，教师才能因材施教，而这一点恰好是计算机所欠缺的。计算机辅助教学缺乏多样性和灵活性，在处理教学中的偶然性事件方面显得极为不得力。　　展望多媒体辅助教学的未来――上世纪80年代，我国的计算机教育应用完成了从程序设计教学向计算机辅助教学的转变，开始了让计算机真正走向课堂、面向学生的脚步。随着多媒体和网络技术的不断发展，中国的教育教学模式向着网络化、社会化、多媒体化发展成为了必然趋势，只要实现了网络化和多媒体化这一关键步伐，中国的教育事业将会迈向一个全新的高度。"}
