{"title": "计算机课程项目化教学模式浅探", "url": "https://www.lunwendata.com/thesis/2019/155542.html", "time": ["2019-02-14"], "info": "　　所谓的项目化教学，又可被称为项目教学法，其所指代的是教师在授课过程中将学科知识紧密结合实践应用，将知识内容通过项目实践转化成一个实际的项目，并和学生一起参与完成整个项目的落实，这是一种以行动为导向的教学模式。就现阶段国内高校计算机教学中实际的项目化教学经验来看，主要包括在数据库原理及应用、信息管理系统、数据结构等课程中运用项目教学法，而这些不仅能改变传统教学的枯燥无味，更能提高学生的实际操作能力以及解决问题能力。　　一、计算机课程采用项目化教学的必要性分析　　?τ诟咝＜扑慊?专业课程而言，大部分课程都会与计算机软件紧密结合，而这些软件多为应用型软件，学生只有充分理解并熟练掌握才能算是真正意义上掌握了。特别的，一些复杂的计算机软件，功能非常多样化，软件内部知识点零散繁多，学生如果仅凭课本知识而缺少实际操作，就没法深入理解，易于流于表面。　　在项目化教学模式中，学生通过实际操作各类计算机软件，通过摸索解决项目实际问题，就能够在潜移默化中形成真正属于自己的计算机操作能力。因此，在计算机课程教学中，采用项目化教学模式是具有其必要性的，因为项目化教学是提升学生解决问题的重要途径。在项目设计、项目制作、项目问题解决等过程中，通过学生和教师的配合、学生自己的摸索与研究，学生不仅能够提高项目实践能力，也将学会团队合作等宝贵的经验。[1]　　二、计算机课堂中项目化教学的具体实施介绍　　对于高校计算机专业的实际教学而言，在课堂教学中落实项目化角落可以从以下四个实施要点出发：　　1.课题讲解。课题讲解的中心要旨在于向学生揭示教学目标，因为教学目标是项目教学最根本的出发点，是设计项目的思路起点。对于教师来说，在授课初期，通过课题讲解明示教学目标能够更好地控制教学方向，具有指导教学策略选择、指导教学评价与测量、指导学生学习等定向功能。项目的课题是整个项目教学的核心所在，教师想让学生通过项目实践学习计算机知识，就必须事先让学生了解通过参与这个项目究竟是要掌握哪些知识，实现哪些教学目标，这样学生学习起来也更有动力，能够在学习中带着目标，带着问题出发，保持足够的主观能动性。另一方面，教师在向学生讲解课题的时候，也应当善于进行项目分块，使学生循序渐进、有条不紊地掌握教学目标。　　2.演示示例。通过项目演示示例，能够给予学生直观化的项目介绍，从而进一步激发学生对参与项目的兴趣。俗话说，兴趣是学生最好的老师，学生只有直观化地了解了项目，心中产生了兴趣，才能够积极参与项目活动，最终达到事半功倍的效果。[2]项目教学法需要对演示示例来导入项目，作为激发学生学习兴趣的切入点，调动学生操作项目的积极性，在教师进行示例演示的过程中，学生会对其中的真理和疑问充满好奇，在思考的过程中情绪高涨，从而产生强烈的求知欲和学习兴趣。　　3.精讲多练。为了更好地落实计算机项目化教学，教师在授课过程中必须要坚持做到精讲多练，充分向学生辅导和演示。按照实际操作步骤来说，项目教学法课堂应遵循“讲解-演示-练习-答疑-总结”的步骤，教师合理地将知识难点、知识重点以及操作要点结合在一起讲解，才能够使学生透彻理解计算机操作。而从课堂时间安排来看，教师在课堂上也应当充分留出时间让学生能够自己动手操作，并让学生在操作中提出问题，学生通过问题往往能够更加深刻地理解知识点，掌握更多的项目实践经验。另一方面，现在多媒体教学技术这么发达，教师在向学生进行讲解的时候，也应当充分借鉴多媒体技术，从而加深学生对于操作的印象。　　三、关于项目化教学在计算机课程中应用的反思　　相较于传统化的教学方式而言，计算机项目化教学是一种较为新颖的教学模式，能够通过项目实施进一步调控学生参与课堂的积极性，从而使得学生通过项目实施提高其动手实践的能力，更加充分地了解计算机知识，提升其专业化程度。[3]当然，在计算机专业实际项目化教学的过程中，也会出现各种各样的问题，比如由于学生群体水平不一而导致项目难度的设计无法适应全部学生，而本文认为尽管项目化教学的彻底落实有很多要求，但是只要计算机项目化教学中能够牢牢把握住如下三点特征，就能够达到质量较好的教学目标：　　第一，探索性。从教学根本宗旨而言，计算机教学中提出项目的根本性目的在于解决项目问题，完成项目探索过程，最终学会实际操作实践中的各项必要技能。因此，计算机课程中在应用项目化教学的过程中，必须非常重视探索性，如果不借助探索作为主要手段，那么学生群体本身是无法将书本知识深刻化，提升自身的操作能力的，因此探索性可谓是项目化教学的主要特征。　　第二，实践性。实践所强调的是学生自己的动手操作过程，无论计算机课堂中提出了各种具体项目，只要学生没有实践操作的过程，那么一切都会沦为空话，教学的目的根本无法达到，教师提出项目的意义也就不复存在。因此，在计算机项目化教学中，必须将实践性放在重要的地位，必须要充分调动起学生参与项目时的积极性，使得学生通过亲身的体验与实践解决项目所存在问题，而且在这一过程中，学生与教师群体也都可能获得出乎意料之外的知识体验与知识收获。　　第三，合作性。对于现今社会而言，想要成功地完成一项项目，那么团队间的合作是必不可少的，而计算机技术类项目更是需要不同角色之间的相互合作，信息的相互渗透与沟通。在高校计算机课堂中，教师所提出的项目也应当适当地加入合作的必要因素，这种模式下学生与学生，以及学生与教师之间都能够达成一定的合作，最终实现一加一大于二的模式。"}
