{"title": "中学计算机教育的互动式培养分析", "url": "https://www.lunwendata.com/thesis/2019/155836.html", "time": ["2019-02-17"], "info": " 　　摘要：计算机教育目前已经在我国大部分地区的中学教学内容中得到普及，为了使学生们更好的适应这一信息时代的发展，更早掌握相关的计算机基础知识，计算机课程已经成为学生在中学阶段必不可少的一门课程。而如何提高计算机教学水平，从而为学生打下良好的计算机基础，并在将来的深入学习中更加容易、迅速的理解老师的授课内容，具有不可忽视的意义。本文从目前计算机教育的现状出发，论述在计算机教学中存在的一些弊端，并着重阐述互动式培养的含义和主要方式方法，以及在计算机教育中具有的优势和取得的显著成效。　　关键词：中学计算机；教学；互动式培养　　中图分类号：G642 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-02　　随着我国信息化时代的到来，全国各行各业的发展都逐渐与计算机接轨，我国计算机领域在广阔的社会需求面前呈现出巨大的人才缺口。为此，我国教育部门必须加大力度加强计算人才的培养工作，从基础抓起，将计算机这门学科的人才培养计划提到议事日程上来。　　中学阶段，是每一个学生积累多种学科的基础阶段，也是素质教育初现成效的时期。这一时期学生对于各个学科形成的基础对于日后各个学科的深入学习有着至关重要的影响。如果在这一时期，学生对计算机教育没有产生一定的学习兴趣或者在学习过程中遇到某些困难而没有得到及时解决，那么对于日后的计算机学习将会产生反作用，使学生无法全面的掌握相关的知识技能，从而对学生日后的工作状况造成一定影响。下面本文将对计算机教育的现状和一些亟待解决的问题进行相关论述，并对互动式教学方法给予一定阐述，希望对于计算机教学工作者能够起到参考作用。　　一、计算机教育的现状　　（一）教学力度不够　　对于许多中学来说，计算机教学在众多主要学科之中并不占有主要地位。由于初中、高中都是学生学习的关键阶段，许多老师和家长都认为，这一学科并没有实际意义，学生在中考、高考中并没有应用到，所以，计算机教学工作并没有被认真的执行。在这种情况下，学生纵使有再大的兴趣，没有老师的认真指导和家长的大力支持，这项工作也是难以积极开展下去的。　　（二）教学方式不合理　　许多计算机教师，在执行中学计算机教学任务时，并没有将学生的兴趣引导进来，而是采用说教式的方法，告诉同学们每一个步骤、每一个按键的用途、功能。这样的教学方式，难免会受到学生的冷淡，使学生失去主动学习的兴趣。　　（三）教学内容单调过时，无实际应用价值　　目前许多计算机的教科书还采用十年以前的版本，虽然有些经过再版，但是改动并不大。由于计算机是一门心性的、更新发展非常快速的学科，计算机的实际操作软件也在非常短的时间内发生着天翻地覆的变化。重复不变的教学内容，必然会落后于时代的大潮，这样的知识教给学生们又有什么意义呢？　　（四）教学目标不明确　　对于计算机这一学科，许多人不明白其教学的根本目的，简单的认为其作用主要是一种方便人们工作的手段。在实际的教学过程中，许多教师并没有针对时下社会对于计算机的一些负面评价给予学生一些正确的引导，使许多学生并没有真正了解计算机的实际意义，而简单的把计算机当作一种时尚的聊天工具和娱乐工具。　　二、互动式培养的内涵　　互动式教学模式是指以现代教学理念为指导，从满足学生对计算机知识的需求和市场经济条件下社会对计算机人才的大规模缺乏两个主要方面出发，促进教师自身计算机知识水平和教学水平的双重提高，通过对教师、学生和社会发展全方位的促进和相互沟通来达到提升教学效果的最终目的。　　在互动式培养模式中，教学主体从教师转变为教师和学生相结合的形式，通过加强每一位成员的参与意识，积极发挥学生的主导作用，反过来与教师达到互动的教学效果，从而使计算机教学开展的更加轻松和高效。　　三、互动式培养的主要措施　　（一）明确教学目标，加强教育改革力度　　首先，在计算机教学的第一课，老师应该为学生们详细讲解计算机的主要用途以及学习这一学科的实际意义。使学生明白，这一学科在自身的发展中和对社会的发展所起的重要作用，从而使同学们认真对待这一学科，而不是将这一课程当作做游戏的课程或者是休息的课程。学校应该将计算机教学的改革精神全面贯彻下去，使教师主动创新教学模式，丰富自己计算机知识储备，提高自身教学水平。　　（二）改善教学模式，重视学生兴趣培养　　教师在教学过程中，应该逐渐转变角色，改变以往那种以自身为核心的教学模式，使学生成为教学的主体，通过各种生动的教学方法来调动学生积极学习计算机知识的强烈兴趣，使每一名同学都积极参与到关于计算机问题的探讨中来。通过加强学生对于一些简单的编程、网页制作等的实践技能的操作，提高学生的动手能力，可以在很大程度上提高学生的学习兴趣。从长远来看，这也是未来对教师改善教学方法、提高教学水平的综合要求。　　（三）不断更新教学内容，使学生接触最新的计算机知识　　中学计算机教学，并不应该简单的定义为基础教学，计算机基础虽然是必学的，但是如果初中就开始学习计算机基础，到高中，仍然是侧重基础的教学，除了浪费了教学资源外，还在一定程度上阻碍了学生学习计算机的进程。学校应该合理安排教学内容，对于一些没有实际意义的知识，应该予以适当删减，提高教学内容的实用性和可操作性，避免一些没用的知识占用教学资源，浪费人力、物力。　　（四）加强互动教学，提高学生的主动思考能力　　教师在教学过程中，针对学生普遍不懂的问题，应该给予细致的讲解，并联系生活实际使学生能够更透彻的理解每一个问题。兴趣培养在计算机教学中非常重要，因为计算机其实是一门比较枯燥的课程，是需要学生具有很强的逻辑思维能力才能完全理解这些教学内容的，所以教师在和同学们一起学习的过程中，应该不断的提出一些难度恰当的问题，促使学生们去主动思考，从而实现互动式教学。　　四、互动式教学的优势　　（一）可以提高学生的动脑思考能力   　　互动式教学要求教师在教学过程中与同学们进行更多的沟通，通过对每堂课程所提出问题的思考，学生可以更加积极主动的回顾每节课所学内容，从而加深学习印象，加强了动脑思考能力。　　（二）可以充分调动学生的积极性　　互动式教学使所有学生都积极参与到每堂课的激烈讨论中来，增加了学生自主学习的积极性。通过老师在教学过程中有意识的赞许与鼓励，可以使同学们更加愿意跟着老师一起学习这门课程。这种教学模式大大改变了以往那种填鸭式教育的弊端，而是更加重视每个学生的真实感受，同学们有了被重视的感觉，所以能够更加主动的与老师沟通学习上的问题。　　（三）可以提高教师的教学水平　　这种教学模式对于教师来说具有一定的挑战性，教师通过培养学生的兴趣来实现教学目的，反过来，教师也应该有能力解答学生们在课堂上所提出的各种问题，这就要求教师在业余时间不断丰富自身的专业知识，提高自身的知识水平，才能全面完整地为同学们答疑解惑。　　（四）可以改善计算机教学成果　　互动式培养模式在一定程度上大大改善了计算机教学成果，通过激烈的讨论和一系列问题的提出，使同学们在探索过程中学到了更多的知识，通过教师与学生两个重要组成部分构成的教学主体在学习过程中都充分发挥了各自的作用，从而使教学成果得到了有效提高。　　五、结论　　中学计算机教育对于学生来说，是非常重要的入门过程，同时也是一项面向未来的现代化教育，学校、老师和家长都必须重视起来。通过明确这一学科的教学目标，提高教师自身的教学水平和加强学生的兴趣培养工作，同时提高对学生实践操作能力的重视，使学生在学习过程中能够积极主动的参与进来，从而实现互动式教学目的。　　参考文献：　　[1]钱国林.浅析师生互动式计算机教学法[J].苏州市职业大学学报,2006,4:135-137　　[2]石斌.互动武教学在信息技术课堂教学中的实践[J].读与写杂志,2011,11　　[3]焦文生,宋唯一.我们是怎样开展计算机教育的[J].中小学教师培训,2005,6　　[4]袁开榜.计算机教育要面向国民经济主战场[J].电子展望与决策,2006,3　　[5]王云,郭晔.国内外计算机教育的新动态[J].陕西经贸学院学报,2006,2　　[6]教育部《中小学信息技术课程指导纲要(试行)》.(教基[2000]35-号),2000,11　　[7]朱钧.重视互动式教学培养学生学习能力[J].教学与管理,2005,9　　[8]汪英华.计算机教育互动式培养途径[J].现代中小学教育,2005,6 "}
