{"title": "医学高职学校计算机课程设置意见和建议", "url": "https://www.lunwendata.com/thesis/2019/155826.html", "time": ["2019-02-17"], "info": " 　　摘要：根据医学类高等院校计算机基础教育的目的和要求、面临的问题，对计算机基础课程体系设置与实施进行了研究探讨，总结其它院校关于计算机基础教育进行的课程体系构建以及实践教学模式等方面进行的探索以及改革成果和经验。提出了以分阶段教育为基础设置课程体系的思路，并给出了实施方法。　　关键词：医学高等职业教育；计算机基础；课程设置　　中图分类号：TP3-4 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-02　　随着卫生信息化步伐不断加快和对信息化人才需求增加的现状，医学院校的计算机课程设置如何利用行业优势来实现人才培养目标，是需要不断探索的问题。医学类高职高专院校计算机基础教学的目的是要求学生在掌握本专业知识技能的同时，还要掌握计算机操作和应用能力。医学院校的计算机教学必需要体现医学与计算机结合的特点，这样当他们毕业走上工作岗位后，就能将所掌握的计算机知识应用于实际工作中。所以计算机基础教学在课程体系、教学内容、教学方法与手段等各个环节，都要充分体现以应用为宗旨，切实提高学生的计算机应用能力和计算机素养。为此本人根据我校各医学专业人才培养目标对计算机课程设置以及实践教学模式等方面进行了探索。　　一、计算机课程现状　　现各校非计算机专业教学课程标准制定基本上是由各个学校自行制定，国家没有制定一个统一标准。各学校制定的标准可能是根据教育部高等学校非计算机专业计算机基础课程教学指导委员会于2003年发布的《关于进一步加强高校计算机基础教学的意见》白皮书中对计算机知识及应用操作要求为依据而制定的，这只是具有阶段性意义。随着国民教育水平和计算机素养的提高，我们现有的计算机教学课程标准也要相应做调整，也应与时俱进。各高校非计算机专业教学面临的问题大概有以下几点：　　（一）教学内容安排不合理。现在许多学生入学时就具备了计算机基本知识和一定的操作能力，这对高校的计算机基础教育带来了很大的挑战。现在各类高等职业学校开设的计算机基础课程主要是以办公软件为主的内容，对学生的操作能力要求不高，主要以简单操作性技能为要求。教学内容多年不变，不能顺应计算机应用领域的发展趋势。再有就是计算机应用基础课程设置和医学专业的联系不够紧密，不能做到“所学即所用”。　　（二）忽视以人为本的教学理念。高校生源由于地区经济水平差异、教育水平差异、以及个体差异等因素，对计算机的知识的接收和动手能力差异很大。学校的计算机课程设置又无法根据这种差异来满足学生不同的学习需求，从而造成学校学生两极分化，好的很好，差的很差。　　（三）对计算机基础课程的重视程度不够。许多学校对非计算机专业的计算机课程认识不到位、把该课看成“豆芽菜“，学时安排少，甚至对该课程学时增减太随意。经费投入少、机房多年未更新、硬撑现象严重。对师资的培养也不重视，许多学校的计算机老师很很少有机会出去进修学习，所以业务水平不高，也没有在教学上投入更多的精力来钻研教法。　　（四）缺乏科学的教学评价体系。现在许多学校对计算机教学效果缺乏科学的教学评价体系。要么以传统考试方式来对学校各专业各层次进行一种统一标准和要求的考核；要么干脆硬性规定学生参加计算机等级考试，以是否拿到计算机操作等级证来评价是否合格，自己撒手不管。这种单一的标准来评价和衡量每个学生，而不考虑每个学生的不同特点和起点水平，也没有考虑到各专业对计算机技能要求的差异，与素质教育的要求相背离。　　二、医学高职高专学校计算机教学如何定位　　高职高专计算机教学如何定位，事实上就是计算机课程如何设置，因为课程的设置决定了教学的定位。根据医学高职高专学校人才培养目标，是要求学生在掌握本专业知识技能的同时，还应掌握计算机知识和应用技能，着重培养学生利用计算机在专业信息方面获取、处理和应用的意识和能力。医学院校计算机教育教学的目的就是要使学生能够更好地利用学到的计算机知识为本专业服务。　　考虑到学生对计算机认识和操作的程度不同，以及不同专业对计算机应用要求的差别，我们将医学高职院校的计算机教学分成基础和提高两个阶段。　　（一）基础阶段　　该阶段主要是让学生了解计算机科学与技术的基本概念、基本原理、技术与方法，并掌握计算机基本操作和应用能力，适用于各医学高职院校低年级各专业。以我校为例，本校处于三峡库区，生源主要来至本地。由于地区性教育程度和计算机普及程度的差异，新入校学生的计算机知识水平参差不齐。特别是有少部分来至边远山区的新生对计算机知识知之甚少，平时几乎未接触过计算机。因此，对于新生不论计算机基础如何，应该统一开设一门计算机基础知识和基本操作方面的课程。该阶段可不用再分层教育，而应该是对有基础者要温故知新，对无基础者打下计算机应用基础，也就是要“就高不就低”。《计算机基础应用》课程主要讲述计算机基本操作、软硬件基础理论、Office办公软件的应用、以及Internet基本操作等内容。这些内容以实践操作为主，通俗易懂，特别是Office办公软件，学生学习后会在学习和生活当中经常使用到，非常适合入门教学。　　（二）提高阶段　　该阶段重在培养学生拓展应用计算机的技能，学生要学会利用计算机这个工具为专业服务。这要根据各学校不同专业针对性地开设一些与专业联系紧密的课程。例如在我校主要开设以下方而的课程：　　计算机组装与维护：学习计算机硬什的组装以及常用软件的安装方法，了解计算机的工作原理，并掌握计算机常见故障的检测与排除。通过这门课程的学习，可使学生对整个计算机系统，特别是硬件系统有一个较全面的理解，增强学生应用计算机的能力。　　医药卫生信息管理：针对某些专业讲述如何在Internet国际互联网上检索各种医药卫生相关信息，以及如何对这些信息进行组织和利用；讲解介绍医疗机构的各种信息管理系统。随着医药信息化建设的日益深入以及Internet的日益普及，网上的各种医药信息越来越丰富。学会对这些信息的检索和利用，将对学生后续专业课程的学习带来极大的帮助，同时，也培养了学生利用计算机和网络技术为本专业服务的意识以及自主学习的能力。   　　高级语言和数据库应用与开发：该课程主要针对高年级生，利用第二课堂时间开设。其目的在于开拓学生视野和拓展学生的知识面，进一步培养学生对计算机的高级应用能力。特别是通过对数据库的学习，可使学生了解数据库在医学领域的应用情况，特别是解决医疗管理的问题方面，学得好的甚至还可参与医学数据库的开发和管理。这样就能进一步提高学生应用计算机为本专业服务的能力，并为今后的深入学习和工作打下良好基础。　　三、实践教学　　基础阶段的计算机知识的教法和学法是大家探讨最多的问题。对于学法，各校同仁提出的各种理论都很有见地，也有许多提高学生学习热情，提高计算机教学质量的方法或手段，但都无一例外地强调实践性，这非常正确，因为这是由计算机这门学科的特点所决定的。而教法，探讨最多的则是“任务驱动”教学方法。不管用什么方法，能激发学生的学习热情和探索精神的方法就是好方法。例如，在讲讲C语言或数据库时，先编制一个有趣的小软件来演示，就能大大激发他们的学习热情，使他们一下子就来了精神想一探究竟。　　再有就是要正确引导学生玩娱乐性软件。其实熟悉和掌握计算机特性，提高计算机操作水平的好方法就是游戏娱乐，许多学生就是通过计算机游戏而进入计算机之门的，关键是怎样来引导，是疏不是堵。大家都知道，但凡游戏高手往往也是计算机高手。因为在玩耍的过程中要涉及到硬件配置、软件安装、故障处理等，这样就能提高学生对计算机的认识能力和动手能力。有条件的学校可开辟这样的场所。　　医学高职院校的计算机课程体系改革是一个需要不断地研究和探索的过程。既是探索出了一条路子也还应结合本校的实际情况和不同的历史阶段来进行不断地适当地调整，才能使我们的计算机课程设置真正做到科学有效，才能真正提高学校计算机教学水平，才能真正满足社会对各种复合型人才的需求，培养出适应信息时代的新型医学类人才。这就要求广大计算机教育工作者要有饱满的教学热情和执着奉献精神，充分发挥创造力，开拓进取、不断创新，使计算机教育适应新时时期的培养需求。　　参考文献：　　[1]李爽,安杰,山艳.医学院校计算机课程设置的调查与分析[J].中国中医药现代远程,2010,13　　[2]苏传琦.浅述医学院校计算机基础课程体系的设置[J].无线互联科技,2011,09　　[3]蒋雯音.医学院计算机基础课程设置与实施探讨[J].职业教育研究,2008,08 "}
