{"title": "高校计算机实验教学改革", "url": "https://www.lunwendata.com/thesis/2019/158760.html", "time": ["2019-03-21"], "info": "　　实验教学作为实践教育的主要组成部分之一，对于提高学生综合素质和培养学生创新精神、实践能力具有不可替代的作用。计算机实验教学是计算机课程教学的重要环节，其目的是使学生更好地理解和掌握计算机知识，让学生熟练地操作计算机和利用计算机解决实际问题。然而，目前许多学校对实验教学重视不够，导致课程体系和内容陈旧，综合性、设计性实验偏少，部分实验课没有完整的教学大纲，实验课教师业务能力参差不齐，实验室的建设跟不上教学改革的步伐，更不能适应目前严峻的学生就业形势的需要。就如何尽快解决这些问题，从教材建设、教学组织形式、教学方法、师资队伍建设等方面进行阐述。　　一、目前高校计算机实验教学中存在的问题　　1、计算机教学内容偏离实际工作要求　　很多的高校在具体的计算机实验教学过程中涉及的教学内容缺乏创新性，很多都是过时的东西，老师只是要求学生按照自己的设计及思维来操作，根本没有能和具体的实际工作结合起来，这样不但不利于学生的就业，而且学生的创新思维及毕业后的工作适应能力很难得到有效培养。　　2、高校对于学生的计算机实验实习重视不够　　很多的高校安排的计算机实验和实习基本都是要求学生自己找个单位，对于学生的实践效果根本不重视，所以学生都基本是随意找个单位或企业应付下了事，甚至有的学生找的实习单位根本就用不到计算机，学生的实践能力很难从这样的实验实习中得到提高。　　3、学生对计算机实验课在思想上重视程度不够　　由于受主观原因和客观条件的限制，大部分学生在中学时没有接触过计算机，他们普遍存在“重理论、轻实验”的思想，认为只要理论课过了关，计算机实验课无所谓。　　4、学生计算机操作不熟练　　从而影响了实验教学的顺利进行。计算机的基本操作主要包括：键盘操作、系统维护、软件使用、硬件维修等。学生上机时间不足容易造成他们对基本操作不熟练，影响他们以后计算机软件、硬件等方面的使用，进而会影响他们的学习兴趣。　　5、教学组织形式简单　　现在的教学组织形式基本上是分组循环方式，即学生实验时间统一、内容统一、进度统一、要求统一。这样，就没有考虑实验的实际要求和学生的基础及其实际动手能力的差异，没有很好地贯彻因材施教的原则，影响了学生的学习积极性，不利于提高教学质量。　　二、高校计算机实验教学改革的思路与途径　　1、提高对计算机实验教学的认识，高度重视学生实践能力的培养　　计算机实验教学无论在掌握计算机理论和原理，还是培养学生运用计算机解决其他各专业问题的能力方面，都占有相当重要的位置，应该把实验教学放到和理论教学同样重要的位置。因此，应彻底改变那种轻视实验教学的现状，把实验教学从以往依附于某一门课程中独立出来，实行实验课程单列，坚持实验教学与理论教学同步。　　高校的计算机教师必须转变教学观念，要高度重视学生的计算机实践能力的培养，要牢固树立“以学生能力为本位”的计算机实践教学观。这就要求教师在传授好计算机基础理论知识的同时，必须要让学生有机会参与实践，这样可以将学习到的基础概念与相关实践操作结合，这样可以把计算机课程中抽象难以理解的问题通过实验检验来加以理解。在实验教学中，教师不但要做好辅导，而且还要尽力做到因材施教，从而让每个学生都能在实验教学中感觉到快乐，提高学习的积极性。　　2、改革实验教学考核方式，加强学生实践能力培养　　要想了解和掌握学生的学习情况就必须要对其进行考核，科学的考核方式可以对学生的学习积极性有促进作用，但是如果考核方式不科学却又会对学生的学习带来负面影响。因此为了适应当前社会及经济的发展，高校必须要改革过去传统陈旧的考核办法。高校必须要高度重视对实验教学的考核，也就是说要严格考查学生的实际操作应用能力，考查学生遇到新问题时的应变处理能力。这样的考核标准和导向不但符合高校自身发展的规律，而且还可以有效引导学生通过积极学习来提高自己的应用实践能力，为日后成为社会发展需要的实用型人才打下坚实基础。　　改革实验教学考试与评价方式，应加大实验课成绩占总成绩的比重，这样，学生对实验课有了一定的重视，实验效果也会相应得到提高。这样既可以促进学生学习的积极性，又可以提高学生的计算机应用能力。　　三、结束语　　高校计算机教育是一项面向未来的教育，高校计算机课程是一个理论与实践并重的课程，计算机实验教学环节是高职计算机类课程教学的重点，因此必须要科学合理地设计好计算机实验教学体系，只有这样才能不断提高学生的计算机实践操作能力及创新能力。计算机实验教学改革涉及面广.因此高校只有不断探索、总结和完善教学方法，才能把计算机实验中心建成培养具有创新精神和实践能力人才的实验基地，为提高教学质量作出积极有力的贡献。"}
