{"title": "大学计算机文化基础课程教学改革探究", "url": "https://www.lunwendata.com/thesis/2019/155829.html", "time": ["2019-02-17"], "info": " 　　摘要：大学计算机文化基础，是高等院校计算机知识学习的入门教材，是培养大学生计算机素养与能力的基础课程。对此，本文作者分析了大学计算机文化基础课程的教学现状，并提出了计算机文化基础课程教学的改革思路，以更好地适应形势发展，培养出应用型计算机优秀人才。　　关键词：大学计算机文化基础；课程教学改革；改革思路　　中图分类号：G642 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-02　　作为高等院校计算机知识学习的基础课程，大学计算机文化基础具有较强的理论基础，突出的实践应用性，显著的学科知识综合性，迅速发展的前沿技术等特点，因而，为了更好地适应形势发展，充分开发与利用教学资源，院校需不断改革，如改革教学内容、教学方式、教学方法等。然而，在当前大学计算机教学中，仍存在一些不足之处，需要加以调整、改革与完善。笔者，结合实践探索，分析了如下教学弊端，并提出了有关改革思路，以提高计算机教学效果，提升学生的信息素养，提高学生的实践操作能力。　　一、大学计算机文化基础课程的教学现状　　（一）教学内容相对滞后　　当前，大学计算机基础课程的教学内容基本定型，包括Access数据库、计算机网络基础及应用、演示文稿PowerPoint、Excel电子表格、Word文字处理软件、Windows操作系统等。尽管这些教学内容具有较高的实用性，然而随着计算机技术的不断发展，软件技术的升级换代，有些知识已被主流淘汰，若不能及时更新，则会限制学生对新信息技术的渴望与需要，导致教学滞后，难以满足现代社会对人才的需求。　　（二）学生计算机基础与能力参差不齐　　因生活环境、地域等因素影响，学生存在明显的差异性，他们的计算机基础参差不齐。对于发达地区的学生而言，其在大学入学之前则已掌握计算机的基本操作与运用；而对于贫困地区的学生而言，他们接触计算机的机会较少，因而计算机基础与能力较弱。这给教学增加了一定的难度：基础好的同学，会感觉教学内容太少，过于枯燥；而基础差的同学，则不难很好的理解，跟不少教学进度，难以及时消化知识。另外，随着计算机知识的不断普及，越来越多的新生会用电脑或基础电脑的机会较多，若仍运用以往的教学模式，则不利于学生能力的发展。　　（三）考试形式过于单一　　目前，对于《大学计算机文化基础》这一课程的考核，其方式主要是卷面与上机的综合评定。而卷面成绩占了总值的70%，而上机操作成绩约为30%。总成绩，通常是根据学生的考试成绩与平时成绩结合加以考核，而卷面成绩所占比例过重。但理论成绩并不能完全反映出学生的知识实际应用能力。这一考试形式又导致了教学内容与方法的单一，阻碍了课程教学改革。　　（四）教学方式有待改进　　当前，尽管课程教学已经转为传统教室授课与多媒体教室教授整合，丰富了教学内容，增加了信息容量，使教学更为形象而直观。然而，这一教学方式还存在一些不足。课堂教学还是以教师为中心，没有充分调动同学的自主性。同时，课堂上，信息容量大，而教学进度又快，因而学生难以一边听边记，知识记忆率不高，也无法构建系统知识。　　（五）学生实际实践时间少　　《大学计算机文化基础》课程的教学主要是课堂讲授与上机实践。当前，多数院校上机实践的时间与课堂讲授的时间比例约是3：5，可见，课堂教授实际要多过于学生上机实践。所以，若想改革大学计算机文化基础课程教学，调整与改进上机与教课比例是十分必要的。　　二、大学计算机文化基础课程教学改革思路　　（一）根据测试水平，自选修读方式　　在计算机基础能力上，往往是参差不齐。这无疑添加了教学难度。若教师采取同一教学模式，则难以调动每位学生的学习兴趣，这不利于学生知识的获得与能力的形成。因此，这对这一问题，高等院校可创设计算机基础水平的测试题库，让学生于开课之前向院校提出申请，以测试自己的计算机基础水平。测试合格的学生，可依据实际情况来选修读方式：测试后，已把握计算机基础知识，会基本操作的学生，可免修理计算机论课与上机课；测试后，对基础知识较为了解，而不熟练计算机基本操作的学生，可免修计算机理论课；对那些测试不合格的学生，则需详细地学习整门课程。　　（二）拓展教学内容，丰富学生知识　　在有些软件的基本操作上，学生已经有所接触，因而，在大学计算机教学中，教师不能照本宣科，对知识逐项讲解，而应突破书本。由于计算机技术处于不断发展变化中，因而计算机文化基础也应不断更新，让学生通过对某一软件的学习，而繁衍至有关软件与流行软件的把握上，以培养学生的新技术思想，提高学生对新知识与技能的理解能力、自学能力。如Windows操作系统讲解时，教师不但要讲解Windows操作系统的一些基本功能与基本操作，还可添加其他操作系统知识，如Unix、Linux操作系统等。又如Word文字处理软件的教学时，教师可基于学生对这一知识的把握上，让学生能够举一反三，可以把握多个版本的Word处理软件、WPS文字处理软件以及Office系列软件的一些基本功能与操作。另外，教师还可联系书本知识，添设学生所喜闻乐见的内容，如智能机器人的发展与使用；计算机病毒的最新防治与发展；多媒体技术的多种应用等等。　　（三）任务驱动教学，培养创新能力　　计算机文化基础，是一门较强应用性的课程，可培养学生的实践能力与创新能力。而任务驱动式教学，将学习活动与相关问题或任务有机结合，以问题或任务来激发学生学习动机，唤起学生学习求知欲，让学生在任务实现的过程中，培养他们的创新精神，提高问题分析与解决能力。如学习Office系列软件后，老师可事先编拟题目，有目的、有针对地设计教学内容，设置格式要求以及相关问题，要求学生利用过有关软件，根据任务要求，在规定的时间内完成任务。通过具有综合性知识与设计性的任务，能够启发学生思维，让他们积极思考，同时通过网上资料查阅、相互交流等方式，设计出独具个性的作品。同时，在知识总结与学习过程中，培养了学生创新思维、动手操作以及自学能力。   　　（四）强化实践训练，提高教学效率　　大学计算机文化基础课程有着较强的实践性与应用性，学生只有通过上机操作练习，才可发现问题，才可巩固所学知识。然而，在实际教学中，有些学生却不重视上机课，在上机课上一般玩游戏、看网页、聊QQ，亦或简单操作。为了解决这一问题，教师可采取一堂一练的方法，提出学习目标以及完成任务的方法，以提高课堂学习效率。在每一堂理论课之后，教师可精设有关的计算机实验内容。同时，没实验均有其对应的实验内容、实验目的、操作提示以及实验步骤等等。在课堂上，让学生根据进度来完成任务，然后以邮箱形式提交实验成果以及实验小结。此外，老师还可将全部的实验内容整理其上机指导手册，以便教学需要。这样通过实践训练，不但将学生知识学习与知识运用相衔接，还提高教学效率。　　（五）多样化考核形式，重视能力检测　　以往考核方式通常是以理论为主，导致学生计算机操作能力不高。学生往往是对理论知识加以死记硬背理，单凭学习成绩难以反映他们的真实应用水平。所以，为了增强与考核学生计算机应用能力，院校可采取如下方式。第一、构建考试试题库。其内容覆盖书本内容，题型除了填空题、选择题之外，更应包含实际操作题。同时，这一试题库为同学全开放，让他们可在网上操作练习。第二、通过网络考试系统加以考核，随机生成试卷。第三、总评成绩考核可以将平时实验成绩（占总值的20%）、网络系统测试成绩（占总值的60%）、综合性的设计实验成绩（占总值的20%）相结合。这样，通过多样化的考核成绩，有利于学生加深计算机基础知识的理解，提高他们的实践能力，使其在实际操作中把握知识，提高能力。　　（六）整合网络与传统教学，增强教学交互性　　在现代社会，信息技术极大地影响了社会生活，改变了生活方式、工作方式及学习方式。网络教学因其独特优势而广泛应用到教学领域，如开放性的学习资源、多媒体化的内容形式、个性化与自主化的内容选择、交互性的学习过程等，这符合素质教育要求，学生不但可以复习已学知识，还可超前学习，并可以从网络上得到所需信息与资料，亦或网上寻求帮助，亦或网上帮助他人，亦或网上作业练习与作业提交等，这对学生能力的提高有很大的促进作用。计算机课程教学时，可整合网络教学与传统教学，教师首先将课程简介、教学课件、教学大纲等上传至网上，以让同学自学使用。其次，老师网上进行作业发布，而学生则网上作业提交，师生于答疑室相互交流，亦或学生网上测试等。　　总之，大学计算机文化基础，是一门具有很强实践性与应用性的课程，需要强化学生的实践操作。同时，计算机信息技术又处在不断发展与更新状态中，因此，若想适应社会发展，院校也应不断改进与完善教学体系，改革教学内容，考核方式，教学方式与教学方法等，以丰富教学内容，为学生提供更多的上机实践机会，从而培养学生的实践操作能力、创新能力。　　参考文献：　　[1]王巧玲,鄢洪涛.大学计算机基础课程教学改革与实践[J].通化师范学院学报,2011,8　　[2]王锐,郭吉平,李华,曲若梅.刘越浅淡大学计算机文化基础课程[J].教学改革.科技资讯,2011,24　　[3]王波.高校计算机文化基础课教学改革探讨[J].考试周刊,2012,1　　[4]宋馥莉.浅谈高职院校计算机基础教学改革[J].河南职工医学院学报,2011,9　　[5]冯林,何明瑞,胡绪英,罗芬.大学计算机文化基础课程教学改革与实践探讨[J].科技创新导报,2008,8　　[作者简介]王冠（1981.3-），男，陕西西安人，西北政法大学信息网络中心。毕业于西安建筑科技大学，自动化专业。长年从事信息网络维护工作及教学教辅工作。 "}
