{"title": "面向计算思维培养的艺术院校大学计算机基础教学改革与实践", "url": "https://www.lunwendata.com/thesis/2019/155583.html", "time": ["2019-02-14"], "info": "　　中图分类号：G424 文献标识码：A 文章编号：1009-3044（2016）35-0089-02　　信息时代发展日新月异，以物联网、云计算、数据挖掘、互联网+等技术平台的全面推广，给我们的日常生活、学习和工作来带了全新的思维变革。在一个信息化迅速发展的社会，对于我们高校的大学计算机基础教学需要有新鲜血液注入、需要有创新思维引入。那么我们就着手教学理念、培养模式的分析，从学生的基本学习需求为切入点，分析需求目的，并结合专业特点，从课程体系构建、教学内容、教学手段、教材选取、教学资源等方面进行深入有效的挖掘，总结并归纳出一套有助于提高艺术院校学生思维能力提高的新教学改革方案，计算思维是近年来计算机教育领域讨论的重要概念，计算思维通过对问题求解、系统设计，把一个困难问题剥丝抽茧分解成若干个子问题，通过大数据挖掘运算技术的特点，求出子问题，并归纳和抽象获得问题的最终求解。它的本质是自动化和抽象化。　　1 艺术院校大学计算机基础教学改革的必要性　　艺术院校计算机基础教学的重点是计算机应用能力的培养。然而高校中存在部分老师就《大学计算机基础》课程有一些陈旧的观点，认为《大学计算机基础》就是“教学生怎么用office软件”、“怎么用windows 7”，“学了计算机基础和专业没关系”等，另一方面：现在的学生本身起点较高，在高中甚至是初中阶段过早接触电脑，并学习过计算机基础，所以导致学生很迷茫和不解大学阶段还要开设“计算机基础”课程的缘由。由于这两方面的观点具有一定的狭隘性和片面性，导致在艺术院校计算机基础教学的改革和创新遇到了阻力。同时，艺术院校的计算机基础教学本身存在诸多问题，没有符合艺术院校特色的计算机基础教材，而是采用工科类院校的通用教材；班级人数的设置，课时的设置；如何提高学生学习积极性等情况。　　所以，大学计算机基础课程的教学目标不是定在教会学生实用OFFICE软件及计算机基础知识，而是应当加强计算机思维能力的训练，构建思维模型，有效与专业相结合，培养用计算思维的方法解决问题。　　首先，计算思维是一种所有人都必备的能力，也是当前大学通识教育必须覆盖的内容。其次，近年来，计算机科学对艺术领域产生了巨大的推动作用。计算机科学已从最初信息管理，逐步发展到造型艺术设计、建筑艺术设计、传媒动画设计、环境艺术设计等新型交叉学科。再者，计算思维是一种建模、归纳、求解过程，对我院设计类专业发展有独特的价值。所以，艺术院校的学生能否利用计算机先进技术，结合本专业特点，采用计算思维方式来分析问题并处理解决，也是对艺术院校计算机基础教学改革的一大挑战。另外我院专业的特殊性，大量设计类专业需要借助计算机软件来完成作品的制作和设计，所以推广面向计算思维的能力培养的教学方法就尤为重要和必要了。　　2 面向计算思维能力培养的艺术院校计算机基础课程改革的思路　　计算思维教育的目的是培养一种学习与思维习惯，其目的是用一种新的思维方式解决复杂问题，建模并重组，使问题简单明了化，有效让学生接受，逐步培养学生的计算思维能力，最终提高学生的创新能力。在这样的教育理念思想指导下，我们结合艺术院校的特点和自身课程体系新特点，按照“技能――知识――思维”三层教育理念，构建了面向计算思维能力的艺术院校计算机基础课程教学改革新方案。　　1）计算机文化素质培养与提高　　计算机文化教学课堂表现形式可结合多媒体教学、网络资源分享、网上视频回顾等。内容涉及计算机发展史、计算机艺术、计算机软硬件知识、计算机网络、windows发展历程到目前互联网上的云计算、物联网、大数据等知识拓展，了解和认识计算机，并根据自身专业特点互联网平台作为契机如何更好地发展专业和未来，值得学生思考和探索，并激发学生学习计算机的兴趣和热情，调动他们的积极性和创造性。通过计算机文化的渗透，使学生充分理解和认识计算机，感受计算机科学与技术的应用和发展趋势，能够在兴趣引导下学习计算机的相关技术和知识，学会用计算机来处理数据、解决问题的能力。　　2）教学内容与教学资源的改革与创新　　根据艺术院校专业的特殊性，在原有的计算机基础教学上加入新元素。形成新的计算机教育课程体系，分为基础篇、应用篇、教学实践、教学资源四部分。其教学内容的改革要体现在立体化的教学资源建设、课堂教学和实践教学三个方面。　　教学资源建设：构建立体化教学资源，能够体现计算思维方法和过程并以满足分类分层的个性化学习需要。这些资源以文字、图形图表、动画与流媒?w、音频视频等多种媒体展现，其形式多样，简单直观，各种媒体资源优势互补。并结合艺术设计应用的教学片段资源建设是关键。这一方面可以通过构建和设计新的教学片段来实现，另一方面也可以对已有的资源基于计算思维进行改造，给出基于计算思维进行求解的过程和实现，对已有资源进行提升。　　课堂教学：加强案例教学，提高课堂教学效率。课堂教学是实时动态调整教学内容的最佳途径，是提高教学质量的关键。而现代教育技术手段的不断发展，为教学提供了良好的支撑。利用多媒体计算机进行案例，对课程中的一些难点重点、不易理解和呈现的知识点，可以充分真实地展示出来。　　实践教学：我们设立了各种实验，包括基础实验、拓展实验和创新实验等。通过实验来验证和加强理论教学，掌握计算机技术，了解技术的理论和解决思路。基本实验主要用于OFFICE软件应用，拓展实验主要结合专业特点使用计算机技术，创新实验主要用于计算思维能力的培养。   　　现代教育技术手段使用：我们开展网上教学，把大学计算机课程的视频和多媒体课件定时上传校园网，便于学生回顾和浏览，设置相应的课程任务，鼓励学生运用所学知识解答任务并提交至服务器，开设在线答疑，帮助学生尽快解决问题。同时可以开发基于移动互联网的移动学习应用，为学生提供了便捷良好的多样化、立体化学习。　　3）实验设计与实验平台建设　　大学计算机基础作为一门各专业的公共基础类课程，其课程内容较多、涉及面较宽，尤其对计算机技能的要求很强，如何实现基于“思维能力”培养的教学，是课程改革的关键。　　第一：加强实验内容的设计，设计各种类型和不同层次的实验来检验、巩固和理解教学内容。 第二：搭建各种适应人才培养的实验环境，通过实验平台建设来营造良好的实验环境。第三：加强实验学时比例。　　3 面向计算思维能力培养的艺术院校计算机基础课程改革的实施　　艺术院校专业众多，我们选取平面艺术设计和影视动画设计两个专业的5个班级300名学生，进行面向计算思维能力培养的计算机基础教学改革试点。　　1） 采用分级分层教学　　同一学校、同一专业的学生今后的发展情况不同，每个学生对信息技术的理解、掌握能力也不一样，所以对学生要设置分级分层培养，尤为重要。计算思维的培养应当循序渐进、分级培养的过程。分级培养分为必修和免修两个等级。由新生入学考试（浙江省计算机一级应用能力水平测试）的成绩设定80分为分界线，高于80分以上的学生为免修，低于80分的学生为必修。必修学生必须完成大学计算机基础课程；免修学生要选择多媒体技术及应用和internet实用课程，并鼓励和推荐免修学生参加计算机大赛或参加与本专业设计大赛。将课程和大赛结合是培养学生信息能力有效途径，通过大赛可以使学生以计算思维为导向的计算机应用能力不断提高，并更好的解决设计专业相关问题。分层培养分为A和B两个层次，通过对一些基础设计软件（Photoshop、Flash、PPT）测试，如让学生做一个海报、动画、多媒体课件等来划分层次，A和B两个层次的学生在完成教学内容的基础上，对与A层的学生1/2的课时完成教学大纲内容，1/2的课时着重培养计算思维能力解决与专业相关问题，鼓励参加平面设计大赛或多媒体课件制作大赛。　　2） 面向专业应用、面向专业案例教学的计算思维教学　　在PPT教学中运用动画效果叠加、动画路径和设置自动播放时间来模拟动画专业Flash的动画片头，在WORD教学中运用文字、图片和表格排版模拟平面设计Photoshop的海报制作，在FRONTPAGE教学中运用库、模板等技术模拟动画专业Dreamweaver的网页设计。通过大学计算机基础课程的学习，培养一种计算思维，恰到好处地与专业有效结合，让计算机基础的学习延伸到专业学习中去。同时，激发学生对信息技术的热情，并落实了计算思维的培养过程。　　3） 教学评价　　通过试点，我们对教学内容、教学方法、教学手段等多项进行综合教学评价，通过网上的调查问卷反馈，学生对面向计算思维的教学改革的满意度和认可度达85%，与我们预期的目标非常接近，所以我们可以把这样的教学改革方式进行推广，甚至可以在别的课程中尝试实施。　　4 结束语　　本人从事一线计算机基础教学工作有14年了，掌握了大量的原始数据，也一直不断地探索和思考，找一条符合艺术院校特殊的计算机教学方法，不断地总结教学经验。随着信息技术的变革和大数据时代的到来，计算机基础课必将迎来新任务和新挑战，而计算思维概念的提出，对于这场变革无疑是最有效的支柱。通过为期一年的试点教学，培养以计算思维能力的大学计算机课程教学也取得了令人满意的成绩，虽然这只是开始，我也积极思考如何运用计算思维的方法在专业课程中推广。计算思维与计算机基础课的结合，突破了传统的教学思路，结合具体专业设计案例，将整体分支为个体，分析、归纳、递推、转化为计算思维的教学理念，为学生今后的专业课程学习建立一个思维模式。"}
