{"title": "高校计算机应用技术学科建设的实践与发展探讨", "url": "https://www.lunwendata.com/thesis/2019/158788.html", "time": ["2019-03-21"], "info": "　　一、目前计算机应用技术学科在高校的背景　　高校一直以来的培养方式都是较为枯燥单一的理论化培养方式，这种形式培养出来的学生并不能适合现在快速发展的社会，造成理论与技术相结合的断层，形成尴尬局面，一方面是用人单位的不匹配，另一方面是学生的自信受到影响。针对这种情况，我们应该将加快计算机应用技术学科的建设，健全计算机应用技术学科的管理及体系，让学生的计算机应用技术水平得到有效提高，在真实的模拟环境中提前切入未来所需的技术与水平中，以达到高校人才培养的预期目标。　　大部分高校文科计算机应用技术学科都处于“形式主义”的尴尬境地，一方面是教学策略的不重视，没有意识到高校计算机应用技术水平对学生实践培养的益处；另一方面是计算机应用技术学科的软硬件水平确实根不上使用情况，而且使用极不方便。这种情况就造成要么不重视，没有计算机应用技术学科；要么有计算机应用技术学科，而形同虚设。甚至有的学生根本不知道可以在计算机应用技术学科中做一些社会体验。　　二、高校计算机应用技术学科建设的目的与意义　　教育部文件指出，高校建设必须把计算机应用技术学科建设作为不可缺少的部分，必须改变“文科不需要计算机应用技术学科”的传统观念[1]。基于这种指导方针，我们应该将建设计算机应用技术学科作为首要任务落实到行动中，打造出一支高素质的师资力量，去建设、管理、创新计算机应用技术学科，将教学水平与科研水平提高到一个新的台阶。　　高校是培养管理类复合型人才的摇篮，应该重视计算机应用技术学科的建设与教学结果，为社会贡献更多的全面型人才。　　（一）将理论化教学方式向实践化教学方式倾斜　　高校课程设置一直以来都是理论教学为主导的形式，这种教学方式虽然可以将知识有组织、有计划的传递给学生，却没有为学生带来实践的真实感。同时，不利于学生的全面创造、开发能力以及分析问题解决问题的实操能力。　　在复合型人才培养的过程中，为了更好的将学以致用的理念融和教学中，重视教学结果，高校应该担负起计算机应用技术学科建设的责任，合理规划，将计算机教学的方式给予更多的课程份额。　　（二）创造实践基础条件　　在经济管理这一大的教学类目中，大部分课程都没有实践教学的先例，对如何开展实践教学比较陌生。所以，计算机应用技术学科应该在课程设置上以学生为主，计算机应用为平台，由教师带领在该领域努力探索，争取获得更大的突破，在改革的过程中同时培养出高素质的人才，满足市场的需要。　　在市场需求的基础上，应该充分考虑在计算机应用技术学科的建设上，应注意哪些方面，要让计算机应用技术学科真正的变成学习、研究的重要基地与平台，学生与教师可以在计算机应用技术学科研究自己的专业、发掘深入地学习，并且进行交流与创新等。　　（三）多种实践形式相结合　　计算机应用技术学科的建设除了考虑其建设的目的性，还要综合考虑多种因素。最主要的是，课程的软实力必须跟上来。由于实践教学的方式对很多高校较为陌生，所以课程的设置上概念模糊，没有创新，甚至没有课程相关的配套方案等。　　为了改善课程的单一及保证教学结果的理想，学校应该组织高水平的师资力量投入到研究实践内容的开发中来，实践开发的结果应该是多样化的，趣味性强，以增加学生的积极性，引导他们自发的进入到研究中心来学习与研究。　　（四）提供计算机应用技术学科开放保障　　计算机应用技术学科管理需要加强。大部分高校计算机应用技术学科都是可有可无的，长期关门。学生无法享受到计算机应用技术的便利。在高校计算机应用技术学科建成后，应完善计算机应用技术学科管理体系，做到随时开放。让有兴趣有灵感的教师与学生可以不受空间与时间的限制，将专业研究发挥出最好的水平。　　三、计算机应用技术学科的建设　　计算机应用技术学科是跨越经济学、管理学、国际贸易学等多学科的综合性专业。计算机应用技术学科在设计时要充分考虑这些因素，争取达到资源共享。　　（一）经济仿真类计算机应用技术学科　　这一类的计算机应用技术学科主要是借助一些软件来模拟社会实体的工作行为，受不同科目的限制，在选择软件时要考虑配置一些通用性强的分析平台软件，灵活选择其他相关的需求。如仿真软件、分析软件、用友、世格国贸模拟软件以及一些保险类相关的软件等。　　（二）管理模拟类计算机应用技术学科　　管理类相关的用于计算机应用技术学科的软件选择上，可以以金融公司、公司发展战略、公司管理、营销学等方面选择。这些软件能帮助学生在信息捕捉、问题分析及方案设计等方面起到锻炼的作用，学生可以像在企业工作中一样，结合实际问题对公司的运营情况进行讨论，找出策略并加以实施等。　　（三）管理信息系统类计算机应用技术学科　　管理信息系统类的计算机应用技术学科就应该在工程及软件工程方面着手，找到特点，帮助学生发现可以在企业中灵活运用的编程方法，引导学生在模拟的企业平台中发挥特长，对数据库、项目运营管理等方面有所突破。　　（四）社会调查类计算机应用技术学科（CATI）　　这是一个有关经济类专业的调研相关的需求，对社会的情况进行调研，然后用信息加以分析，这给各个专业都提供了一个接触社会的良好平台，有助于学生的综合能力培养。在计算机应用技术学科中选择这个软件，可以增强学生的经济调研水平，在迈出校门前就可以灵活掌握这些相关的软件使用，将计算机应用达到极致。　　四、计算机应用技术学科未来的发展与不足　　首先，教师队伍的整体水平要加强，没有一支好的师资力量，在实践教学中是无法将教学结果有效实施的，所以要选择一批全面水平高的精英教师，将实践课程的整体水平带到高处，发挥实践教学的优势与特点。　　其次，高校计算机应用技术学科建成后，应该有相应的实践品类与教材与之配套，不能再使用老的教育资源。教材与实践要融入现代发展的步伐，让学生更深刻地了解与体会社会。　　虽然计算机应用技术学科在高校的建设中可以为日后的社会贡献大量复合型人才，但也明显存在一些缺陷与不足，这需要我们在未来的探索中不断开发与完善。　　目前计算机应用技术学科建设中所发现的一个明显缺陷即适应未来各个专业的软件品类单一，无法满足市场变化，有时高校的软件跟不上更新速度，只能使用较老的产品让学生进行实践与学习，这就造成了教育的迟滞性，可能会为计算机应用带来负面影响。　　最后，应该在未来的计算机应用技术学科中提供更多的软件与更具效率的更新技术，以满足未来各个行业与领域不同的工作需求，让学生的实践与体验更具真实性，更有意义。　　五、结语　　计算机应用技术学科的建设是需要很多教师的努力共同来完成的，在建设过程中，要从教学与研究两方面充分考虑，力求平衡。在课程设置上，也要考虑实际情况注意更新与结合企业的案例，开发出更多更有益的优质实践课程。同时，鼓励教师在计算机应用技术学科课程上钻研心得，甚至编书成册，形成计算机应用技术学科教学的完善体系，方便其发展与创新。"}
