{"title": "谈计算机美术设计的优势", "url": "https://www.lunwendata.com/thesis/2019/155842.html", "time": ["2019-02-17"], "info": " 　　摘要：计算机技术的发展带来了一系列的变革和发展，计算机辅助设计在美术设计中的应用是计算机技术和美术设计发展的切实需要，计算机美术在图像、图形、文字、视频、出版各方面都有涉及。计算机美术设计给设计师留下了更多的思考和设计时间，并且有效拓展了想象空间。　　关键词：计算机；美术；设计　　中图分类号：TP393 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-01　　随着计算机技术的发展和互联网络的逐渐普及，相应的设计行业也得到了一定形式上的创新和发展。现代设计与人们的生活密切相关，适应了市场经济发展的切实需要的计算机设计。美术设计者不再单纯地用画笔和画纸来作图，而是用计算机来表现出来，与传统的美术设计相比，计算机设计促进了视觉设计的一系列相关产业的形成和发展。计算机美术设计通过运用创新的工具为创作手段实现美术设计，在传统美术设计基础之上随着计算机技术的发展而不断完善。　　计算机美术是计算机与美术的有机结合，是科技与艺术的结晶。计算机美术的兴起，使得美术的表现手法更加多样，特别是在设计艺术作品的应用中，计算机技术的运用已经相当普遍。计算机美术开拓了美术设计的新领域，并迅速向传统美术领域渗透。如今，从平面设计到工艺美术，从广告招贴设计到书籍封面设计，从影视动画到电影特效，从网站设计到工业设计，从专业美术创作到业余美术入门，都可以见到计算机美术的踪影。广告、装潢、造型等美术创作的过程，会更紧密地与计算机美术结合在一起。在未来的发展中，不懂计算机技术的美术设计师施展艺术才能的空间会逐渐缩小，他们的状况就会像画家不会拿新式的画笔一样。因此，大力推广计算机美术基础知识是我们相关专业教育工作者的义务。　　计算机美术是一门计算机技术和美术相结合的学科，它要求创作者既要懂美术又要懂计算机。它利用计算机作工具，按照美学原理，以图像和图形的形式进行信息交流和升华，形成了自身的特点，创造了新的艺术形式。它的成果使我们得到美的享受。也为人类社会创造了新的文化。下面我们来了解一下计算机美术的特点及优势：　　一、应用范围非常广泛　　计算机美术设计几乎涵盖了美术设计领域的各个方面，平面设计、网页制作、广告摄影、影视创意、建筑效果图后期修饰等等。计算机美术的广泛应用，改革和创新了人们的生活和工作的各方面，有效提高了生产效率。　　二、功能非常强大　　在美术设计领域，计算机是先进的设计工具，具有声图并茂、信息存储量大、展示便捷、图像生动逼真、动感效果，作图速度快都是传统的美术设计难以企及的，同时计算机美术设计还方便修改，不会丢弃纸张重新作图，另外它的传播途径也很广泛，上传到网络上、刻录成光盘，节省了资源。计算机美术在图像、图形、文字、视频、出版各方面都有涉及。计算机美术设计给设计师留下了更多的思考和设计时间，并且有效拓展了想象空间，由平面设计扩展到三维立体设计以及网络动画设计以及影视制作等。而不再是满足于只靠联想与想象的艺术思维空间。　　三、支持多种美术设计软件　　计算机美术设计的多样性也在一定程度上体现在美术设计软件的丰富多样上，例如平面设计类软件：Photoshop、Illustrator、CorelDraw，能实现修复照片，标志设计，排版印刷，图片的设计等等；建筑施工图设计如AutoCAD、3DMAX等，室内外装饰设计效果等。动态视频软件如：flash、After Effects等，能制作动画片，电视栏目包装等等。把二维的平面图像变成三维立体的动态视频，看起来更直观，更具有吸引力。发展成熟的美术设计软件为美术设计提供了完善的调整和设计方案，大量的美术软件的产生为设计师们提供了丰富多彩的表现形式。　　四、大量的存储素材　　计算机技术和互联网的发展和普及建立了信息资源共享的平台，计算机网络信息化以及海量存储的特点，是设计师能够轻松的获取各种素材，如一些图片模板，在使用时，调用出来即可，很大程度上节省了时间。同时也可通过计算机美术设计实现很多意想不到的效果，将以前的创作设计应用到新的创作中去。计算机对于美术设计作品可以进行海量存储和网络信息化使作品出版、传播具有显著优势。同时计算机美术设计也推动了整个美术设计行业的快速发展，建立了美术设计者的相互交流和沟通的平台。　　计算机美术是计算机与美术的有机结合，是科技与艺术的结晶。计算机美术的兴起，使得美术的表现手法更加多样，特别是在设计艺术作品的应用中，计算机技术的运用已经相当普遍。计算机美术开拓了美术设计的新领域，并迅速向传统美术领域渗透。如今，从平面设计到工艺美术，从广告招贴设计到书籍封面设计，从影视动画到电影特效，从网站设计到工业设计，从专业美术创作到业余美术入门，都可以见到计算机美术的踪影。广告、装潢、造型等美术创作的过程，会更紧密地与计算机美术结合在一起。在未来的发展中，不懂计算机技术的美术设计师施展艺术才能的空间会逐渐缩小，他们的状况就会像画家不会拿新式的画笔一样。　　参考文献：　　[1]程楠.计算机美术设计与传统美术设计[J].青年文学家,2011,6　　[2]王闽松.美术基础与建筑设计人才培养[J].白云职业技术学院学报,2001,2　　[作者简介]曹京（1983-），女，籍贯：河北省石家庄市，职称：助教，学历：本科，研究方向：艺术设计；苏翠玲（1972-），女，籍贯：河北省石家庄市，职称：助教，学历：本科，研究方向：计算机科学与技术。 "}
