{"title": "计算思维视角下的大学计算机教学探析", "url": "https://www.lunwendata.com/thesis/2019/152839.html", "time": ["2019-01-16"], "info": "　　0 引言　　当前，计算机已经完全普及，并应用到各行各业，计算机为人们的生产、生活和学习带来了翻天覆地的变化。大学作为培育并输出计算机专业人才的重要阵地，越来越注重计算机的科学、规范化教学。由于该门学科所具有的特点，计算思维势必会与其存在辩证性的必然联系。传统的大学计算机教学，往往是授课、微机操作，而完全忽略了计算思维方法的系统化融入，因此学生的计算思维能力较差，培养出的计算机专业的人才也存在一定的瑕疵。从某种程度上而言，计算思维教育已经完全不再是个人能力提升方面的问题，而是影响一个国家的安全、关乎一个民族将来的迫切大事。目前，国内专家学者敏锐地捕捉到计算思维对计算机教学的重要性及其对人类生活带来的革命性变化。本研究主要探讨了计算思维在大学计算机教学中的应用，旨在突破传统教学模式与方法，为计算机专业教师的教授、学生的学习提供一个全新的视角，从而为社会培养和输出更多专业性强的计算机人才。　　1 当前我国大学计算机教学存在的问题与面临的挑战剖析　　1.1 学生的个体化差异及学习的积极性对计算机教学产生的影响　　对于刚刚进入大学的大一学生而言，他们自身所掌握的计算机基础知识有较大的差异性，有些同学只会办公软件、浏览网页、QQ等基本技能，而有些学生则会更深入的软件（如CAD、PS等软件），甚至还有的学生会懂得基本的建站知识。学生所掌握的计算机知识的参差不齐，对计算机教学带来了巨大的影响。此外，对于大学计算机基础理论知识的教学而言，学生均纷纷表示，这部分内容像是计算机各个部分的基础知识的简单罗列与拼凑，与实际不相符或者结合不够紧密，也不能很好地贴近自己所学的专业。基础课程学习完之后，学生们普遍的感觉就是：学习内容多、抽象而且难度水平高，课上完了，但是他们还不会应用，从而使得学生对计算机学习的兴趣不够高，甚至产生一定的抵触心理。　　1.2 师资力量低下对计算机教学产生的影响　　目前，高校每年都在扩招，那么这就无形中给承担计算机基础教学工作的教师带来了巨大的压力，教学任务重加上重自然研究，轻教学的现状，使得很多教师已经忘却或者忽略计算机教学理论的深入研究。大部分计算机专业教师忙于做项目、开展自然科学研究，直接的后果就是缺乏一支优质的师资队伍，专职教师数量非常少，甚至有一部分教学任务由从事行政的或者实验室人员负责。再有，就是计算机发展速度非常之快，教师的教学理念与理论也很难在短时间内进行更新，或者说疲于追踪计算机学科的发展速度。长此以往，大学计算机教学教务混乱，且存在将计算机教学简单地认为是计算机基础课程的教学，缺乏对计算是人类普适的、通用的一种思维模式这一理念，从而计算思维也无法真正地融入至大学计算机教学之中。　　1.3 课程考核机制对计算机教学产生的影响　　长期以来，大学计算机教学仅仅是以最终的学期期末考试作为最终的评价依据，由此，大学计算机教师就仅仅围绕计算机基础课程期末考试开展教学活?樱?计算机基础教学由此而变成应试教育的产物。在大部分考试之中，计算机基础课程考试试题题型均为客观题，而没有设置主观题或者开放性的试题，要求的都是死记硬背的东西。不仅纸质考试如此，就连计算机技能操作考试的试题也考察学生的死记硬背的技能，对学生综合素质的考察少之又少。长此以往，教师的教学内容以及学生的学习内容仅仅局限于课本或者考试大纲，对学生创造性思维的培养以及解决实际问题的能力非常不利。　　2 强化计算思维视角下的计算机教学策略　　2.1 注重对计算思维理论的深入研究　　自然与社会系统之中禀赋着十分丰富的属于计算的演化规律，尤其是随着信息技术的快速发展，人们迅速迈进“计算”时代计算伴随着电子计算机的出现而快速进展，成为一门新兴的学科，对所有的科技领域产生了重大的影响，计算思维由此而成为一种重要的影响人类世界观、价值观以及人生观的思维方法。一般而言，可以将计算思维分为3个方面的层次，即：计算素养、理解与分析的能力、认知与实践的能力。三者之间均存在着十分紧密的关系，具体见下图1所示：　　2.2 强化计算机网络教学平台的构建　　与超星尔雅和电子工业出版社合作“计算思维慕课平台建设”，网站上面提供了大量的计算机教学资源，学生可在上面进行全面而又深入地学习，自主性很强，大大提高了学生学习计算机知识的自主性以及积极性，不仅仅局限于课堂之内，而是拓展到课堂以外，更加充实了学生的基础知识，也开拓了他们的视野，大大满足了不同层次学生的学习需求。此外，网络教学平台还能够大大缓解教师的教学压力，同时也对教师们起到了传帮带的效果，满足了教师的教学需求，在很大程度上提高了教师师资队伍的基本素质，从而培养出更多专业性强、解决实际问题能力大的学生。　　2.3 从计算思维到计算文化的提升　　人和社会的活动越来越依赖计算机和各种通讯设备，计算文化凸显。计算思维教育和计算文化弘扬已经不仅是个人能力提升的问题，而且是影响到国家的发展战略的一个严重而急迫的大事。因而，拟在上述研究和实践基础上，发现计算之美、提炼计算文化现象、把握计算文化的核心价值， 将视角从计算思维放眼到计算文化， 突破在高校传统的计算机教学中。　　3 结论　　综上所述可以得知，当前时期大学计算机教学中存在诸多突出的问题，对此本文提出了将计算思维应用于大学计算机教学之中，旨在提高教学实效性，为社会输出更多专业性强以及解决实际问题能力棒的学生，更好地为社会服务。"}
