{"title": "高职计算机网络安全课程教学改革探讨", "url": "https://www.lunwendata.com/thesis/2019/159239.html", "time": ["2019-03-26"], "info": "　　1、课程体系现状　　计算机网络安全是计算机网络专业的核心骨干课程，现有课程体系及教学实施过程中存在的问题是理论教学内容偏多。网络安全是涉及计算机科学技术、网络技术、信息技术、数字密码技术等多学科的综合性学科。从事该课程的教师也因为实验室攻防条件限制、实训环境设置简单等问题，不能很好引导学生理解该课程，为该课程的教学实施打了折扣。　　该课程的考核方式与评价体系相同于传统课程，偏重于理论考核，大多是闭卷笔试。难以做综合能力与创新能力的评价，学生为了应付考试，把主要精力放在了死记硬背课本和课后习题上。这样的考试不利于学生对知识的全面掌握，不能全面反映学生对课程的实际掌握情况，更难于衡量学生对知识的运用能力和实际动手能力，还容易出现抄袭、作弊等违纪现象，由于实验环境的不稳定性，在实践考核环境中也存在操作困难的情况，这些情况不利于教学水平的提高，更不能充分发挥考试的导向和人才培养的指导作用。　　2、内容改革，教材先行　　由于网络安全技术的快速发展，要求《计算机网络安全》教程必须紧跟科学技术前沿，因此教学内容改革势在必行，必须脱离传统的文字教材范畴，在文字教材的基础上增加多媒体教学资源和网络课程作业。　　（1）文字教材。文字教材是教学的基本依据，对学生知识的学习有先导的作用。一本好的教材如同一位好的导师，应当以学生的认知规律为主线，以项目任务单元构建学习章节，阶段性的安排学习内容，打破传统教学教材，让学生可以深入浅出的了解网络安全的知识，形成良好的学习习惯。　　（2）网络课程作业。适量的作业练习是必须的，可以拓展学生的学习思路，更加牢固的掌握所学知识。利用网络多媒体技术制作网络课程作业，学生采用网上答题等方式，结合邮件方式，可以快速实现作业的批改。　　因此，教学资源、教学内容的改革不再局限于文字教材而是涉及多媒体教材、网络课程在内的多种教学内容改革方式。　　3、方法创新，项目驱动　　网络安全课程是一门实践性很强的课程，只有通过应用才能掌握知识。在具体学习过程中，引入项目驱动的教学方法，根据课程的性质、特点、学习对象、教学目标、教学大纲、教学内容、多媒体辅助方式等方法进行多种方法的教学。　　（1）“项目驱动”教学法。“项目驱动”教学方法的核心是教师在精心为教学设计的项目下，通过自主学习、协作学习、讨论学习、探究学习等方式来完成任务在探究解决问题的途径中，学生既学到了知识，又培养了能力，更重要的是提高了学生的探索创新精神、动手实践能力和与人合作能力。在完成项目的过程中，学生始终处于主动的主题地位，教师是学生学习的组织者、服务者和导航者。　　（2）多教学方法交叉使用。使学生由接受者转变为主动参与者，在发挥教师主导作用的同时，充分发挥学生的主体作用。引导学生去思考、去探索、去发现，鼓励学生大胆提出问题。使学生在实验室主动进行实验学习、在实验室以外也能自主学习。本课程必须在多媒体网络教室上课，把集中辅导和上机实验合二为一。　　（3）“项目协作”教学法。该教学方法依据学生的能力、知识储备等相关因素，将学生以小组的形式进行教学。小组成员通过相互合作，进行网络的模拟攻击，而另外的成员则进行防御。通过小组之间的互动、分析讨论，从而引申不同的思考方向，同时结合校企项目，教学中安排学生社会调查内容，采取组织或者自由形式参观一些较大规模的网络环境和安全项目，进而构建出个人对于学习内容的系统知识。　　4、模式探讨，讲演教学　　对于学生来说，学习的目的在于掌握一定的技能。网络安全课程内容多，各个内容之间没有联系少，学生学习时往往感觉学习困难，因此，在教学时可以改变传统的逐章教学的方法，设计网络安全的框架结构，在教学中逐步将这个框架清晰化，具体化。构建一种以学生为主体、以教师为主导、以网络安全框架内容为主线的基于实际项目的教学模式。该模式旨在探索出适合高职学生学习《计算机网络安全》的“讲演”教学模式，以便更好地培养学生的创新意识、创新精神、创新能力和计算机网络安全防护应用技能解决具体实践问题的能力。　　整个教学模式中教师总是起到导学的作用，教师的作用就是尽量激发学生对本课程的学习兴趣，提出问题、并解决问题。该课程教学模式的学生引导过程如下：　　（1）激发学生的兴趣。兴趣是最好的老师，学生在学习活动中，对自己感兴趣的现象，总是主动、积极地去探究。根据教材内容的引导案例，结合校企项目，引导学生探讨网络安全问题，让学生有参与的机会，谈谈他们对网络安全知识的认识，然后和他们交流，并介绍该部分教学内容的安排，这样既拉近了师生距离，同时也便于掌握学生情况，给学生的学习增加了兴趣和动力。　　（2）创设网络安全背景。网络安全背景创设必须有利于学习者对所学内容的意义上构建的。网络安全课程虽然都是围绕网络在进行介绍，但是课程内容具有很大独立性，不像很多课程的搭积木特点。这种课程一方面具有个别内容学习耽误不影响后续学习的优点，也带来学生觉得知识太散，不容易归纳掌握的缺点。因此作为教师结合网络安全知识总结教材体系是重要工作，整个教材的内容实际上可以按网络安全框架进行展开。教学中直接给学生一个框架，因此需要在教学中设计一些网络环境的背景，涉及有针对性的安全问题，变成学生脑海的直观印象。　　（3）提出问题。在教学过程中除了要创设背景、激发学生的学习兴趣外，最重要的是要培养学生的分析问题和解决问题的能力，利用各种方法选择出与当前学习主题密切相关的真实性事件作为学习的中心内容，让他们课后搜集资料、寻找答案，促进他们的学习兴趣。　　（4）项目协作。为使学生的知识体系更为合理，教师应尽可能组织学生协作学习，并对学习过程加以引导，使之向有利于知识建构的方向发展。合理安排网络攻防实验课，使学生自发分组进行对抗。这些项目主要有：网络安全研究性调查、小型企业网络机房安全规划、红蓝网络攻防对抗、网络实时安全管理模拟等，以加深学生对所学内容的理解。　　5、结束语　　计算机网络安全课程的教学改革，一方面需要更新教学的内容和实验环境以适应计算机网络安全技术的发展和社会对网络安全专业人才的需求，使之更贴近于实际，激发学生的学习兴趣。此外应加大对学生动手能力的培养，为他们将来进入社会打下良好的基础，这样也更加符合高职教育的理念。"}
