{"title": "高校计算机应用基础教学改革初探", "url": "https://www.lunwendata.com/thesis/2019/154585.html", "time": ["2019-02-04"], "info": "　　随着“互联网+”由行动计划上升为国家战略，我国高校计算机应用教育迎来了新的机遇与挑战。特别是在互联网迅猛发展的大潮下，计算机作为其中重要的一环，已经成为广大企事业单位日常工作不可或缺的重要生产力工具，这也为高校毕业生的计算机能力提出了更高的要求。我们知道，高校计算机教学一方面是为了提高学生综合素质，另一方面也是为了提升高校毕业生就业竞争力。但在高校《计算机应用基础》这门课程的教学中，很多高校仍然沿用传统教学方法，教师授课手段单调，学生学习缺乏热情，学习积极性不高。因此，在“互联网+”背景下，高校非计算机专业计算机应用基础教学必须紧跟时代潮流，积极研究探索利用互联网技术和其他先进信息技术，努力提升计算机应用基础教育教学水平。　　1 高校计算机应用基础教学改革探索　　1.1 因材施教，分层教学　　高校学生在入学前计算机应用能力是有较大区别的，这主要与地域间差异、家庭经济水平差异等有关，也与学生学习能力有关。有的学生虽然是非计算机专业，但是对计算机特别感兴趣，很早就开始接触计算机甚至可以编写一些程序。但是，有的学生在进入大学之前，对计算机了解非常少，甚至没有接触过计算机。如果在课堂对这些学生采用同样的教学方法和讲授同样的教学内容，就会出现基础好的学生对课程不感兴趣，不愿意听讲。然而，基础不好的学生，又会觉得教师讲解太快，无法跟上教学进度。为了更好的因材施教，让各种水平的学生在计算机应用基础的课堂上都有所收获，那么采取分层教学的方法可以说是一种创新与尝试。在新生入学之初，可以对学生进行一次计算机应用基础测试，根据测试结果对学生实施分层次教学。通过这种方法，可以提高学生的学习积极性，增强对计算机学科的兴趣与爱好，也提高了教师的教学效果。　　1.2 密切结合学生专业背景　　计算机应用基础面向全校各专业学生，从文史类到理工类，跨度大，范围广。在日常教学中，应当将计算机教学与学生专业进行融合，将不同专业知识融入到计算机日常教学之中，培养学生在专业领域运用计算机的能力为导向，以转变教师教育观念为手段，使学生形成计算机思维为目标[2]。教师应当根据学生专业的不同在教学过程中创造与专业相关的教学环境，引导学生使用计算思维解决专业性问题。例如，对于护理专业的高职学生为例，在word文字处理软件教学中，应从病历排版入手，让学生明白word文字处理对于其专业是非常重要的，将对于其日后走上医护工作有极大的帮助。而对于学习管理专业的学生，相关可从管理案例入手，让学生从各自专业角度确定文字排版方案。通过专业知识与计算机教学的密切融合，既可以让学生带着专业兴趣学习计算机，又可以培养学生运用计算思维解决专业问题的方法，这对于学生综合能力提升具有极大帮助。此外，教师可以通过专题讲座的方法，为非计算机专业学生讲解计算机技术在学生本专业领域应用的最新科技成果，提高学生的学习兴趣。　　1.3 推进新技术应用　　随着信息技术的飞速发展，许多新技术被应用到了高校日常教学之中。包括慕课、虚拟仿真等。　　1.3.1 虚拟仿真　　对于化工、医学、机电等专业学科而言，除了要掌握扎实的理论知识，学生的实践能力的培养也是至关重要的。传统教学手段一般以板书和多媒体教学为主，无法为学生展现抽象的过程和实际操作过程。对于计算机应用基础这样的课程，涉及到计算机组装和组成原理，如不采用实验的方法， 很难让学生真正理解计算机的运行过程。然而，受到时间、财力等限制，许多高校无法提供大量用于组装训练的计算机，这就使得学生无法真切体会计算机的安装方法和运行原理，不利于计算机应用基础教学。虚拟仿真技术在高校教学的应用与推广，为计算机应用基础的教学改革提供了新的方法。通过将虚拟仿真技术应用于计算机应用基础的日常教学过程中，教师可以让学生在平台中模拟计算机安装组成过程，认识CPU、内存、主板等部件的安装方法。同时，虚拟仿真平台可以对安装过程进行自动打分，评价学生实践能力水平。　　1.3.2 慕课　　“慕课”一词最早出现加拿大[3]。慕课是指大型开放式网络课程，不仅打破了地域、时空的限制，还借助于信息技术，实现了优质教育资源的共享，保障了教育的公平性[4]。慕课的出现，为高校教学提供了一种新的教学手段并逐渐推广应用。互联网的全面普及，为慕课的发展提供了基础条件。学生们可以不必受限于课堂上的授课时间，可以利用课余时间补充学习。慕课应用效果的优劣，很大程度取决于学生的自觉性，要求学生具有较高的自我学习能力。因此，对于高校教学而言，慕课只能作为补充手段，而不可以完全替代传统教学。在计算机应用基础教学过程中，除了传统教学内容，教师可以将计算机发展史的相关视频文件上传到慕课平台，让学生在课下学习，增加学生的学习的主观能动性和积极性。同时，教师应该在慕课平台提出阅读视频后的问题，并作为平时作业成绩进行评定，要求学生观看完视频后认真作答并提交作业。网络教学平台作为慕课的一种形式，已经在很多高校应用，教师可将授?n材料、实验材料上传到平台，学生可以登录平台使用材料完成作业等，这都为学生和教师提供了优质的网络辅助教学服务。　　1.4 调整更新课程教学内容　　计算机应用基础课程内容主要包括计算机基础知识、操作系统、网络技术、办公软件等，基本覆盖了学生日常使用。但是，信息技术日新月异，大数据、云计算、物联网、人工智能等技术不断涌现，高校教师应当对当前的计算机应用基础课程内容的设置进行适当调整。既要满足学生考取计算机相关证书的需要，也要教授当前最新的信息技术，让学生紧跟当前技术发展趋势，掌握最新实用的计算机技术。课程设置上，除了大学计算机应用基础以外，高校应为非计算机专业开设多个热点课程，例如安卓程序设计、硬件维护与故障排查、大数据、云计算等课程，充分满足学生的求知欲，提高学生对计算机的兴趣。　　2 结语　　综上所述，随着“互联网+”由行动计划上升为国家战略，作为高校公共基础课的计算机应用基础课程教学改革迫在眉睫。面向全校学生开设的计算机应用基础课程，应从因材施教，分层教学出发，与学生所学专业充分融合，提升学生学习兴趣。同时，更新教学内容，并应用虚拟仿真、慕课等新技术，为计算机应用基础的教学改革提供新思路和新方法。目前，计算机应用基础教学改革仍然处于探讨摸索阶段，希望通过上述方法为计算机应用基础教学改革提供一定帮助。"}
