{"title": "浅谈高职高专计算机教学中学生创新能力的培养", "url": "https://www.lunwendata.com/thesis/2019/152623.html", "time": ["2019-01-13"], "info": "　　中图分类号：G712 文献标识码：A 文章编号：1003-9082（2017）10-0-01　　前言　　在我国高等教育中，高职高专教育已经成为其中的一项重要内容，是培养新型人才的一个重要途径。随着计算机技术的不断发展，在我国许多院校之中，计算机教学成为其中的一门必修课程，极大的提高了学生专业能力的提升，而且也在一定程度上提升了学生的创新能力。下文主要围绕高职高专计算机教学，就学生创新能力的培养进行探究。　　一、计算机教学存在着主要问题　　1.教学方式较为单一、落后　　现如今，我国大多数高等院校都开设了计算机基础课程，旨在培养学生的计算机操作能力，使其能够更好的应对今后的发展。然而在教学过程中，许多学校仍然使用?魍车慕萄Х椒ǎ?过于重视对学生进行理论知识的传授，忽视了培养学生的实际操作能力，或者是实际操作教学的比重较小。此外，教师仍然以考试为方法，以学生记住一些机械的操作为目标来进行计算机教学，这样一来，就很难激发学生的学习兴趣，学习效率也大打折扣【1】。　　2.过于重视理论教学　　在计算机教学中，对于那些非计算机专业的学生，许多教师都更重视理论知识的传授，在教学过程中，对照计算机教材来给学生进行实际操作，让学生通过观看教师操作的方法来进行学习，然而这种方法并没有让学生亲自参与到实际操作之中，所以学生很难亲身去体会计算机操作时的注意点，也就难以让他们对该操作知识点有着深刻的印象。其实计算机这门课程对学生的实际操作能力有着更高的要求，开设这门课程的主要目的就是让学生去掌握各种软件，让学生能够熟练的掌握计算机操作的方法，教会学生获取各种信息的能力等等。所以教师过于重视理论教学就很难实现这一教学目标，也不利于学生创新能力的提升。　　3.计算机师资力量不足　　在计算机教学过程中，教师专业能力的好坏对教学效率有着重要的影响。只有教师具有较高的教学水平，才可以培养出专业技能较强的学生。然而，在我国高职高专院校中，计算机这一块的师资力量较为缺乏，存在着一些计算机教师身兼多职的现象。还存在着一些非计算机专业的教师用于计算机教学之中，这样就导致学生的学习需求难以得到有效的满足。此外，与我国重点大学以及本科院校相比，高职高专院校的发展要更为落后，办学资金有所欠缺，这就导致一些高职高专院校的教学条件较差，教学设备较为落后，难以满足学生的计算机技术学习。　　二、培养学生创新能力的主要方法　　1.丰富自己的教学方式　　要想培养学生的创新能力，仅仅使用传统的教学方式是完全不够的，计算机教师需要不断更新自己的教学方式，根据教学内容来选择有针对性的教学方式，继而提升学生的计算机能力。如，教师可以通过精讲多练的方式，以提升学生的自主学习能力。如，在讲授“word”时，教师可以将一些难懂、易错的内容进行讲解，然后引导学生自主的去进行操练，在这个过程中，教师仅仅充当引导者的角色，当学生遇到学习困难时，教师给予实时的点拨，这样能够培养学生的主动性。此外，教师还可以使用任务驱动教学法，也就是设计一个目标任务，让学生通过完成目标任务的方法来掌握所要学习的知识点，让学生可以在实践过程中掌握计算机软件的运用。这种方法充分激发了学生的主动性，对学生创新意识的发挥有着重要的作用。如在“Excel”教学过程中，在讲到数据填充时，教师可以给学生设计一个任务，让学生去填充一个有规律的工作表中的内容。那么学生通过自主的研究与思考，就会创造出更多的解决方法。有些同学通过自动筛选的方法来进行填充，还有的学生通过if函数的方法来进行填充。最后让学生去总结一个最为简单易行的方法。这样一来，就可以激发学生的创新欲望，提升他们的创新能力。　　2.激发学生的创新思维　　在今后的计算机教学中，教师应当改变以往重理论、轻能力的教学方法，要重视激发学生的创新思维，培养学生的实际操作能力。计算机教学的终极目标还是要让学生熟练的掌握计算机软件，让学生学会计算机操作。而要想培养学生的创新能力，就需要充分激发学生的创新思维，激发学生的计算机学习兴趣。要鼓励学生参与到实践、发现之中，让他们发挥自己的创造性思维，去获取知识【2】。如，在《PS图像处理》教学中，教师可以在网上下载一些优秀的作品，让学生去进行欣赏，以调动他们的创作热情。然后让学生发挥自己的个性，去设计一些作品。如，用PS这款软件设计一副海报，然后从中挑选一些优秀的作品，来进行评定。这样一来，不但能够提升了学生的实际操作能力，还有助于激发他们的创新能力。　　3.创新考核方式　　在许多高职高专院校中，大多数采用考试的方式来对学生的计算机能力进行考核，通过让学生上机操作某一个计算机知识技能的方法来对学生进行考核，这种考核方式较为单一，难以起到较好的考核效果。故此，教师可以创新考核方式，可以将学生分为若干小组，然后在上课过程中对小组的日常表现进行打分，最后设计一个稍难的学习任务，让小组各学生通过相互合作的方式来共同完成任务，最后教师再以小组的任务完成情况来评定学生的知识掌握情况。还可以通过其他的考核方式【3】。总之，就是要尽可能的客观反应学生的计算机操作能力，而不是凭借以此考试来论英雄。这样一来，学生在任务的完成过程中，就会集思广益，能够充分发挥自己的创新能力，以便将最好的作品展现给教师，展现给其他同学。　　结语　　综上，在今后的教学过程中，高职高专院校应当改革教学方式，要鼓励教师丰富自己的教学手段，要改变重理论轻能力的教学现象。要鼓励引导学生积极主动的参与到教学过程中，充分发挥他们的创新思维，并对考核方式进行不断的创新。这样一来，就能够提升学生的创新能力，能够使学生更好的掌握计算机技能。"}
