{"title": "计算机虚拟现实技术在高校体育训练中的应用", "url": "https://www.lunwendata.com/thesis/2019/155757.html", "time": ["2019-02-16"], "info": "　　计算机虚拟现实的概念区别于增强现实，但两种技术所追求的效果有相通之处，两种技术虽然都需要借助于计算机、传感器等设备来实现，但虚拟现实技术强调运用技术营造完全虚拟的环境，给人以“身临其境”的感受；增强现实技术则会在运用技术营造虚拟环境的同时借助于真实物体，即将虚拟环境叠加于真实环境中，更为注重真实感的营造。因增强现实技术的应用需要高技能的人才和尖端的技术及设备，目前应用并不广泛，而虚拟现实技术的应用则更具现实意义。　　一、计算机虚拟现实技术的基本概念　　虚拟现实技术主要是指由各种传感装置、硬件以及计算机软件构成的三维信息化人工虚拟环境。简而言之，虚拟现实技术就是运用高端技术及设备营造出虚拟环境，使人拥有“置身其中”的感受的同时，还可以实现与虚拟环境的交互。　　二、计算机虚拟现实技术在高校体育训练中的应用分类　　目前，计算机虚拟现实技术在体育训练系统中的应用类型主要有两种：一种是沉浸式，即训练者需要借助三维头盔、立体眼镜、立体环绕声耳机等设备，才可以体验到比较逼真的立体环境。该方式的优点是可以使训练者完全沉浸于虚拟环境中进行交互操作，同时缺点也非常明显，即设备要求齐全、成本高、操作复杂。另一种是非沉浸式，通常只需要借助于计算机，为训练者营造出平面的虚拟环境以供学习，如制作训练视频等，该种方式虽不能像沉浸式一样营造出立体的虚拟环境，却仍然能够为训练者带来丰富的听觉和视觉信息，操作较为简便。因此，我国高校体育训练中应用较多的是非沉浸式的虚拟现实技术。　　三、计算机虚拟现实技术在高校体育训练中的应用策略　　（一）塑造虚拟训练情境　　虽然任何体育运动形式都有一套系统的训练规则，但训练中遇到的情境仍然是千变万化的，加之学生对知识的理解和接受能力差异，这样就会导致教师的口头讲解效果大打折扣。然而，教师如果能够运用计算机虚拟现实技术，将训练情境制作成教学视频，不仅可以为学生直观地展示训练情境，节约物质投入，弥补现实条件受限的不足，甚至还可以尝试提前将教学视频发给学生，在不影响训练效果的前提下，鼓励学生自学，培养学生自主训练与学习的能力。计算机虚拟现实技术的科学合理应用，对学生来讲，不仅可以增加学习的趣味性，还可以提高学习效率；对于教师而言，一方面可以使自己的教学达到事半功倍的效果，另一方面又可以不断提升计算机操作技能。　　（二）采集测算运动数据　　“更高、更快、更强”的奥林匹克精神充分表达了体育运动的意义。因此，运动数据的采集和测算就显得十分重要，且在很多项目中，运动数据在很大程度上是?\\动效果的关键衡量标准。相比于运用传统工具对运动数据进行的采集、测算，运用计算机虚拟现实技术对运动数据的采集和测算更快速、更精确、更全面。[1]值得注意的是，运用传统采集工具只能采集到学生们的外在数据，而无法采集心理数据，长久以来，教师只能根据自己的观察，来把握学生们的心理状况，得出的数据并不准确，且会因教师的水平和经验等方面的不同而千差万别。运用计算机虚拟现实技术中的智能化仪器等设备，不仅可以轻松地采集到准确的心理数据，还可以对这些数据进行科学、快速地分析。　　（三）课程回放及分析训练效果　　不同的学生接受同样的知识所需要的时间是不同的，体育训练也不例外，但体育训练又不同于普通文化课的学习，学习文化课可以在课堂之外查看笔记，甚至可以通过自学掌握知识，而体育训练的示范性较强，错过课堂学习，或者课堂上没有能够掌握训练内容，学生如果想要重新学习，要求教师在课下反复示范是不现实的。但运用计算机虚拟现实技术则可轻松实现，学生可以在随时观看训练内容，方便学生学习的同时，还能减轻教师的课累，甚至可以避免许多不必要的训练伤害，帮助学生完成更高难度的训练任务。美国曾参加第十六届法国冬奥会滑雪项目比赛的运动员，就是运用了虚拟现实技术，即在黑暗的训练教室里虚拟训练场地进行训练，这样不仅省去了很多费用，节省了大量时间，而且可以进行更充分地训练，训练效果极佳。[2]体育训练作为一门课程，就要求学生必须达到一定的训练效果，如何准确分析学生们的训练情况至关重要。运用计算机虚拟现实技术，不仅可以对学生的运动情况进行量化，还可以用图谱将运动效果，如运动速度、位置移动等情况全面、直观地表现出来。通过对运动效果的分析，学生可以更直接地把握自己的训练弱项、技术盲点及缺点；教师也可以更系统地了解学生的训练状况，以便及时调整训练策略，达到训练目标。　　计算机虚拟现实技术作为一种全新的教学方式，被应用于高校体育训练是必然的发展趋势，这为体育爱好者进行更多、更难、更具挑战性的体育训练提供了可能性。这也说明，我国体育训练的长远发展和纵深革新，已离不开计算机等高新技术的支撑，但如何将两者更好地结合起来并加以推广、应用，则需要坚持不懈的探究与创新。"}
