{"title": "中高职教育《计算机应用基础》课程衔接研究", "url": "https://www.lunwendata.com/thesis/2019/156428.html", "time": ["2019-02-23"], "info": "　　中图分类号：G642 文献标识码：A 文章编号：1009-3044（2018）14-0136-02　　近年来，由于信息技术的高速发展，中高职校对于《计算机应用基础》课程教学也越来越重视，以此达到快速培养学生的计算机处理能力。以求他们能在互联网时代下能够有所作为。李克强总理也曾提出“互联网+”行动计划，要让互联网成为我国民众创新创业的工具。而中高职校作为国家培养专业技术人才的摇篮，因此中高职校教育的好坏对于国家来说，其重要程度不言而喻。但是，由于教育模式差异、师资水平等因素的影响，导致在中职和高职教学衔接之中存在着很大的问题。　　1 中高职教育《计算机应用基础》课程教学现状分析　　在现在的中高职院校中，对于计算机应用基础这门课程已经被广泛地应用于教学之中。通过培养学生的计算机基础知识，使他??在未来的发展中更具有可持续发展的潜力。计算机在当前社会中占据着举足轻重的地位，然而中职院校和高级院校在教育模式也有着很大的差异。对于中职院校来说。其教学大纲明确该课程的任务是：使学生掌握必备的计算机基础知识和基本技能，培养学生应用计算机解决工作生活中实际问题的能力；使学生初步具有应用计算机学习的能力；提升学生的信息素养。而对于高职院校来说，计算机基础课程注重计算机基础知识、基本概念和基本操作技能，同时兼顾计算机应用领域的前沿知识，为学生进一步学习和应用计算机知识打下坚实的基础。相对来说，高职院校对于计算应用基础的教学投入比较用心，教学模式也比较完善。但是由于高职院校学生来源大多是来自于普高，而在这些高中学校中，更加注重升学率，因此对于计算机的之类的辅修课程重视程度很低，认为其可有可无。以至于学生到了高职院校时对于计算机一窍不通，就会经常遇到学习上的困难。而中职院校却更注重学生的实际动手能力，对于计算机应用基础的课程教学重视程度不够。因为存在这样的教学模式差异，也导致了中高职院校课程衔接上存在着一些问题。　　2 中高职教育《计算机应用基础》课程衔接中存在的问题　　2.1 对计算机的认知差异　　中高职院校招生的对象主要是普通初中和普通高中，而因为初中学生和高中学生所接受的教育和其他方面的存在差异你，以至于在他们进入职校时对于计算机的认知也就存在相当大的差异。对于初中生来说，平时几乎不怎么接触电脑，大多数时间都是在学习或是玩耍，父母也会觉得那个年龄段过多接触电脑对他们弊大于利，也就导致他们在电脑的认知上就十分薄弱。而对于高中生来说，因为年龄大了一些，心智初中学生更成熟一些，再加上一定的独立思想和外在的诱惑。多少会接触电脑。虽然很多高中生都只是利用电脑玩游戏，但不可否认的是，在他们玩游戏的过程中，对于计算机的认知肯定是在日益增加。而另一方面导致中高职学生对于计算机认知存在差异是因为城乡差异。对于城市里的孩子来说，因为家庭经济不错，家里基本就有电脑，即便自己不怎么用，但由于家里人在用，他们在耳濡目染下，对于计算机也肯定会有一定的了解。但对于农村孩子来说，乡里邻里都很难有一家家里有电脑的，再加上经济条件的影响，他们对于电脑肯定接触很少，认知也就更少。　　2.2 计算机应用基础教程的重复　　虽然随着教育事业的日新月异，计算机信息网络的突飞猛进，中职和高职院校都将计算机应用基础课程纳入了必修课程之中。但是，中职和高职的计算机应用基础课程在很大程度上存在重复性。如果在中职学过的内容到了高职依旧没有什么变化，就会导致学生生出烦躁厌学的心理，缺乏积极性和上进心，这样不仅会阻碍他们自身的进步，而且对于他们的心理健康也会带来极大的影响。　　2.3 补充性和拓展性不足　　按理来说，高职的计算机应用基础课程是应该在中职的计算机应用基础课程上得到补充和拓展，以达到让学生学到更多的计算机知识和技能操作的目的。然而，在当前的高职计算机应用基础课程中却并不完全具备这样的补充性和拓展性。中职的计算机应用基础课程注重学生的基础知识和操作技能的学习，以考试作为衡量学生能力水平的唯一标准。而到了高职，虽然加设了更多的计算机应用课程的教学模式，但是，其本质上还是注重于学生的考试，大量学校实施以证代考，只要通过了计算机等级考试一级的学生就可以免考计算机应用　　基础这门课程，大量教师在教学时特别注重强化训练计算机等级考试的内容，确保授课学生能大部分通过计算机等级考试。老师们时刻教导学生的要考什么，才去学什么，而以这样为考试而去的学习方式，严重阻碍了学生们的进步，对于中职和高中计算机应用基础课程很难起到补充和拓展。　　3 中高职教育《计算机应用基础》课程衔接的改进措施　　3.1 针对性招生及分班　　在进行招生时，对于所招学生应该有一个相应的了解，不能单以考试成绩作为评判的标准，而是要看他们的理论知识以及实际操作能力，对于计算机的认知多少来进行招生，以避免他们在入学后差距太大，影响教学进度。另一方面，在分班时，应该对他们进行相应的测试后再分班。根据他们掌握知识的不同以及学习能力的不同进行分班，然后制定相应的教学方案，使他们都能够在更快的时间内学到有利于他们进步的内容。　　3.2 提高教学质量，优化教材内容　　要想中职和高职之间进行科学的衔接，促进学生的发展，那么，对于教学质量和教材内容就要提高重视程度。对于中职来说，所招学生因为普遍对于计算认知比较少，就应该在教学内容上降低一定的难度，使理论知识浅显易懂一些，操作简单一些，让他们能够更快更好的接受知识，提高他们的学习进度。而对于高职学生来说，由于在高中或是中职的时候已经对于计算机应用基础有了相应的了解，那么在教材上就应该适当的提升难度，在中职课程的基础上进行知识的补充和拓展，使学生能够不断的接受新知识，提高他们的计算机应用水平能力。　　3.3 加强实践教学　　于现在的社会现状来说，加强学生计算机应用的知识是必不可少。因此，无论是对于普通中学亦或中、高职校来说，都应该重视这个问题。应该引进更多适用于计算机应用基础教程上的设备，以提高学生实际操作的能力。在计算机应用基础中，只有通过理论与实践相结合，才能使学生对于知识的理解更加深刻，才能有效地提高他们自身的水平能力。　　3.4 与时俱进的新教学模式和教学内容　　计算机信息技术的发展是非常迅速的，所以无论是在教学模式上还是教学内容上都应该要时刻进行更新，以适应社会的发展进度。在教学模式上，应该采用最先进的教学方法，使学生接受知识的途径更多，接受的知识准确性更大。在教学内容上，应该有一种适应性和预判性，使学生所学知识能够适用于时代的发展中。　　4 结语　　计算机应用技术专业中高职课程衔接是我国计算机职业教育发展的必然要求，所以说，中高职重视计算机应用基础课程的教学并对其进行改革和创新是目前中高职院校发展的首要任务。只有让学生学习到更多有用的、新进的计算机应用知识和技能，才能有效地促进我国教育事业的发展，才能源源不断地为我国信息化与工业化深度融合培养大批高素质技术技能型人才。"}
