{"title": "面向中国制造2025的计算机辅助工业设计教学改革", "url": "https://www.lunwendata.com/thesis/2019/160347.html", "time": ["2019-07-24"], "info": "　　《中国制造2025》是中国政府实施制造强国战略的行动纲领之一。《中国制造2025》明确提出“推进制造过程智能化”，即当下广受关注的“智能制造”。计算机辅助工业设计，以计算机技术为依托，以提高产品设计的科学性、可靠性为目的。面对“智能制造”时代所带来的挑战和机遇，计算机辅助工业设计如何改革与创新，为中国制造更好地走向世界舞台出谋献策，是一个值得深思的课题。　　1 计算机辅助工业设计　　计算机辅助工业设计（Computer-Aided Industrial Design简称CAID），以计算机技术为依托，以数字化、可视化为特征，以提高产品设计的科学性、可靠性为目的。具体而言，CAID以CAD技术为依托，并与数控加工、快速成型、模具制造相联系，使工业设计呈现出综合化的发展趋势。它广泛应用于产品设计的各个阶段，具备高度的灵活性、高效率、低风险、开放性等优势，侧重设计因素的整合。设计师可以利用计算机进行造型设计、结构设计、人机分析等，未来将更加智能化。　　就目前的研究状况而言，国内部分学者已在该领域有所建树。如潘云鹤先生针对计算机辅助工业设计的发展情况，指出计算机辅助工业设計的核心在于产品设计，并对它的发展提出了许多富有前瞻性的建议[1]。李博等人以计算机辅助工业设计技术为切入点，结合材料、结构、工艺等因素，建立了产品设计的约束集，并在此基础上优化了设计流程[2]。彭程对图形图像处理技术的最新进展和应用情况作了研究，指出计算机图像处理技术提升了工作效率，降低了生产成本，并改变了以往的工作模式和生产方式[3]。　　2 中国制造2025　　《中国制造2025》明确提出“推进制造过程智能化”，在某些领域建设智能工厂，加快人机交互研究，推广工业机器人，实施物流管理的智能化等等。其中有一个值得注意的关键词，即“智能制造”，它是未来制造业的大趋势。　　智能制造是由机器和专家组成的智能系统，能进行某种程度的逻辑分析、决策等智能活动，目的在于部分地取代人的脑力劳动，表现为一种高度的智能化。其基本格局是分布式网络化智能系统，设计是重要节点之一。设计结点由CAD（计算机辅助设计）和它的代理（设计Agent）组成，它提供了一个友好的人机界面，方便设计师与计算机进行有效沟通，共同承担设计任务。CAD的主要作用在于协助设计师从用户的需求出发，提供最佳的产品解决方案。在整个系统当中，设计结点承担了承上启下的作用，对于了解用户的真实意图，并决定最后的生产方式至关重要。　　随着美国的“先进制造业伙伴计划”、德国的“工业4.0”、日本的“再兴战略”、法国的“未来工业”计划，中国制造2025的适时推出，可以说是与世界接轨。国内对于智能制造的研究正处于密切关注阶段，取得了不少有价值的成果。顾寄南教授从机器视觉、优化调度和系统自组织三个方面出发，指出了智能制造的最新发展趋势，为研究人员提供了理论参考[4]。   　　 3 教学改革　　3.1 教学的若干层次计算机辅助工业设计课程有相对固定的要求，通常而言，掌握基本的操作程序和方法是入门阶段，加深对复杂形体和结构的理解是提升阶段，熟练地运用于产品设计过程是最终目标。如此看来，计算机辅助工业设计的教学可分为四个基本层次，即基本操作、形体分析、造型方法、全流程思维。　　1）基本操作。基本操作是计算机辅助工业设计类课程的基础。对于大多数计算机辅助设计软件而言，其操作都有一定的程序，而掌握這些程序当中的逻辑关系至为重要，这将大大减少对于一些命令的记忆时间。对于普通用户而言，记忆大量的命令、步骤是最为枯燥乏味的，学习效果也是最差的。有鉴于此，这里有必要提醒学习者，理清各个模块之间的逻辑关系，对于理解软件的架构，熟练使用这些辅助平台有着非同寻常的意义。以ProEngineer软件为例，它分为草图、零件、钣金、工程图等几个主要模块，各个模块对应不同的产品开发阶段，理解它们之间的逻辑关系，可以大大提高学习效率。　　2）形体分析。计算机辅助设计软件有一个很大的功用即表达形体，不论是草图设计，还是效果图、模型设计，一个重要的动因就是推敲形体。因此，培养形态的分析与理解能力，是课程更深层次的目的[5]。在形体分析方面，计算机辅助设计软件有着天然的优势，特别是在360度演示、虚拟仿真等方面，可以很好地帮助设计师全方位的推敲形体，并最终作出正确的决定。手绘固然有快速、灵活等特点，但形体的真实效果、与形体有关的环境虚拟等这些方面，完全可以借助计算机辅助设计软件得以实现，这也是计算机辅助工业设计的初衷之一。尺有所短，寸有所长，对于计算机辅助工业设计要做到扬长避短、因势利导，才能更好地发挥它的辅助之用，为产品设计服务。　　3）造型方法。形体分析之后便是造型方法的运用，这是每一个设计师都必须经历的过程。对于造型方法，如叠加、渐削、切割、堆砌、加减、虚实对比等等，传统的手绘费时费力，且效果不够理想;计算机辅助设计软件却能够轻松的驾驭，且效果直观，这对于设计师解放双手有很大的帮助。另外，计算机辅助设计软件奉行的“所见即所得”的处理方式，对于设计师灵活地使用各种造型方法，起到了一个直观的验证方式，这是手绘无法比拟的。任何一种造型方法都需要经过实践的检验，计算机辅助设计软件的虚拟验证阶段，大大降低了实践验证的风险，而且在某种程度上改善了这一过程，这是最为难能可贵之处。　　4）全流程思维。产品设计是一个完整的过程，各个环节之间呈现出一种有机联系，它不是片断式的，割断任何一部分都将是有害的。这也就是现代产品设计所主张的全流程思维，将产品的创新融入一个完整的流程当中，以全局性、系统性的思维考虑问题，提出解决办法。计算机辅助设计课程就是产品设计全流程当中一个很好的联系纽带，贯穿产品设计的整个阶段。从形体分析到造型方法，从概念设计到模具开发，从产品投产到用户体验，计算机辅助设计都能够提供强有力的支撑，这对于产品设计而言，几乎是颠覆性的。　　3.2 改革措施　　探究式教学（InquiryTeaching），又称发现法、研究法[6]。针对一些基本概念和原理的学习，教师只提供具体的事例并提出问题，让学习者独立自主地通过观察、思考、阅读、讨论、实验等方式进行探究，自行得出结论的一种方法。国外研究机构曾对几种学习方法分别进行了实验，依据学生对知识点的掌握情况进行排序，依次为：传统讲授25%，视频教学30%，自学40%，讨论式学习50%，实践验证60%—70%，翻转课堂即学生替代教师授课高达90%。由此可见，在课程的学习过程中，学生的参与性超高，其对知识点的记忆和运用越娴熟。具体到计算机辅助工业设计课程而言，有必要改变现有授课模式，让学生参与教学，直至成为主角，教师负责启发和引导，共同营造一个良好的学习范围。　　项目驱动式教学法。在教学中把实际项目引入到课堂教学中，通过对项目的讲解、分析、制作完成相关理论知识和技能训练[7]。这一点，在计算机辅助工业设计课程中尤为重要。以往的虚拟课题，缺乏针对性、更缺乏设计的情境感，对于提高学生的设计水平是不利的。将实际项目与课程结合才能真正体现其“辅助”价值。　　“互联网+”教学法的改革。比如，当前广受学生欢迎的慕课、微课等形式，充分利用互联网技术并结合学生的兴趣点，以他们乐于接受的方式授课，这也是计算机辅助工业设计课程适应新形势的必然要求。从某种意义而言，“互联网+”教学法是一种因材施教、因时而异的典型应用。　　交互式教学理念。交互式教学的本质是信息在“教”与“学”两者之间的双向流动，以培养学生的积极性、主动性、创造性为目标，将学生视为学习的主体，同时更好地发挥教师的引导作用，提高教学质量。计算机辅助工业设计课程引入交互式教学理念，目的在于实现学生与教师两者之间的良性互动。　　4 结语　　《中国制造2025》之中很重要的一个关键词即“智能制造”，在未来的“智能制造”领域，计算机辅助工业设计将大有可为。　　“智能制造”可以理解为“智能机器”和“人类专家”两极，沟通二者的桥梁即计算机辅助工业设计，它一方面让机器更加智能，另一方面也让设计师更能读懂机器，二者相辅相成。如此看来，《中国制造2025》的实施，将是计算机辅助工业设计大发展的春天，挑战与机遇并存。计算机辅助工业设计要清醒地认识到“智能制造”所带来的挑战，特别是关于技术方面的，需锐意改革;同时，计算机辅助工业设计也要敏锐地意识到“智能制造”所蕴涵的机遇，找准切入点，大胆创新。创新没有终点，计算机辅助工业设计要紧紧围绕《中国制造2025》，做到“有所为，有所不为”，不断创新，适应新形势的要求，为中国制造走向世界舞台贡献一份力量。　　本文系南昌航空大学创新创业教育课程培育项目“Pro/Engineer软件”阶段性成果（项目编号：KCPY168）。"}
