{"title": "试论基于信息化背景下的高职计算机教学改革方略", "url": "https://www.lunwendata.com/thesis/2019/156433.html", "time": ["2019-02-23"], "info": "　　中图分类号：TP311 文献标识码：A 文章编号：1009-3044（2018）14-0106-02　　高职院校是人才培养的重要阵地，在高职计算机教学中，教师应当做好分析和探究，采用有效的方法培养学生的计算机技能， 以便更好地适应未来生活和工作的需要。当前，计算机已经逐渐普及，人们的生活中和工作中到处都离不开计算的运用，因此为了顺应时代发展的需求，高职院校计算机专业的教师要做好计算机方面的教学，有效改革自身的教学方略，培养学生专业化的计算机技能，满足社会发展的需求。　　1 信息化背景下高职计算机教学的优势　　随着当前信息化发展水平的不断提升，学生的在日常生活中接触计算机越来越频繁，对计算机的了解越来越多，这在一定程度上方便了教师教学，使得教学更加轻松，对于有效开展计算教学来说是十分有利的。具体来说，信息化背景下高职计算机教学的优势可以总结为如下两个方面：　　1.1 教学更加简单，学生理解能力增强　　在信息化背景下，人们的生活中到处充满信息化运用的影子，学生随时都能够接触到计算机，在运用计算机的过程中能够学到相对应的知识，这就方便了教师教学，教师能够针对大家都了解的基础知识进行略化讲解，从而节省较多的时间用于重点和难点知识的讲解，这就能够提升教学的效率和质量。同时，随着信息化发展的水平不断，高校计算机发展也呈现了快速、快捷、高效的特点，教师的教学网络较快、教学内容可以略过简单知识，教学效率较高等，使得教学更加有效。加之，当前很多高职院校的计算机设备相对比较充足，学生有一定的设备和时间进行知识学习，这就有助于推动学生学习积极性的提升，也提升了理解的能力，使得教学更加简便。　　1.2 教学内容由简单向复杂转变，有助于学生学习更多专业化技能　　由于计算机逐渐普及，学生运用计算机的水平不断提升，很多知识不需要教师的讲解学生就能够有效运用到实践中，因此教师的教学内容向更加复杂的方向转化，教学的范围不断拓宽，有助于学生学习更多的专业化技能，提升学习的积极性和有效性。传统教学模式下，教师开展计算机教学具有一定的困难，因为那个时期计算机没有普及，很多学生在生活中无法接触计算机，对计算机的了解处于空白状态，因此教师需要花费较多的时间用于基础知识的讲解上，专业知识的讲解存在较多的困难，教学的效率不高。而如今，计算机技术不断得到学生的运用，很多基础知识不需要教师花费较多的时间，那么专业化技能的培养就成了教学的主要内容，这就有助于学生学习更多专业化的知识，提升自身发展的整体水平。　　2 信息化背景下高?计算机教学中存在的问题分析　　随着信息化水平的不断提升，虽然高职计算机教学的水平得到了进一步的提升，但是其教学中仍然存在一些问题，使得教学的效果不佳。具体问题可以总结为如下几点：　　2.1 计算机教学脱离实际　　当前我国很多高职院校所采用的计算机教材过于老化，教材中的内容与实际生活中计算机运用的内容不符合，使得计算机教学脱离实际，学生无法学到应用的专业化知识。计算机行业处于一个不断发展的动态中，很多计算机技术在不断更新和优化，如果在高职计算机教学中，教师不注重教学知识的改进和完善，就无法适应当前社会发展的需求，学生所学的知识无法有效地运用在实践中，这就不利于学生学习质量的提升。现实状况中，我国很多高职院校计算机教学中往往会采用以往年度的教材，教材的更新速度较慢，不利于学生更好地学习知识。因此，高职院校的教师应当做好教材的分析和探究，及时进行教材的改进和优化，确保教材中所包含的内容以及专业化的技能与当前计算机实际应用中的技能相符合，这样才能使得学生所学习的内容与计算机技术发展处于同一个水平线上，才能使得学生真正学到有用的知识。　　2.2 教师的教学理念有待更新，过于注重理论方面教学　　计算机学科是一门实用性较强的学科，学生学习计算机知识的目的主要在于运用，希望能够通过学习获得有用的信息，并在实践中能够将知识运用起来。但是在实际的教学中，我国很多高职院校的计算机专业教师往往比较注重理论方面的教学，由于受到传统思想观念以及考试需求的影响，教师在教学中会为学生讲解较多的理论知识，而忽视实践教学的开展，而理论知识往往都具有一定的枯燥性和乏味性，学生在听取理论知识的时候效率往往不高，听过之后非常容易忘记，这就不利于知识的运用。因此教师应当更新自身的思想观念，积极进行教学模式的优化，增加实践方面的教学内容，让学生在实践的过程中记忆理论知识，提升学习的效果，促进学生更好地进行技能运用，做到学以致用。　　2.3 教学方式单一，效率低下　　当前我国很多高职院校对计算机方面课程教学仍然采用传统的授课方式，教师处于课堂的主导地位，进行知识的有效讲解，而学生处于被动的听课地位，单一性进行知识的接受。虽然在教学中教师偶尔也会运用多媒体，但是多媒体的运用往往是停留在原始阶段，所呈现的内容具有一定的枯燥性，教师往往是对照课件进行知识的复读，这就不利于学生更好地学习知识，单一的教学模式容易导致学生学习的效率不高。因此，教师应当进行教学方法的改革和完善，采用丰富多样的教学方法来激发学生的学习积极性，促进学习效率的提升。   　　3 信息化背景下高职计算机教学改革的对策　　在信息化背景下，改革和完善高职院校计算机教学，提升计算机教学的有效性和实用性是十分重要的，计算机专业的教师应当充分分析并思考当前自身教学中存在的问题，根据问题制定有效的解决对策，同时做好教学方式的创新，促进教学更加高效化和科学化。具体对策如下：　　3.1 及时更新教材，提升教学的时效性　　高职院校计算机专业的教师要做好计算机教材的引进和编制，根据当前计算机具体的运用状况和技能进行教材的引进，也可以教研小组根据实际状况进行计算机教材的合理编制，确保所运用到教学中的教材具有一定的有效性，所讲述到的技能能够有效地运用到实践中去，提升教学的意义。教材是学生学习的基础和依据，只有教材知识具有较大的实用性，学生才能从中学会应有的技能，才能促进学生将该技能应用到实践中去，提升学习的质量和效果，因此做好教材的选择和更替是尤为重要的。同时，学校要针对教研小组的教师进行相关的技能培训，让教师及时了解该方面的技能，获取计算机专业化的知识，在编制教材的过程中能够有足够的先进知识做基础，提升教材编制的有效性。　　3.2 与时俱进更新教学理念，增加实践教学环节　　高职计算机专业教师应当做好自身思想观念的更新，及时跟随社会发展的情况进行思想观念的升级和优化，摒弃传统理论教学的思维，适当增加实践课程的环节，为学生讲述更多实践知识，提升学生的动手能力，顺应素质教育的要求。在教学的过程中，教师也应当进行知识的灵活化和科学化讲述，不仅要讲述教材中的内容，还要将现实生活中能够运用到的，教材中没有的内容加入课堂教学中，为学生增加知识和技能，拓宽学生的知识面和视野，使得学生在掌握计算机知识的同时掌握更多的计算机发展趋势知识，全方位地了解计算机与计算机知识，提升学习的整体效果，促进实践能力的提升。另外，学校应当及时引进计算机设备，为学生更好地学习计算机技能做好基础，提供充足的资源。应当根据学生的人数以及教室的数量等合理进行计算机的引进和购买，增加计算机教学方面的投入，为计算机教学更加高效地开展做基础。　　3.3 多元化教学方法，提升教学的整体效率　　计算机教学本身就具有一定的枯燥性，如果教师单纯采用传统授课模式的话，学生往往学习的积极性不高，学习兴趣低下，无法真正发挥教学的作用。因此教师应当做好教学方法的完善和更新，采取多元化的教学模式开展授课，使得学生对计算机技能学习产生兴趣和欲望，提升学习的有效性。比如，教师可以采取比赛或者竞赛的形式开展教学，在讲解完某一个方面内容的时候，教师让学生就该内容进行实践，在计算机上合理运用该内容，或者运用计算机制定表格、图形等等， 制作最好的学生可以得到一定的奖励。通过该种形式学生往往为了得到奖励或者表扬都会积极进行知识的学习，学习的效率和水平不断提升。再比如可以采用小组合作的形式开展授课，将全班学生分为五个小组，教师在讲完某一章节知识之后，为学生布置任务，为每一个小组分配不同的任务，让小组学生合作进行任务的完成，并对任务进行分工，遇到不懂的问题可以与小?M学生进行积极的沟通和讨论。通过该种形式能够将死气沉沉的课堂氛围变得更加有活力，学生在充满激情的课堂氛围中学习，更能够激发学习的积极性，促进学习的水平有效提升。　　3.4 优化教师队伍，增加应用型教师的比例　　要想提升高职院校计算机教学的水平和效率，就需要壮大教师队伍，提升教师的整体素养和技能，促进教师更好地开展授课。当前，我国高职院校中，很多计算机专业的教师自身技能不高，专业素质参差不齐，教学的水平有待提升，因此学校要做好教师队伍的优化和健全，提升教师的专业能力，并增加应用型教师的比例，为学生更好地开展专业化知识的讲解做好基础。学校可以定期组织计算机专业的教师到相关的企业进行实践，感受计算机运用到工作中的作用，体会计算机的实际运用状况，并学习相关的专业化技能，以便更好地开展授课。学校还可以定期聘请经验丰富、专业化技能较高的人员到学校为教师进行知识培训，丰富教师的教学体系，优化教学构架，使得教师能够学到更多专业性的知识，为更好地开展教学提供依据。另外，学校可以鼓励教师在计算机技术方面开展创新性探索，对于取得优秀成果的教师给予奖励，激发教师探究的积极性。还要建立有效的考核机制，鼓励教师增加实践教学的内容，将实践教学的效果与绩效挂钩，充分促进教师更好地开展实践教学，提升教学的有效性和实用性价值。　　4 结束语　　要想实现高职院校计算机教学改革，顺应信息化发展的需求，提升计算机教学的有效性，就需要教师更新自身的思想观念，做好教材内容的引进和更新，采取多元化的教学方式，积极培养学生学习的积极性。当然，在信息化教学改革的过程中，教师也应当看到信息时代带来的机遇与挑战，做好教学内容的整合和优化，把握市场发展的动向，为学生讲解更多实用性的技能，让学生更好地适应社会发展的需求，为未来工作做好基础。"}
