{"title": "计算机组装与维护实验教学中存在的问题与改革方案", "url": "https://www.lunwendata.com/thesis/2019/155439.html", "time": ["2019-02-13"], "info": "　　中图分类号：G642 文献标识码：A 文章编号：1009-3044（2017）02-0137-02　　1 存在问题　　“计算机组装与维护”顾名思义，主要教学内容是培养学生关于计算机组装与维护的意识和综合能力，在国家大力提倡“创新、创业”的今天，学生综合能力的培养显得更加重要。然而在实际的教学操作过程中，仍存在的一些问题， 这些问题的出现严重阻碍了理论知识被学生吸收并转化为实践综合能力。　　（1）教材不新颖　　当今计算机技术发展较快，几乎每天都有技术的更新。而以往的计算机教材的更新速度却跟不上计算机技术的更新速度，这让计算机相关专业的学生所学教材存在各种问题（内容落后、类型单一等）。这些教材既不能让教师完整传授计算机知识，也不能使学生接触到最新的计算机知识。　　（2）理论和实践的矛盾　　计算机组装与维护本质上来讲是一种实验课。专业知识只是从侧面对学生的学习起到一个辅助作用。但在实际讲学当中，教师受到设备限制或者自我专业课理解的影响在上这一门课时仍然采用讲授的方式为学生进行这门课程的学习。事实上，大多数的学生其实连计算机的硬件都认不全，在理论课上听天书，待到有机会进行实验课时就更不想做实验了。这样的教学方式，学生很难从中学到全面的计算机组装与维护知识。　　（3）对学生的考核单一　　一般学校在对学生的期末考核当中，仍然采用分数的形式。以平时成绩（约占百分之三十）和期末成绩（约占百分之七十）相结合的方式对学生学期成绩进行评分。期末考试也主要是统一对学生本学期的理论知识进行一个大致概括，而缺少实践成绩。这种单一的考核方式过分注重学生在校成绩，而对学生在校的学习过程少了一些关注，忽略了对学生态度和内在情感目标的评价。同时考核人一般都是老师，测评主体较单一，不能完全评价学生在校的理论和实践能力的掌握程度。　　2 关于教学方式改变的一点儿建议　　2.1 自编教材　　自编教材既可以反映教师自己能力提高在学生中的影响力，又可以设计出一套符合学生现状的知识授予体系。教师通过收集网络、书本和自身理论知识，结合学生生活实践编写出一本适合现阶段学生学习的教材。借此可以充分提高学生学习主观能动性，调动学生兴趣，真正让学生学以致用，符合校方对学生的培养要求。　　2.2 采用项目教学法　　计算机组装与维护要求学生同时具备理论知识和实践能力，同时将两者结合以取得这门课的精髓。这就对学生的实验课提出了要求。因此在实验课上，老师可以采用项目教学法。将大项目分成几个小项目，同时把学生分为几个小组，一个小组完成一个任务。老师在学生的操作过程中不仅要指导学生，更要对学生的操作过程进行记录。在学生操作都完成过后，学生要自我评价，还要学生之间评价，同时老师也要参与到评价中去。　　（1）学生评价　　?W生小组在完成任务之后，先试着运行组装完成的计算机，互相探讨出现的问题以及出现问题的原因和解决方案。然后，学生在对本小组的学习任务完成情况进行自我评价并通过与他组对比完成互相评价。这种评价机制提升了学生的自主学习能力，同时共享了各组与各组，各学生与各学生之间的学习情况，有利于他家共同学习。　　（2）教师评价　　教师评价的第一手程序是对在学生小组实践过程中出现的问题进行分析，引导和与学生讨论关于此类问题的解决方案。然后教师对完成的项目进行评价，并提出改良建议，要求学生将经过完善后的项目在上交一遍作为学生最终成绩。这样的学习过程同时调动了学生和老师的积极性，使老师和学生之间互相讨论，由此形成了“互教互学”的现象，让老师和学生在共同学习中进步。　　2.3 加大在教师能力培养上的投入　　学校必须加大对教师专业素养培训的投入力度，让专业老师多利用假期去与学校有合作关系的企业或者国内高水平技术公司学习，打破传统观念，持有新的专业理念。除此之外，还可以不定期地请一些业界知名学者、企业家来学校给教师和学生讲授新理念、新产品和新技术。这样培养的教师方能走在时代前列，拥有较高专业素养，才能为社会培养更好的人才。　　2.4 增加校园和企业合作　　校园和企业握手是学校发展必经之路，是学生不脱离社会的体现，也是学校扩展到一定程度并最终与社会接轨的内在需求。一般情况下，学校实训仪器都会存在型号滞后，硬件太过落后的情况。但是在学校与联合企业签订合作协议之后，这一问题将会得到有效解决。同时企业可以帮助学习建立计算机组装与维护的实训基地，聘用行业高级人才，紧随当前的先进技术，为企业培养优质的高校人才。校园和企业合作的模式可以为学校培养一大批具有先进行业素养的人才，又为企业提供了生力军，使企业的投入得到回报，学习和企业获得了“双赢”。　　2.5 丰富教学媒介， 提升信息的交互水平　　计算机组装与维护课程具有操作性强的特点，在教学中应采用多媒体教学方式，制作交互性强、形式多样、图文并茂、生动活泼的多媒体课件，综合应用展示台、投影仪、计算机虚拟仿真系统等现代教学设备进行展示、讲解和示范，不仅可丰富教学内容，还大幅提升了教学内容的信息容量。应用多媒体教学方式可提高学生的学习兴趣，而且能帮助学生更深入地理解计算机组装与维护的知识要点，理解元器件的工作原理。在教学中还应采用实物展示教学方法，将计算机的硬件元器件实物现场展示，结合多媒体教学方法，让学生亲自动手组装微型计算机，教师进行指导，这可让课堂教学内容生动、具体，提高学生学习积极性，更全面的理解和掌握计算机组装和维护技能。　　3 总结　　在以上的论述之中，我们通过对问题的分析并提出了一些改革建议，希望能帮助优化计算机组装与维护这门课程的教学情况，使学生能够在很短的时间内掌握计算机硬件和软件的基本情况，了解计算机组装与维护的本质内涵，提升自我动手意识，也为后期的更深层次的学习计算机知识做好铺垫。"}
