{"title": "浅析计算机Office软件的分层教学", "url": "https://www.lunwendata.com/thesis/2019/155699.html", "time": ["2019-02-15"], "info": "　　中图分类号：G424 文献标识码：A 文章编号：1009-3044（2017）04-0092-02　　1 概述　　随着数据化信息化的发展，Office软件在我国的应用越来越广阔，各行各业都需要使用Office软件的人才，因此，计算机专业的学生要加强对 Office 软件的学习以适应高要求。在中职计算机教学中，Office 软件是重要的一门课程，生活和工作中的应用性强。学习并且掌握Office 软件，可以培养在文字处理方面的能力，也可以提高计算机素养，使得学生能够适应将来岗位的需求。　　2 中职学校Office软件教学中分层教学的重要性　　我国中职学校，大部分教学模式为大班授课的方式，这种教学方式存在着其优点，比如说节约了教学的资源和能够大批量的培养人才，可是也有其缺点，比如说，班里的学生学习进度不同，教课进度一样，会使得学生学习成绩差距越来越大，使得跟不上的学生对计算机的学习失去兴趣，影响了教学氛围和效果。所以，笔者认为分层教学是值得提倡的。　　分层教学，就是指的老师要重视学生之间的差异，根据不同学生的特性和意愿，分成几个小组，不同小组的教学进度和成绩采用不同的标准。分层教学坚持以人为本，重视学生的差异性，摒弃了传统大班教学的缺点，能够激发学生学习的积极主动性。　　3 分层教学在中职Office教学中的实现　　3.1 学生的分层　　计算机课程开启的时候，老师要对学生的基本情况进行全面的了解，采用档案资料、考试及调查等方法了解学生的计算机Office水平，把学生按照对Office的了解程度分为三个层次，每个层次的学生在学习的目标和要求上也有所不同，并且教学时要有针对性。在教学中，虽然中职的学生在文化课的成绩上不是那么优秀，在学习的主动积极性上也不强，可是也是有着自尊心的，成绩不优秀，也有一部分原因是因为老师的忽视。所以，给学生们分组的时候，不要仅仅按照成绩，要充分的了解学生的个人意愿和分组教学的根本目的，而且分组后，要调节学生心理，这样的话，既进行了分组教?W，又使得学生的自尊心得到了保护。还需要注意的是，学生分了小组，这个小组并不是永久的，要根据学习情况定期调整，从而提高教学的效率和学生的学习成绩。　　3.2 目标的分层　　在计算机教学的开始阶段，分层教学的主体是学生本身，接下来进行的是目标的分层，也就是说不同小组的学生的学习目标也不同，根据不同小组制定不同的目标。要结合学生的基础和学习能力来制定目标，计算机Office软件教学中，A小组的学生对学习的积极性比较强，计算机基础较好，学习兴趣浓厚。一般在教学目标制定时，老师会对A组的学生提出较高的要求：比如说，对Windows的系统和知识运用要熟练，对Office软件的应用要熟练，还要有一定的个人想法。老师可以制设置一些比较有探索性的知识，并且学生可以运用所学到的计算机知识来处理。B组的学生计算机的基础比A组稍微少一些，但是对计算机课程还是有着一定的兴趣，对老师所教的知识基本可以掌握，但是无法熟练应用，对于这个小组的学生，老师要多加鼓励，向A组的学生看齐。C组学生的计算机基础较差甚至零基础，平时接触少并且心里感觉难度大，对于C组的学生，老师首先要培养培养其兴趣和学习的好方法，规范其学习中的行为和习惯。　　3.3 教学的分层　　计算机Office 软件教学的核心部分就是教学的分层，学好Office软件也能保障教学目标的成功达成。教学分层的对象是全体学生，老师想让每个学生都达到教学目标，就要使用行之有效的教学方法和方式，这样不仅可以达成目标，也能使每一位学生的计算机水平提高。在实际的教学中，教学的分层有多种形式，比如：单独辅导和小组合作，这些形式可以使得不同基础的学生在短时间里提高自己的计算机水平。　　3.3.1 对学生的单独辅导　　在分层教学的A、B、C组里，B组的学生比例较大，老师应以B组学生为主，对 A组和C组的学生在课后单独辅导，这种单独辅导的形式，既节约了教学的资源，也适应了不同层次学生的需求。C组的学生基础，有很大部分原因是对计算机的学习没有兴趣、用的学习方法不合适等等，老师应该注重培养学生对计算机Office软件的学习兴趣，并养成良好的学习习惯和学习方法。对于A组的学生，老师可以给予他们更多比较复杂的题目和拓展训练，在课后进行单独辅导，让A组的学生不断进步。　　3.3.2 小组之间进行合作学习　　计算机Office 软件有着极强的理论性和实践性，跟传统的课堂比起来，课堂的主体应该由老师转变成学生，加强老师和学生之间的交流，从而提高每个学生的计算机Office软学习兴趣，形成良好的学习氛围和风气。老师先以传统讲授的方式对全班同学讲授计算机Office软件的相关知识，然后可以按不同的基础和具体的学习情况，分成学习互补的小组，每个小组中都包含着ABC三个层级的学生，老师每节课布置的任务，都可以小组共同完成。各个小组都有一个专门的组长，来组织和分配任务，各个组员也要积极配合组长，利用课间和自习，借助多种平台完成自己的任务。完成任务时，组长和组员、组员和组员之间要及时沟通，特别是C组的学生要多虚心请教AB组的学生。　　3.4 作业的分层　　老师布置作业，是为了巩固课上所学到的知识，是十分关键的，能够体现教学的效果。传统的计算机Office软件教学，老师给整个班级布置一样的作业，兼顾不了学生之间的差异性，教学效果不均匀。老师应该根据分层教学的教学理念，根据学生的差异性和特点，对不同层次的学生布置不同的作业，以提高各个层次学生的成绩，从而提高全体学生在计算机Office软件教学中的积极主动性。　　3.5 评价也要分层　　教学的分层，能够关心到各个层次的学生，发挥其潜能，评价的分层是对于不同的学生标准要不同，要存在差异性。老师要充分了解学生的差异性和学习的情况，对学生的学习提出表扬或建议，提高学生的学习积极主动性，为今后的学习夯实基础。在评价的过程中，老师需要重视的是：C组的学生基础差，积极性也差，要多鼓励、多表扬，增加其学习的自主积极性，对B组的学生也是，以表扬为主，树立其信心。对于A组的学生，可以制定完整的评价机制，树立其竞争意识。这种分层评价的方式，要根据学习的基础来评价，这是分层教学的关键所在，在分层评价的过程中，要尊重和理解学生。　　4 结语　　分层教学是一种有效的教学策略，它根据不同学生的差异，在教学中实施，不仅激发了学生的自主积极性，也提高了课堂教学效率及并且改善师生关系。这就需要计算机专业教师认识到分层教学的重要性，在日常教学中积极采用分层教学，使每个学生在原有基础上获得提高。"}
