{"title": "兴趣教学模式在技工院校计算机基础课程教学中的应用", "url": "https://www.lunwendata.com/thesis/2019/152675.html", "time": ["2019-01-14"], "info": "　　技工院校是培养人才的摇篮。随着社会的不断发展，各大企业对于技工学校学生的素质要求越来越高，这就意味着技工院校必须要提高教学质量。对于技工院校计算机教育而言，需要想方设法提高教学质量，才能提高学生的素质。　　1、兴趣教学模式在技工院校计算机基础教学中的作用　　长期以来，技工院校计算机基础教学模式比较传统，除了能够为学生提供最基本的知识之外，却无法调动学生的学习兴趣，使学生在学习中缺乏主动性，这样就会影响学生掌握知识的效果，无法真正掌握计算机的技能。因此，要重视激发学生的兴趣，使其形成一种教学模式，用来提升学生学习的积极性和主动性。　　1.1加强学生操作熟练度　　在计算机基础教学中，教学采用兴趣教学的方式不仅可以激发学生的兴趣和好奇心，还会培养学生养成自主学习的习惯。通过为学生展现计算机技术的神奇之处，就可以使学生对计算机充满浓厚的兴趣，在学习知识的过程中化被动为主动，带着这样的主动意识去学习，就可以逐渐加强学生的操作熟练度。　　1.2活跃课堂气氛　　教师要注重活跃课堂气氛，通过与学生互动，与学生保持良好的沟通方式，这样就可以使教学氛围更加轻松愉快，学生也会逐渐喜欢计算机课堂，提高注意力，以更加积极主动的方式投入到学习之中。　　1.3激发学生们的潜能　　兴趣教学模式的应用重在激发学生的兴趣，使学生化被动为主动，努力学习，并乐于在课后去自主探索知识。学生付出努力之后，就会大大激发学生的潜能，提高学生的成绩，扎实掌握相关基础知识。相反，如果学生对计算机教学没有兴趣，就不会花费时间去学习和努力，那么就不会有好的成绩，也谈不上掌握知识。由此可见，激发学生潜能的关键也在于兴趣。教师要高度重视兴趣模式在教学中的应用。　　2、技工院校计算机基础教学中存在的问题　　2.1 重视考证，忽略基础学习　　当前技工院校的计算基础教学缺乏明确的教学目的，忽视基础学习，过分重视计算机等级证书，并将其作为学习的主要目标，这样在教学中就忽略了基础知识的传授，而是将考证的内容作为重点。罗马不是一天建成的，掌握计算机技术的关键就在于基础知识的学习，由于在教学中忽视基础教学内容，就会造成学生基础能力十分欠缺。一些教师会对计算机等级考试的内容详细讲解，甚至采取多种方式全方位培养学生，使学生掌握考试方面的内容，久而久之，计算机教学变成了为考证而授课，忽视了对学生计算机能力的培养。结果，学生虽然顺利考下证书，但由于基础掌握不牢固，在未来的就业之路上却很难真正胜任相关工作，即使出现了一个简单的问题也无法解决。　　2.2缺乏个性差异的教学模式　　目前，技工院校计算机基础教学面临的最大问题就是教学模式十分单一，传统，无法激发学生的兴趣。一般情况下，教师会进行演示，然后学生再跟着教师做一遍，这样就会限制学生主观能动性的发挥。此外，虽然当前计算机教学十分普遍，但是学生的基础却参差不齐，有的基础好，有的基础较差，再加之技工计算机教学按照统一的标准进行，无法做到分层次教学，就会限制计算机能力强的学生更上一层楼，也会导致基础较差的学生对计算机的学习丧失信心。　　2.3计算机基础教学不注重技工学生专业需要　　目前，计算机基础教学无法真正做到与学生的专业挂钩。因技工学校有许多专业，因此计算机基础教学需要有一定的侧重点，一味按照传统的教学模式开展教学，不考虑学生的专业特点，那么将大大不利于学生计算机能力的培养，也无法培养学生理论联系实践的能力。因此，技工院校的计算机基础教学若不能与专业相结合，就很难激发学生的兴趣，也不会做到学以致用。　　3、兴趣教学模式在技工院校计算机基础教学中科学应用的方法　　3.1充分利用学生们的好奇心　　兴趣是最好的老师。激发学生的兴趣，才能使学生重视计算机基础知识的掌握。随着社会的不断进步和科学技术的迅速发展，计算机技术的重要性是不言而喻的，激发学生的关键在于引导学生了解学习计算机的重要性，然后充分利用自己的好奇心去探索知识。计算机技术为人们的生活带来了很大的方便，也创造了许多奇迹，教师要使学生了解这些背景，才能引起学生的关注。首先，教师要制作相关课件，在课堂中通过课件展示使学生了解他们最感兴趣的领域，从而激发学习计算机的兴趣，调动学习的积极性和主动性。目前，许多学生对娱乐、游戏等热点都很感兴趣，那么教师就可以在课件中适当穿插这些领域，与计算机相关知识结合，就可以激发学生的好奇心。　　3.2充分利用游戏提高教学和质量　　许多学生对游戏都很感兴趣，实际上，游戏自身的确散发着强烈的趣味性和挑战性，既可以给学生?Ю葱矶嗬秩ぃ?还能够锻炼学生的思维能力，开发学生的智商。教师要理性看待游戏的作用，不要带着偏见，而是要善于利用游戏对学生带来的有利影响实现兴趣教学。技工学校的许多学生对游戏也很感兴趣，教师要充分利用电脑游戏的趣味性，增强学生对知识的掌握。适当利用小游戏，使学生主动参与其中，一方面可以玩游戏，另一方面可以在潜移默化间掌握计算机知识，大大锻炼了学生的操作能力和动手能力，从而提升教学质量。　　3.3充分利用比赛促进教学　　在课堂教学中，教师还可以利用比赛提升学生的兴趣，防止学生对计算机知识产生厌倦之感。教师可以组织学生开展操作比赛，以个人或者团队比赛的形式激发学生的参与意识。对于取得名次的学生要予以奖励，从而调动起学生们的学习兴趣。此外，在团队操作比赛的过程中，需要学生之间彼此配合，充满默契，这样也培养了学生的团队协作能力。　　4、结语　　综上所述，兴趣教学模式在技工院校计算机基础教学中的应用可以充分激发学生的兴趣，使学生在学习中充满积极性和主动性，也可以为学生打造一个良好的学习氛围。同时，兴趣教学还能够使枯燥的知识变得富有趣味，使学生愿意探索，主动学习，从而形成自主学习的好习惯。■"}
