{"title": "浅谈高中计算机教学现状及对策", "url": "https://www.lunwendata.com/thesis/2019/156190.html", "time": ["2019-02-21"], "info": " 　　摘要：计算机在教育中的地位越来越重要，我们需要投入更多的精力来对计算机教育进行创新和研究。文中提到了一些针对现有问题的研究方法，但这远远是不够的，我们还需要更多的新手段、新方法来解决计算机在高中教育中遇到的问题。虽然这不是一日两日能解决的，但随着研究的不断深入，我相信，这些问题都会迎刃而解，计算机在高中教育中会有长足的发展。　　关键词：计算机 现状 对策深入分析当前我国高中计算机教学的现状，不难发现在高中计算机的实践教学中存在着包括教学思路、教学设备、教学考核形式、教师队伍等一系列环节在内的问题需要改进和调整，以适应日益变化和发展的计算机技术和社会需求。在高中的实践教学中，应该努力转变固有的传统应试式教学思路，主动吸收先进教学经验和模式，大胆应用到实际教学中；开发学生自主探索和学习的能力，注重理论与实践　　一、我国当前高中计算机教学的现状　　目前，我国计算机教学在高中阶段已经实行一段阶段，在具体的实践教学中，我们发现了目前我国高中计算机教学存在的一些问题：　　1.计算机教学形式过于单一死板，难以迎合时代需求和学生的心理。目前在计算机教学中应用的教学基本上都是：教师-教室-教材的单一循环，在具体的传授知识的环节更多的是给予接受式，并没有与时俱进地将传统的应试教育的就爱手理念转化成新的具有时代意义和应用价值的教学理念，没有很好地激发学生的潜能，想象力和创造思维均未开启，学生无法在有限的课堂时间吸收到有效信息，思考的过程往往被忽视，这样长久以往，学生的学习兴趣就会被磨灭甚至消耗殆尽，这将严重影响课堂教学质量以及教学效果。　　2.教学设施的滞后导致新技术无法及时有效地传达，学生眼界无法开阔。很多地方的高中计算机设施的建设还不够完善，很多学校上课教学用的计算机已经是很久之前的型号，以至于很多新的技术无法在课堂上教学或者无法实现应有的效果。在课堂上经常出现死机、蓝屏、无法操作等现象，一方面是学校的计算机设备的维护工作没有到位，另一方面就是计算机设备存在严重的老化以及滞后现象，这也是目前我国高中计算机教学中存在的比较容易解决的问题。　　3.教师的计算机水平相对较低，并未达到可以游刃有余教学的程度。目前高中计算机教学一线的教师基本上是经过短暂的培训时候上岗教学的，之前都没有专业的理论基础以及实践教学经验，具体的教学过程很大程度上也是教师在学习和提升的过程，在这样的状况下，很多知识和技术教师尚且处在研究和探索的阶段，因而在传授给学生的时候很难把握重心以及学生的需求，导致很多时候学生提出的疑问老师无法及时准确地予以反馈，使学生的知识链条出现断条或者空白。　　4.高中课业负担加重导致计算机科目的教学地位无法实现。高中是学生学习生涯中最重要的阶段，因而各种课业压力也是各个学习阶段中也是最重的。在大强度的教学计划和任务之下，计算机被设定为非专业课课程，这样在教学中投入的人力、物力、财力都得不到相应的保证，计算机这趟课程的重要性就得不到体现和保证。应该强调的是计算机技术是实用性的技术，是辅助学习最好的工具性课程，同时在计算机学习过程中所要求的学生的思维方式和动手能力。　　二、有效实施高中计算机教育的途径　　1.提高教师素质，选用合适教材　　教育是一个教学相长的过程，俗话说：没有教不好的学生，只有不会教的老师。虽然这话看起来有点片面，但也是有一定的道理的，也说明教师在教学过程中的重要性。名师出高徒，反过想，就是如果教师素质不高，那将是误人子弟，所以提高教师的素质应该是首要的。素质包括专业素质和道德素质。就高中从事计算机教学的教师来说，他们在计算机上应该是达到一定的级别的，学生都是非常聪明的，他们接触和学习新事物的能力是非常强的。特别是计算机这种实践性非常强的学科，学生可能多上几次机就会将一些软件应用的很熟，而且会希望有更加深入的学习和了解。计算机在现实生活中的应用都是最新的技术，如果与现实脱节了，那么学生现在学到的计算机知识在现实中根本就用不上。所以需要教师有良好的计算机学习能力，为学生做好引导者。再说，教师的道德素质一个老师为人师表就应该有他该有的样子。教师的一言一行往往是学生学习和模仿的对象。所以，一个品德高尚的教师才有可能教出品学兼优的好学生。　　2．重视学生实践能力的培养　　计算机是一门实践性很强的课，在高中阶段，学生不会接触到有关计算机的一些理论方面的知识或是有关编程方面的内容，大多是关于计算机的一些基本操作的学习。只有真正上机实践了，才能真正地知道该如何操作。站在岸上是永远学不会游泳的，只有亲身实践了，才明白其中的真意。计算机教学也一样，学生需要在教师讲解了之后，真正的上机操作，才能明白教师到底讲的是些什么，才能知道一些操作之后计算机会给出什么样的反映。在高中生普遍缺乏动手能力的情况下，计算机是一门很好的锻炼学生实践能力的科目，教师要充分利用，以此来引起学生对实践的兴趣，从此不仅重视计算机实践，更会重视其他科目的实践。　　3．制定激励措施，引发学生的创新积极性　　在培养学生创新能力上，在普通的课堂教学上可能很难完成。因为课堂教学的主要任务是完成规定的教训内容，对于创新很少涉及。学校可以通过一些其他的方式，来提高和培养学生的创新能力。比如，对于对计算机有兴趣和独到见解的学生，可以成立兴趣小组，有老师带队，做一些新的项目和开发研究。制定一套合理的奖励机制，对于学生的创新成果给予一定的肯定和奖励，激发学生的创新热情，让学生觉得自己创新是有人欣赏，是有价值的，从而以更积极的态度投入到新的创新中。　　三、结语　　信息社会已经被人们广泛地接受，计算机的应用知识已经得到广泛的普及，关于计算机应用的能力的掌握已经成为现代人最基本的技能和素质的标志。要全面地培养学生掌握计算机实用的知识和操作的技能，是在这个信息社会中对应用型人才的基本要求。在初中计算机教学培养的对象和培养的目标决定了计算机教学内容应具有广泛的应用性，所以，我们应该采用相适应的教学方法，并对教学方法进行改革，已适应时代发展的需要。　　参考文献：　　[1]陈世勇.高中信息技术课存在的问题与对策[J]. 中国信息技术教育. 2010(14)　　[2]何显平.论当前高中计算机教学面临的问题及对策[J]. 文理导航(中旬). 2010(07)　　[3]谢庆胜.浅谈有效实施高中计算机教学的方法[J]. 中国校外教育. 2011(13) "}
