{"title": "计算机网络技术专业理实一体化教学改革的问题及对策", "url": "https://www.lunwendata.com/thesis/2019/156576.html", "time": ["2019-02-25"], "info": "　　中图分类号：TP393 文献标识码：A 文章编号：1009-3044（2018）12-0109-02　　所谓的理实一体化，主要是指讲解理论知识和训练实践技能的一种教学模式，其在一定程度上可以将传统理论课、实验课与实训课之间的界限打破，实现生产、实践与理论教学的有机统一，集中教学环节，并安排同一个教师来专门负责完成一个教学任务，安排实训课为教学场所，以此确保师生能够进行双边的交流与互动，交替进行理论与实践、交错出现直观与抽象，以此可以将广大学生对于学习的兴趣充分调动起来。实践证明，理实一体化教学有助于实现职业院校的人才培养目标，但是需要对下面几个问题进行重点把握与科学处理。　　1 问题　　1.1 理论和实践脱节严重，知识更新速度慢　　在理实一体化教学改革中不难发现，专业教师基于自身知识更新速度较慢，相应的就很难跟上计算机网络发展的步伐，一些教师仍然采用传统的教学方式，即先对理论知识进行讲解后展开实践操作，相应的便很难实现理论与实践的有机结合，或因讲解内容过于陈旧，在衔接课程内容方面相应的会出现这样或那样的问题，致使理论与实践教学出现脱节严重的情况，从而这对于培养技能型和应用型人才和教?W质量的提高造成严重影响。　　1.2 缺乏相应的教材　　学生获取专业知识和教师进行课程讲解的主要来源、依据主要是教材，而在预定教材的过程中，却很难将与计算机网络技术专业理实一体化教材相适应的教材找出来。同时，诸多内容很难有效的衔接实训课题，致使经常需要将理论与实践教学两本书同时预订下来。如本专业的专业骨干课为《网络综合布线技术》，对于学生来说至关重要，尤其是网络综合布线工程就业方向的学生。　　1.3 不完善的教学方法　　传统的计算机网络技术理论与实践教学在某种程度上彼此相互独立，严格意义上是分开进行的，因此教学方法相对比较简单，实施起来比较容易。在理论教学中经常用到的方法主要是提问法、讨论法、实验法和讲授法，而实践教学则使用的教学方法较为单一，主要是“教师演示学生练习”。以本专业的知识特点为依据，为促进教学效率的显著提高，需要做出适当的改变，实现一体化教学，但是这并不是简单的结合传统单一的教学方法，而是由师生双方严格按照教学方法紧紧围绕课题来同时完成“教、学、做”。　　2 对策　　2.1 培养双师型教师　　所谓的双师型教师主要是指能够有效结合理论教学与实习操作 ，又能够对自身知识进行更新的教师队伍，具体的培养途径主要有：　　第一，确保青年教师在传、带和帮的方式进行一体化教学。对于青年教师而言，尽管具有较强的理论知识，但是在大学阶段的实际应用少之又少，所具备的实践能力并不强，为此可以专门安排一名教学经验丰富的教师做指导，确保青年教师在专业的辅导和协助下上将每一节课都上好。　　第二，促进校外校内培训的进一步强化。学校需要定期将计算机网络专业的教师组织起来，专门到师资培训机构开展学习与实际训练，通过教学理论的强化教育与学习，来确保他们在实际教学过程中能够将理论与实践更好、更系统的结合起来。为有效的提升开展一体化课程的教师素质，还需要借助多种形式，如微课教学、邀请知名专门开展面对面专题讲座、一体化教学讲课比赛等。　　第三，将教师组织起来，深入到企业生产一线定岗进行实习。将课余时间充分利用起来 ，节假日安排教师到企业参与具体的定岗技能训练，虚心向实践经验丰富的工程技术人员请教，尤其需要对应用计算机网络新技术与产学研实践探索进行重点提升。　　2.2 一体化的专业课程　　按照课程一体化的要求，需要事先有机统一和组合本专业课程的实践内容与理论知识，在此基础上将模块教学计划制定下来，对教学进度进行合理安排，并完成教学案例的编制。严格按照学生会用与适用的原则，以本专业培养方案和知识螺旋式上升规律为依据，对顺序教学和教学环节的一体化进行科学且合理的安排。　　2.3 一体化的专业教材　　一体化教学顺利开展的基础在于配套一体化教材的编写。第一，严格按照国家技能鉴定与教学纲要的规范来完成不同课程一体化教材的编写，确保其有效性、合理性、准确性与适用性；第二，严格按照学生的就业导向与企业的用人规范，专业知识的数量要始终坚持适用和够用的原则；在表达方式与结构布置上，以学生的认知规律为依据，本着从易到难和由浅入深的原则；第三，将社会与企业的用人趋向充分反映出来，为保证教材能够更好地顺应时代的发展需求，需要将网络的新知识、新技术与新工艺尽可能地引进来。　　2.4 一体化的教学方法　　理实一体化教学作为复合型教学形式的一种，学生需要在教师的引导下对本专业的理论知识与操作技能进行充分掌握，对全新的教学模式与方法进行应用。　　第一，教、学、做合一。立足于“技能是练与学出来的“基础之上，在技能实训室进行专业课程的学习，摒弃教师传统的教学方法，即教师主动讲和学生被动听的“填鸭式”教学模式和做实验的老套路，根据实际情况来促进师生交流互动新模式的形成，教师在讲授理论的过程中可以将一定的技能演示巧妙的穿插进来，实现学生理论学习、技能模仿与强化的有机结合。如在学习“办公室内信息点的布线施工”中，在一体化教学实训室内，教师可以对施工流程和相应技能规范进行边讲解与边操作，在此基础上有助于学生在边练习施工的过程中对它们具体的工作流程进行深入思考。只有将实际应用结合起来，才有助于师生展开互动式学习，促进学生学习积极性和主观能动性的显著提高，在短时间内更加牢固的掌握相关的知识。　　第二，“项目探究法”教学的开展。在项目的完成过程中，学生需要根据自身所掌握的知识与技能，采用分工合作的形式开展。如以“某企业园区网综合布线工程”为设计项目，模拟实际工作场景，学生主要被划分为三个小组，任务的完成均以组为单位，对小组成员进行合理分工，即分别负责资料的查找、调研、施工、材料的记录和材料的预算，在此基础上借助计算机有助于项目任务的完成，如讨论、实施与评价等。通过学生们的动手、动脑和动口能力可以生动形象的结合理论和实践，以此可以将个人的主观能动性与团队合作精神充分调动起来，这对于学生独立思考和解决问题能力的培养十分重要。　　3 结束语　　理实一体化教学与当下我国职业院校的教育发展相适应，合理运用可以起到事半功倍的效果，反之会产生不利影响。本文在客观分析计算机网络技术专业理实一体化教学改革中所面临问题的基础上，经过深入的思考有针对性地提出了相应的解决措施，在深入研究的基础上，将理实一体化教学的优势充分发挥出来，促进职业院校教学质量的显著提高。"}
