{"title": "学分制下高校计算机实验教学的实施及创新", "url": "https://www.lunwendata.com/thesis/2019/155825.html", "time": ["2019-02-17"], "info": " 　　摘要：随着教学改革的不断发展与深入，在高校的计算机教学中开始实施学分制下的实验教学，但是在教学实施过程中还存在着一些问题，本文就学分制下的高校计算机实验教学进行了分析。　　关键词：学分制；计算机；实验教学　　中图分类号：TP3-4 文献标识码：A 文章编号：1007-9599 (2012) 09-0000-02　　计算机教学是在高校中的一科重要的科目，本文就高校中计算机在学分制教学背景下的内涵、现状、以及未来的发展方向与策略进行了探究。　　一、学分制下的实验教学概述　　随着信息技术的不断发展以及进行改革的不断深入，计算机实验教学已经成为了很多高校中背景重视的一个课题，目前来说，学分制下的计算机实验教学已经取得了一定的成果，但是在研究的过程中也出现了一些问题，这就直接会对计算机实验教学产生一定的影响。　　对于计算机实验教学来说，其具有独特的特点，其实践性比较强，专业性比较高，而且应用性也比较广，而将学分制这种弹性机制应用于计算机实验教学中，就可以为计算机提供一个开放的环境与空间，这将更加的有利于对计算机的课程体系予以完善，对于促进计算机实验教学有着重要的意义。　　学分制下的计算机教学就是相对比于学年制的计算机教学来说的，学年制教学具有的特点是统一时间、统一内容、统一年限。而学分制教学就会有一定的弹性，这种教学模式就是在社会需求、教学计划、以及培养目标的基础山，根据不同学生的不同兴趣以及能力的差异情况，给学生自由选择学习的一种权利，给学生充分的自由，比如说在对于试验时间的安排、实验内容的选择、实验项目的操作、实验手段与方法的使用等等。最终实现一种计算机的层次化教学、多元化教学、信息化教学、以及自主化教学。实现计算机实验室教学的直观性、灵活性、创新性、实践性、多样性等等。　　实质上，这种学分制的计算机实验教学就是对于计算机理论知识的一种补充与验证，更是一种延伸与扩展，提高这种学分制的实验室教学将会更加促进学生的应用能力以及动手实践的能力。　　二、学分制实验室教学的现状　　（一）实验教学的现状　　在计算机教学中，尽管这种学分制的教学模式相对于传统的模式有很大的进步，但是学分制实验的教学模式以及手段、方法还处在一种探索的阶段，在教学资源、组织与管理等方面还有着很多不足之处。具体体现在以下几点：　　首先，教学理念比较落后。在计算机传统模式的影响下，对于计算机的教学方式往往都是一种理论教学，这就形成了一种“重视理论轻视实践，重视基础轻视应用”的传统思想，这种思想就导致了教师、管理的决策层等对于计算机实验教学还没有足够的重视起来。　　其次，教学资源有待完善。在计算机的教学中，其硬件投入还是很不足，原有的计算机设备都已经比较陈旧，这就意味着，在教学的过程中，缺乏一定的资源的共享平台以及管理机制，此外，实验教学的师资力量也比较薄弱，这就造成了教学的资源不足，以甚至浪费的现象也比较严重，这些问题都对于计算机实验教学的发展造成了一定的制约。　　再次，教学的内容与方法也不够健全。在计算机教学的过程中，比较重视知识的巩固以及知识的消化与理解。在对于实验项目的设置中，其比较重视基础性与知识性，而不够重视综合性与设计性。计算机的实验教学相对于理论的教学还存在着一定的冲突，方法比较单一、模式比较古板等等，这些都在很大程度上对学生的思维以及主动性与创造性造成了一定的限制。　　最后，在组织与管理方面还有待提高。在计算机教学中，对于学生的计算机基础、发展方向、专业特点、以及兴趣爱好都严重的忽视，而且在课堂中记录比较松散，考核的形式与评价的形式都比较单一，甚至是在计算机的教学管理方面，仍然是采取之前的那种三级的管理模式。　　（二）学分制改革的意义　　鉴于在学分制下的计算机教学存在的问题以及现状，学分制计算机教学改革将是一种必然的发展趋势，这对于提高计算机教学的质量都有着重要的意义。主要体现为以下几个方面：　　第一，将计算机的实验教学体系进一步完善，对教学的课程体系予以健全；第二，进一步推动了管理体制改革，树立一种正确的教学观念，即“因材施教。以人为本”；第三，对于计算机的教学资源予以整合，提供了设备的利用率；第四，将会促进计算机师资队伍的进一步建设，对教学管理水平予以提升；第五，发挥出了学生的积极性与主动能动性，提高了他们的综合素质与水平。　　三、学分制下计算机教学创新　　（一）增加硬件的投入，完善教学条件　　在计算机教学中，要想顺利实施实验教学就应该有必需的实验室，所以说，在高校应该重视对于实验室的建设与投资，进一步增加实验室的数量，经济的引进技术以及新型的设备，这样来为计算机的实验教学提供一个基础与物质上的保障。此外，可以运用计算机中，实验性的教学平台其虚拟化的技术，将各校与政府、企业相结合起来，提供一种应用程序以及均衡的搭配，来建立一种合作伙伴关系。这就能够将服务器集中进行管理，使得在一个平台中能够运用多个程序，并能够相互独立，实现这样的操作系统就有利于将高校的一些建设成本予以减少，而且对于应用部署来说，其时间也会缩短，这一来进一步提高计算机的工作效率。此外，还能够模拟生产实践与社会实践，整合计算机资源，将资源的使用率进一步优化，创新教学资源以及模式的创新，增强实验室的作用与功能，最终满足于学生的学习需求。　　（二）积极的推进计算机教学体系的改革　　通过对于实验室教学的数据进行分析，可以根据计算机的课程设计以及学科专业的相关要求，以计算机的实验项目中的划分为基础，比如划分为必修与选修，将学生的兴趣爱好作为发展的方向，来进一步的统筹课程之间的相互联系，以云计算的实验平台作为基础，将分散的操作系统予以整合，包括校内的各个专业以及院系、各个学校的相关资源。在进行整合之后，进一步的改革并完善教学体系，将实验教学中的一些知识性的、验证性的实验予以减少，增加一些综合性的、创新性的实验，最终实现一种“基础、专业、拓展”的一种分层教育。并且可以利用媒体比如说校园网来向学生提供信息。为学生营造一种虚拟化的开发环境、运行环境、以及测试环境。此外，还可以开展一些关于计算机的科研竞赛，在竞赛的过程中培养学生的综合性素质与能力。   　　（三）完善教学管理制度　　云计算模式的特点就是具有动态性、高效性、可以打大规模上处理一些信息，在计算机教学中，其主体就是以学号作为身份性的标识，然后存在于系统的平台中。通过一种服务提交以及数据的交换共享平台资源，这就能够对教学进行排课，以及对学生进行冲突性的相关检测判断。然后辅助学生进行选课，这样来保证正常的教学秩序，进一步解决理论教学与实践教学的相互矛盾。此外，还可以按照学生的要求以及实验项目来提供相应的虚拟性的电脑桌面。进一步部署、共享、配置教学资源，此外，还可以通过学分的细分化相关策略与多元化的、多样性的教学的考核形式，来进一步加强对于学生人才培养的质量控制。同时，企业应该及时的更新对于人才的需求，并最终获得学生的知识结构、学历认证、以及学习质量等各方面的信息，增加培养人才的更加透明。　　四、总结　　总之，随着信息技术的发展以及越来越高的人才培养要求，学分制下的计算机实验教学已经成为一种必然的发展趋势，这种教学模式能够实现对计算机资源的调配以及共享，能够增强学生的动手能力以及实践创新能力。所以，高校应该积极的推进这种教学模式的不断发展，积极的探求策略与方法，更加促进教学的全面进步。　　参考文献：　　[1]郜红建,常江,方明.基于学分制的实践教学内容改革与实践―以安徽农业大学农科专业为例[J].安徽农业大学学报(社会科学版),2010,06　　[2]朱英锁,李庆宁.关于高校实验教学管理与改革的探讨[J].安徽工业大学学报(社会科学版),2007,05　　[3]李作主,熊伟.发挥教师的主导作用,提高计算机课程的实验教学质量[J].电脑知识与技术,2008,26　　[4]张勇昌.基于“项目驱动”的计算机实验教学模式的研究[J].电脑知识与技术,2010,08　　[5]李宏,习剑锋,牛丽娜.学分制下的自助式开放实验探索[J].电气电子教学学报,2009,02　　[6]毛?H.分组策略―高校“计算机基础”课程实验教学改革初探[J].海南大学学报(自然科学版),2009,01　　[7]洛勇平.计算机实验教学的现状及其对策[J].现代教育科学,2007,S1　　[8]肖毅,宗莲松,潘华,陈卫泽,万鸣,王永忠.完全学分制下开放式实验教学与管理模式探索实践[J].四川经济管理学院学报,2010,04 "}
